{
  "collected_at": "2026-02-02T11:29:37.538120+00:00",
  "total_articles": 46,
  "time_window_days": 2,
  "articles": [
    {
      "title": "Raoul Pal Explains Why the Crypto Market Isn’t Broken Despite Recent Downturn",
      "source": "Coinpedia",
      "summary": "Log in to access your notifications and stay updated. If you’re not a member yet, Sign Up to get started! Nidhi is a Certified Digital Marketing Executive and Passionate crypto Journalist covering the world of alternative currencies. She shares the latest and trending news on Cryptocurrency and Blockchain. Raoul Pal says crypto isn’t broken; U.S. liquidity crunch and ETF outflows drive the downturn, but a bull market may be near. Bitcoin slides as $2.8B exits ETFs, yet Pal sees liquidity returning soon, setting the stage for a potential 2026 crypto bull run. The ongoing crypto sell-off has rattled investor confidence, but macro investor Raoul Pal believes the narrative around crypto being “broken” is deeply flawed. According to Pal, the current downturn has little to do with crypto-specific issues and everything to do with a severe liquidity crunch in the United States, triggered by repeated government shutdowns and broader structural drains in the financial system. In a recent X post , the Global Macro Investor founder explained that markets should be trending higher this cycle, but U.S. liquidity constraints are holding them back. Pal pointed to two U.S. government shutdowns as a major shock to liquidity, combined with issues in what he described as “U.S.",
      "full_text": "Log in to access your notifications and stay updated. If you’re not a member yet, Sign Up to get started! Nidhi is a Certified Digital Marketing Executive and Passionate crypto Journalist covering the world of alternative currencies. She shares the latest and trending news on Cryptocurrency and Blockchain. Raoul Pal says crypto isn’t broken; U.S. liquidity crunch and ETF outflows drive the downturn, but a bull market may be near. Bitcoin slides as $2.8B exits ETFs, yet Pal sees liquidity returning soon, setting the stage for a potential 2026 crypto bull run. The ongoing crypto sell-off has rattled investor confidence, but macro investor Raoul Pal believes the narrative around crypto being “broken” is deeply flawed. According to Pal, the current downturn has little to do with crypto-specific issues and everything to do with a severe liquidity crunch in the United States, triggered by repeated government shutdowns and broader structural drains in the financial system. In a recent X post , the Global Macro Investor founder explained that markets should be trending higher this cycle, but U.S. liquidity constraints are holding them back. Pal pointed to two U.S. government shutdowns as a major shock to liquidity, combined with issues in what he described as “U.S. plumbing.” Notably, the Reverse Repo facility drain was largely completed in 2024, removing a key source of excess liquidity that had previously supported risk assets. The most recent shutdown began last Friday, despite the Senate reaching a funding deal. With the House not in session until later this week, liquidity conditions tightened further, creating what Pal described as a temporary “air pocket” for markets. Still, he remains optimistic that the shutdown could be resolved soon, removing what he believes is the final major hurdle for liquidity to return. Pal also dismissed growing concerns around former Federal Reserve Governor Kevin Warsh, who has been nominated as the next Fed chair. Some market participants have labeled Warsh as hawkish, suggesting rate cuts may be delayed or avoided altogether. Pal called this narrative “baseless,” arguing that Warsh’s mandate aligns with a Greenspan-style playbook. According to Pal, Warsh is expected to cut rates and largely stay out of the way while fiscal authorities and banks drive liquidity. He emphasized that balance sheet tightening is unlikely due to existing reserve constraints, warning that aggressive moves could destabilize lending markets. While macro pressures dominate, Bitcoin remains under pressure in the near term. BTC is down another 2%, trading near $76,000 at press time, marking a sharp reversal from the upward momentum seen earlier this month. Heavy spot Bitcoin ETF outflows have amplified the weakness. Over the past two weeks alone, spot BTC ETFs recorded roughly $2.8 billion in net outflows, making January one of the worst months on record for institutional selling. Total assets under management across Bitcoin ETFs have now fallen about 31% from their October peak, dragging sentiment lower across the broader crypto market. Despite the brutal price action, Pal ended on a bullish note. He believes the forces suppressing liquidity are nearly exhausted and that markets are approaching a turning point. In his view, time, not short-term price moves, matters most in full-cycle investing. If liquidity begins to flow again as expected, Pal sees the groundwork being laid for a powerful bull phase heading into 2026. CoinPedia has been delivering accurate and timely cryptocurrency and blockchain updates since 2017. All content is created by our expert panel of analysts and journalists, following strict Editorial Guidelines based on E-E-A-T (Experience, Expertise, Authoritativeness, Trustworthiness). Every article is fact-checked against reputable sources to ensure accuracy, transparency, and reliability. Our review policy guarantees unbiased evaluations when recommending exchanges, platforms, or tools. We strive to provide timely updates about everything crypto & blockchain, right from startups to industry majors. All opinions and insights shared represent the author's own views on current market conditions. Please do your own research before making investment decisions. Neither the writer nor the publication assumes responsibility for your financial choices. Sponsored content and affiliate links may appear on our site. Advertisements are marked clearly, and our editorial content remains entirely independent from our ad partners. Search keywords to find relevant companies. Search keywords to find relevant market exchanges."
    },
    {
      "title": "Why is the Crypto Market Down Today?",
      "source": "Coinpedia",
      "summary": "Log in to access your notifications and stay updated. If you’re not a member yet, Sign Up to get started! Rizwan is an experienced Crypto journalist with almost half a decade of experience covering everything related to the growing crypto industry — from price analysis to blockchain disruption. During this period, he’s authored more than 3,000 news articles for Coinpedia News. Sohrab is a passionate cryptocurrency news writer with over five years of experience covering the industry. He keeps a keen interest in blockchain technology and its potential to revolutionize finance. Whether he's trading or writing, Sohrab always keeps his finger on the pulse of the crypto world, using his expertise to deliver informative and engaging articles that educate and inspire. When he's not analyzing the markets, Sohrab indulges in his hobbies of graphic design, minimal design or listening to his favorite hip-hop tunes. Crypto market price drops by 2% as total capitalization slips to $2.61 trillion today. Bitcoin falls to April 2024 levels while major altcoins Ethereum XRP Solana Dogecoin decline.",
      "full_text": "Log in to access your notifications and stay updated. If you’re not a member yet, Sign Up to get started! Rizwan is an experienced Crypto journalist with almost half a decade of experience covering everything related to the growing crypto industry — from price analysis to blockchain disruption. During this period, he’s authored more than 3,000 news articles for Coinpedia News. Sohrab is a passionate cryptocurrency news writer with over five years of experience covering the industry. He keeps a keen interest in blockchain technology and its potential to revolutionize finance. Whether he's trading or writing, Sohrab always keeps his finger on the pulse of the crypto world, using his expertise to deliver informative and engaging articles that educate and inspire.  When he's not analyzing the markets, Sohrab indulges in his hobbies of graphic design, minimal design or listening to his favorite hip-hop tunes. Crypto market price drops by 2% as total capitalization slips to $2.61 trillion today. Bitcoin falls to April 2024 levels while major altcoins Ethereum XRP Solana Dogecoin decline. Bitcoin and Ethereum ETFs see heavy outflows signaling reduced institutional crypto exposure. The crypto market is once again under pressure today, falling about 2%, pulling back to a total value of $2.61 trillion. Interestingly, 87 out of the top 100 cryptocurrencies are currently trading in the red. Bitcoin, the leading cryptocurrency, has dropped to its lowest level since April last year and is now trading around $77,324. Other major coins, including Ethereum, XRP, Solana, and DOGE, have also seen sharp declines today. So, what is driving the crypto market lower today? One of the main reasons behind today’s drop is renewed fear around interest rates. Market sentiment turned negative after U.S. President Donald Trump nominated Kevin Warsh as the next Federal Reserve chair. Warsh is known for supporting tighter monetary policy, which has raised concerns that interest rates could stay higher for longer. Meaning investors usually move money away from risky assets like Bitcoin. Adding to the uncertainty, investors are also concerned about the ongoing partial U.S. government shutdown. House Speaker Mike Johnson said the House is working to end the shutdown by today. Such political uncertainty often pushes investors away from risky assets, which puts more pressure on crypto prices. Another major factor dragging the market lower is continued outflows from crypto exchange-traded funds. Last week alone, Bitcoin ETFs saw nearly $1.5 billion in outflows, signaling that large institutions are reducing exposure. Major players like BlackRock, Fidelity, and Bitwise led the withdrawals. Ethereum ETFs also faced pressure, recording close to $460 million in outflows over the same period. These exits have added selling pressure to the spot market. The sell-off was made worse by heavy liquidations. More than $800 million worth of leveraged crypto positions were wiped out in the last 24 hours, mostly from long trades using high leverage. The largest single liquidation occurred on Hyperliquid, with a BTC-USD position worth $15.46 million. As liquidations surged, fear increased. The Crypto Fear and Greed Index has now dropped to 15, signaling extreme fear. After the recent sharp fall, veteran trader Peter Brandt has lowered his Bitcoin price target from $58K to $54K. Bitcoin is now hovering near key support around $74,500, and if this level breaks, the next major drop could take BTC down to about $66,530. Another crypto trader, Captain Faibik, warned that Bitcoin has lost a very important long-term support level, the weekly EMA100, for the first time in more than 840 days. This is seen as a negative signal on bigger timeframes. For now, traders are closely watching the $68,000 to $70,000 range. CoinPedia has been delivering accurate and timely cryptocurrency and blockchain updates since 2017. All content is created by our expert panel of analysts and journalists, following strict Editorial Guidelines based on E-E-A-T (Experience, Expertise, Authoritativeness, Trustworthiness). Every article is fact-checked against reputable sources to ensure accuracy, transparency, and reliability. Our review policy guarantees unbiased evaluations when recommending exchanges, platforms, or tools. We strive to provide timely updates about everything crypto & blockchain, right from startups to industry majors. All opinions and insights shared represent the author's own views on current market conditions. Please do your own research before making investment decisions. Neither the writer nor the publication assumes responsibility for your financial choices. Sponsored content and affiliate links may appear on our site. Advertisements are marked clearly, and our editorial content remains entirely independent from our ad partners. Search keywords to find relevant companies. Search keywords to find relevant market exchanges."
    },
    {
      "title": "When Will the Crypto Market Recover From This Downtrend?",
      "source": "Coinpedia",
      "summary": "Log in to access your notifications and stay updated. If you’re not a member yet, Sign Up to get started! Rizwan is an experienced Crypto journalist with almost half a decade of experience covering everything related to the growing crypto industry — from price analysis to blockchain disruption. During this period, he’s authored more than 3,000 news articles for Coinpedia News. Sohrab is a passionate cryptocurrency news writer with over five years of experience covering the industry. He keeps a keen interest in blockchain technology and its potential to revolutionize finance. Whether he's trading or writing, Sohrab always keeps his finger on the pulse of the crypto world, using his expertise to deliver informative and engaging articles that educate and inspire. When he's not analyzing the markets, Sohrab indulges in his hobbies of graphic design, minimal design or listening to his favorite hip-hop tunes. Crypto market drops 6% as Bitcoin falls to $76K; ETH, XRP, SOL, BNB, and ADA also face losses amid rate fears and weak investor sentiment. Crypto market drops 6% as Bitcoin falls to $76K; ETH, XRP, SOL, BNB, and ADA also face losses amid rate fears and weak investor sentiment.",
      "full_text": "Log in to access your notifications and stay updated. If you’re not a member yet, Sign Up to get started! Rizwan is an experienced Crypto journalist with almost half a decade of experience covering everything related to the growing crypto industry — from price analysis to blockchain disruption. During this period, he’s authored more than 3,000 news articles for Coinpedia News. Sohrab is a passionate cryptocurrency news writer with over five years of experience covering the industry. He keeps a keen interest in blockchain technology and its potential to revolutionize finance. Whether he's trading or writing, Sohrab always keeps his finger on the pulse of the crypto world, using his expertise to deliver informative and engaging articles that educate and inspire.  When he's not analyzing the markets, Sohrab indulges in his hobbies of graphic design, minimal design or listening to his favorite hip-hop tunes. Crypto market drops 6% as Bitcoin falls to $76K; ETH, XRP, SOL, BNB, and ADA also face losses amid rate fears and weak investor sentiment. Crypto market drops 6% as Bitcoin falls to $76K; ETH, XRP, SOL, BNB, and ADA also face losses amid rate fears and weak investor sentiment. The crypto market has seen a sharp sell-off , with total market value falling to $2.52 trillion, down by 6% in the last 24 hours. Bitcoin, the pioneer cryptocurrency, dropped heavily from $89,200 to a low of $74,561. Other major coins like ETH, XRP, SOL, BNB, and ADA also faced strong losses of around 8% to 15%. Now the big question remains: Will the crypto market recover this week, or will prices fall even further? Today, Bitcoin price slipped about 2.2%, falling to nearly $76,600, a level last seen in November 2024 The biggest reason behind the market drop is growing uncertainty around global interest rates. Market sentiment turned negative after President Donald Trump nominated Kevin Warsh as a possible Federal Reserve chair, which raised fears that interest rates could stay higher for longer. Adding more pressure, India’s Union Budget 2026 kept crypto tax rules the same. No new taxes were added, but strict rules stayed in place. This left many crypto investors disappointed. Several major U.S. economic events this week could influence crypto prices. On February 5, the latest Initial Jobless Claims data will be released. Analysts expect claims to rise slightly to 212,000 from last week’s figure of 209,000. If the number comes higher than expected, it may signal weakness in the U.S. job market. This could increase hopes that the Federal Reserve might slow down rate hikes, which is usually positive for Bitcoin and crypto prices. Further, on February 6, the U.S. unemployment rate and the monthly employment report will be announced. The unemployment rate is forecasted to rise to 4.5%, compared to 4.4% in December 2025. If economic data shows continued weakness, markets may price in future rate cuts, which could help crypto recover. Following this major event, Crypto trader Captain Faibik highlights that Bitcoin is losing a key long-term support level, the weekly EMA100, for the first time in over 840 days. This is seen as a warning sign on higher timeframes. For now, all eyes are on the $68,000–$70,000 zone, which acted as strong resistance throughout 2024 and may now serve as critical support. As of now, Bitcoin price is trading around $76,453, reflecting a drop of 2.2% seen in the last 24 hours. Stay ahead with breaking news, expert analysis, and real-time updates on the latest trends in Bitcoin, altcoins, DeFi, NFTs, and more. The crypto market dropped due to rising rate fears, disappointing investor sentiment, and Bitcoin losing key support levels. Crypto recovery this week depends on U.S. job data and investor sentiment; weak numbers may boost hopes for slower rate hikes. Key factors include U.S. jobless claims, unemployment rate, Federal Reserve policies, and overall global market confidence. ETH, XRP, SOL, BNB, and ADA fell 8–15% following Bitcoin’s drop, reflecting a broad crypto market decline today. CoinPedia has been delivering accurate and timely cryptocurrency and blockchain updates since 2017. All content is created by our expert panel of analysts and journalists, following strict Editorial Guidelines based on E-E-A-T (Experience, Expertise, Authoritativeness, Trustworthiness). Every article is fact-checked against reputable sources to ensure accuracy, transparency, and reliability. Our review policy guarantees unbiased evaluations when recommending exchanges, platforms, or tools. We strive to provide timely updates about everything crypto & blockchain, right from startups to industry majors. All opinions and insights shared represent the author's own views on current market conditions. Please do your own research before making investment decisions. Neither the writer nor the publication assumes responsibility for your financial choices. Sponsored content and affiliate links may appear on our site. Advertisements are marke"
    },
    {
      "title": "Why Gold and Silver Fell Dramatically and How Bitcoin Reacted",
      "source": "Coinpedia",
      "summary": "Log in to access your notifications and stay updated. If you’re not a member yet, Sign Up to get started! Fun-loving and cheerful, a passionate blockchain and crypto writer who knows no boundary…connect if you share the same passion. With 10+ years of writing experience, I am a Crypto Journalist by chance, exploring, and learning all the dynamics of the sci-fi action-filled crypto world. Currently, focusing on cryptocurrency news and price data. With a passion for research and challenging my capabilities, I am slowly getting into the crypto arena to bring new insights every day. Nidhi is a Certified Digital Marketing Executive and Passionate crypto Journalist covering the world of alternative currencies. She shares the latest and trending news on Cryptocurrency and Blockchain. Gold and silver plunged trillions in value amid dollar surge, margin hikes, and profit-taking, dragging Bitcoin lower in historic sell-off. Safe-haven metals crash: Gold down 20%, silver 40%, as market volatility spikes and crypto follows the brutal correction.",
      "full_text": "Log in to access your notifications and stay updated. If you’re not a member yet, Sign Up to get started! Fun-loving and cheerful, a passionate blockchain and crypto writer who knows no boundary…connect if you share the same passion.  With 10+ years of writing experience, I am a Crypto Journalist by chance, exploring, and learning all the dynamics of the sci-fi action-filled crypto world. Currently, focusing on cryptocurrency news and price data. With a passion for research and challenging my capabilities, I am slowly getting into the crypto arena to bring new insights every day. Nidhi is a Certified Digital Marketing Executive and Passionate crypto Journalist covering the world of alternative currencies. She shares the latest and trending news on Cryptocurrency and Blockchain. Gold and silver plunged trillions in value amid dollar surge, margin hikes, and profit-taking, dragging Bitcoin lower in historic sell-off. Safe-haven metals crash: Gold down 20%, silver 40%, as market volatility spikes and crypto follows the brutal correction. Gold and silver deepened their dramatic decline on Monday, extending last Friday’s historic rout that erased trillions in market value. What had been a powerful safe-haven rally quickly flipped into a violent correction, driven by a stronger U.S. dollar, aggressive profit-taking, and rising margin pressures. Analysts say the speed and scale of the move signal that speculative positioning had reached unsustainable levels. Spot gold dropped around 5% to $4,616.79 per ounce, following nearly 10% losses on Friday when prices crashed below $5,000. Silver fared far worse. After plunging nearly 30% in a single session last week, its worst daily performance since March 1980, the metal extended its fall, briefly sliding more than 12% before stabilizing near $78.30 per ounce. Crypto analyst, Bull Theory , described the move as a historic crash rather than a routine correction. According to the analyst, nearly $10 trillion in combined market value was erased from gold and silver in just three days. Gold alone was estimated to be down roughly 20% from its peak, wiping out about $7.4 trillion in value, around five times the entire market capitalization of Bitcoin. Silver’s collapse was even more extreme. Analyst noted that the metal has fallen close to 40% from its highs, erasing roughly $2.7 trillion in market value, a figure comparable to the entire crypto market. The analyst warned that so-called safe-haven assets are now trading with volatility levels more commonly associated with crypto memecoins, highlighting how crowded and leveraged these trades had become. A key driver of the sell-off has been renewed strength in the U.S. dollar. The dollar index has gained around 0.8% since Thursday, making dollar-denominated gold and silver more expensive for overseas buyers. At the same time, expectations for tighter monetary policy have increased the opportunity cost of holding non-yielding assets like gold. Markets were caught off guard after President Donald Trump nominated former Federal Reserve Governor Kevin Warsh to succeed Jerome Powell as Fed chair when his term ends in May. Warsh is known for favoring tighter monetary policy, a shift that has boosted the dollar and dampened enthusiasm for rate-sensitive assets. The CME Group moved quickly in response to last week’s volatility, announcing higher margin requirements effective after Monday’s market close. Margins on COMEX gold futures were raised from 6% to 8%, while margins on COMEX 5,000-ounce silver futures jumped from 11% to 15%. Crypto analyst Michaël van de Poppe focused on silver’s extended correction, noting that the metal was down more than 40% in just two days. He described the move as a “massive bloodbath” and pointed out that Bitcoin had already felt the impact over the weekend, though it had begun to stabilize as commodities took the brunt of the selling. Van de Poppe emphasized a recurring market pattern: when commodities fall sharply, crypto often follows. However, he also noted that once commodities find a bottom, digital assets have historically outperformed. Stay ahead with breaking news, expert analysis, and real-time updates on the latest trends in Bitcoin, altcoins, DeFi, NFTs, and more. Nearly $10 trillion was wiped out in three days, with gold down 20% and silver falling close to 40% from recent highs. Yes, Bitcoin dropped as crypto often follows sharp commodity declines, though it began stabilizing as metals took the brunt. Historically, Bitcoin stabilizes after commodity crashes, often rebounding once gold and silver find a market bottom. Heavy leverage, speculative positioning, and crowded trades made gold and silver react with crypto-like volatility in this sell-off. CoinPedia has been delivering accurate and timely cryptocurrency and blockchain updates since 2017. All content is created by our expert panel of analysts and journalists, following strict Editorial Guidelines based on E-E-A-T (Experience, Expertis"
    },
    {
      "title": "Jupiter Integrates Polymarket to Build Solana’s First On-Chain Prediction Market Hub",
      "source": "Coinpedia",
      "summary": "Log in to access your notifications and stay updated. If you’re not a member yet, Sign Up to get started! Fun-loving and cheerful, a passionate blockchain and crypto writer who knows no boundary…connect if you share the same passion. With 10+ years of writing experience, I am a Crypto Journalist by chance, exploring, and learning all the dynamics of the sci-fi action-filled crypto world. Currently, focusing on cryptocurrency news and price data. With a passion for research and challenging my capabilities, I am slowly getting into the crypto arena to bring new insights every day. Nidhi is a Certified Digital Marketing Executive and Passionate crypto Journalist covering the world of alternative currencies. She shares the latest and trending news on Cryptocurrency and Blockchain. Jupiter expands beyond swaps by integrating Polymarket, bringing prediction markets to Solana and positioning itself as a full on-chain finance hub. Backed by a $35M ParaFi Capital investment, Jupiter is doubling down on prediction markets as a core pillar of its long-term DeFi strategy.",
      "full_text": "Log in to access your notifications and stay updated. If you’re not a member yet, Sign Up to get started! Fun-loving and cheerful, a passionate blockchain and crypto writer who knows no boundary…connect if you share the same passion.  With 10+ years of writing experience, I am a Crypto Journalist by chance, exploring, and learning all the dynamics of the sci-fi action-filled crypto world. Currently, focusing on cryptocurrency news and price data. With a passion for research and challenging my capabilities, I am slowly getting into the crypto arena to bring new insights every day. Nidhi is a Certified Digital Marketing Executive and Passionate crypto Journalist covering the world of alternative currencies. She shares the latest and trending news on Cryptocurrency and Blockchain. Jupiter expands beyond swaps by integrating Polymarket, bringing prediction markets to Solana and positioning itself as a full on-chain finance hub. Backed by a $35M ParaFi Capital investment, Jupiter is doubling down on prediction markets as a core pillar of its long-term DeFi strategy. Solana-based decentralized exchange Jupiter is taking a significant step beyond token swaps by integrating Polymarket into its ecosystem. The move brings prediction markets to Solana through Jupiter for the first time, signaling a strategic shift toward building a more comprehensive on-chain financial platform. By adding event-based trading to its offerings, Jupiter is positioning itself as more than a liquidity router and aiming to become a central hub for multiple DeFi use cases. Jupiter described Polymarket as the largest prediction market in crypto and said the integration is designed to give users a unified on-chain experience. Traders will be able to engage with prediction markets alongside traditional DeFi products, reflecting Jupiter’s ambition to make predictions a core part of its long-term growth strategy. Prediction markets have gained renewed attention over the past year, particularly as traders increasingly speculate on elections, macroeconomic data, and major global events. Jupiter plans to lean into this momentum by developing dedicated infrastructure around prediction markets. While the team has not shared a launch timeline or technical details, it outlined plans to roll out prediction-focused APIs, revamped market discovery tools, deeper data insights on individual markets, and new trading and communication mechanisms. This focus suggests Jupiter sees prediction markets not as an add-on, but as a foundational pillar alongside swaps and other on-chain products. Alongside the Polymarket announcement, Jupiter revealed it has secured a $35 million strategic investment from ParaFi Capital. The investment was settled entirely in JupUSD, Jupiter’s dollar-pegged token, and executed at spot price. ParaFi also agreed to an extended lockup for its JUP tokens , a move widely viewed as a signal of long-term confidence in Jupiter’s roadmap. Jupiter said the fresh capital will be used to accelerate development across its broader on-chain financial infrastructure, with prediction markets expected to play a central role in the coming year. Jupiter already holds a dominant position within Solana’s DeFi landscape, with roughly $2.35 billion in total value locked and strong fee and revenue generation. Adding prediction markets further diversifies its product stack and deepens its relevance to active traders. At the same time, Jupiter has launched its long-awaited JUP airdrop, which has been highlighted as one of the largest token distributions on Solana. The airdrop is designed to reward genuine ecosystem participants, including users of swaps, perpetuals, lending, DCA, and limit orders, liquidity providers, stakers, and active SOL traders. Stay ahead with breaking news, expert analysis, and real-time updates on the latest trends in Bitcoin, altcoins, DeFi, NFTs, and more. Jupiter is integrating Polymarket to bring on-chain prediction markets to Solana, letting users trade event outcomes alongside swaps and other DeFi tools. Users get a unified DeFi experience, trading predictions, swaps, and other products in one place without leaving the Solana ecosystem. If successful, this move could attract new trading activity beyond swaps, encouraging other Solana protocols to build event-driven or data-based financial products. The next phase is likely infrastructure-focused, including developer tools and market interfaces. User-facing features may roll out gradually as Jupiter tests liquidity and demand. CoinPedia has been delivering accurate and timely cryptocurrency and blockchain updates since 2017. All content is created by our expert panel of analysts and journalists, following strict Editorial Guidelines based on E-E-A-T (Experience, Expertise, Authoritativeness, Trustworthiness). Every article is fact-checked against reputable sources to ensure accuracy, transparency, and reliability. Our review policy guarantees unbiased evaluations when recommending e"
    },
    {
      "title": "Michael Saylor’s Strategy Faces $900 Million Loss After Bitcoin Price Drop",
      "source": "Coinpedia",
      "summary": "Log in to access your notifications and stay updated. If you’re not a member yet, Sign Up to get started! Rizwan is an experienced Crypto journalist with almost half a decade of experience covering everything related to the growing crypto industry — from price analysis to blockchain disruption. During this period, he’s authored more than 3,000 news articles for Coinpedia News. Sohrab is a passionate cryptocurrency news writer with over five years of experience covering the industry. He keeps a keen interest in blockchain technology and its potential to revolutionize finance. Whether he's trading or writing, Sohrab always keeps his finger on the pulse of the crypto world, using his expertise to deliver informative and engaging articles that educate and inspire. When he's not analyzing the markets, Sohrab indulges in his hobbies of graphic design, minimal design or listening to his favorite hip-hop tunes. Bitcoin dip puts Michael Saylor’s Strategy in $900M paper loss, but no liquidation risk as BTC rebounds above $76K. Strategy stock struggles with Bitcoin’s volatility, yet Saylor hints at more BTC buying despite recent market weakness.",
      "full_text": "Log in to access your notifications and stay updated. If you’re not a member yet, Sign Up to get started! Rizwan is an experienced Crypto journalist with almost half a decade of experience covering everything related to the growing crypto industry — from price analysis to blockchain disruption. During this period, he’s authored more than 3,000 news articles for Coinpedia News. Sohrab is a passionate cryptocurrency news writer with over five years of experience covering the industry. He keeps a keen interest in blockchain technology and its potential to revolutionize finance. Whether he's trading or writing, Sohrab always keeps his finger on the pulse of the crypto world, using his expertise to deliver informative and engaging articles that educate and inspire.  When he's not analyzing the markets, Sohrab indulges in his hobbies of graphic design, minimal design or listening to his favorite hip-hop tunes. Bitcoin dip puts Michael Saylor’s Strategy in $900M paper loss, but no liquidation risk as BTC rebounds above $76K. Strategy stock struggles with Bitcoin’s volatility, yet Saylor hints at more BTC buying despite recent market weakness. The recent drop in Bitcoin price has put the, Michael Saylor’s Strategy in a sharp paper loss of $900 million after BTC slipped below the $75,000 level. Although the loss remains only on paper, the drop in BTC value has also dragged down Strategy’s stock price, raising concerns among investors about whether Strategy will liquidate Bitcoin to reduce further losses As of now, Strategy holds a massive 712,647 BTC, valued at around $54.36 billion. However, these coins were bought over time at an average price of about $76,040 per Bitcoin. Lookonchain, an on-chain analytics platform, highlighted that Strategy’s Bitcoin holdings briefly showed an unrealized loss of over $900 million when BTC dipped below $75K. This means short-term price drops do not automatically create financial pressure on the company. As a result, there is no immediate risk of liquidation, even during sharp market swings. However, Bitcoin’s price still matters greatly for Strategy. The company’s stock is closely linked to BTC movements because Strategy continues to fund its Bitcoin strategy through equity sales. A filing with the U.S. Securities and Exchange Commission earlier this year confirmed that Strategy relies on at-the-market share sales and other securities to raise capital for further Bitcoin purchases. While Bitcoin has stabilized, Strategy’s stock continues to struggle. Shares are down about 56% over the past year and recently traded near $149.7. As history shows, when Bitcoin rises, Strategy’s stock often moves faster, but when Bitcoin falls, losses can deepen just as quickly. Despite recent market weakness, Strategy shows no signs of changing direction. In a recent tweet post, Michael Saylor hinted at more Bitcoin purchases through a short social media post referencing “oranges,” a signal he has used many times before. In the past, similar posts have often been followed by official Bitcoin purchase announcements early the following week, suggesting another buy could be coming. After dipping below $75K, Bitcoin has rebounded and is now trading near $76,443. This recovery has pushed Strategy back into a small unrealized profit of around 0.40% on its total Bitcoin holdings. Stay ahead with breaking news, expert analysis, and real-time updates on the latest trends in Bitcoin, altcoins, DeFi, NFTs, and more. Strategy owns 712,647 BTC, valued at $54.36B, with an average purchase price of $76,040 per coin. No. Short-term BTC dips don’t force sales, and Strategy is sticking to its long-term Bitcoin accumulation plan. Strategy raises money through equity sales and at-the-market offerings to keep buying Bitcoin over time. Shares fell 56% over the past year, reflecting Bitcoin’s swings, showing a strong correlation between BTC and stock price. CoinPedia has been delivering accurate and timely cryptocurrency and blockchain updates since 2017. All content is created by our expert panel of analysts and journalists, following strict Editorial Guidelines based on E-E-A-T (Experience, Expertise, Authoritativeness, Trustworthiness). Every article is fact-checked against reputable sources to ensure accuracy, transparency, and reliability. Our review policy guarantees unbiased evaluations when recommending exchanges, platforms, or tools. We strive to provide timely updates about everything crypto & blockchain, right from startups to industry majors. All opinions and insights shared represent the author's own views on current market conditions. Please do your own research before making investment decisions. Neither the writer nor the publication assumes responsibility for your financial choices. Sponsored content and affiliate links may appear on our site. Advertisements are marked clearly, and our editorial content remains entirely independent from our ad partners. Search keywords to find relevant companies. Search k"
    },
    {
      "title": "Justin Sun Accused of TRX Market Manipulation by Alleged Ex‑Girlfriend with Evidence Claims",
      "source": "Coinpedia",
      "summary": "Log in to access your notifications and stay updated. If you’re not a member yet, Sign Up to get started! Rizwan is an experienced Crypto journalist with almost half a decade of experience covering everything related to the growing crypto industry — from price analysis to blockchain disruption. During this period, he’s authored more than 3,000 news articles for Coinpedia News. Sohrab is a passionate cryptocurrency news writer with over five years of experience covering the industry. He keeps a keen interest in blockchain technology and its potential to revolutionize finance. Whether he's trading or writing, Sohrab always keeps his finger on the pulse of the crypto world, using his expertise to deliver informative and engaging articles that educate and inspire. When he's not analyzing the markets, Sohrab indulges in his hobbies of graphic design, minimal design or listening to his favorite hip-hop tunes. Ex-girlfriend Ten Ten accuses Justin Sun of TRX price manipulation, alleging insider trading, coordinated Binance trades, and evidence for SEC review. Justin Sun faces fresh TRX allegations as Ten Ten claims he inflated prices via employee accounts, media hype, and plans to cooperate with U.S. authorities.",
      "full_text": "Log in to access your notifications and stay updated. If you’re not a member yet, Sign Up to get started! Rizwan is an experienced Crypto journalist with almost half a decade of experience covering everything related to the growing crypto industry — from price analysis to blockchain disruption. During this period, he’s authored more than 3,000 news articles for Coinpedia News. Sohrab is a passionate cryptocurrency news writer with over five years of experience covering the industry. He keeps a keen interest in blockchain technology and its potential to revolutionize finance. Whether he's trading or writing, Sohrab always keeps his finger on the pulse of the crypto world, using his expertise to deliver informative and engaging articles that educate and inspire.  When he's not analyzing the markets, Sohrab indulges in his hobbies of graphic design, minimal design or listening to his favorite hip-hop tunes. Ex-girlfriend Ten Ten accuses Justin Sun of TRX price manipulation, alleging insider trading, coordinated Binance trades, and evidence for SEC review. Justin Sun faces fresh TRX allegations as Ten Ten claims he inflated prices via employee accounts, media hype, and plans to cooperate with U.S. authorities. Tron Founder Justin Sun has again found himself in fresh allegations after a woman named Ten Ten, who claims to be his ex-girlfriend, shared a series of posts on X accusing him of manipulating the price of TRX. The claims have drawn attention across the crypto community, and calls for stricter action from law enforcement agencies. In a recent tweet post on X, Ten Ten said she is not making baseless accusations and claims to hold extensive evidence. She alleged that Justin Sun used the identities of several employees in Beijing to operate multiple Binance accounts in late 2017 and early 2018. According to her, these accounts were used to carry out coordinated buying and selling of TRX in order to push prices higher. She alleged that these actions were meant to artificially increase TRX’s market capitalization. Once prices rose, she claimed large-scale sell-offs followed, allowing insiders to profit while retail investors faced losses. Ten Ten also alleged that Justin Sun used media exposure and public hype to build excitement around TRX. She claimed this created an image of innovation and success, while the real activity involved insider trading and coordinated trades behind the scenes. According to her, insider trading and coordinated trades were taking place, and these actions played a key role in growing Justin Sun’s wealth. She also shared the names of twelve people from mainland China, alleging they worked under Justin Sun and took part in these activities. The names included Liu Tingting, Zhao Ling, Wei Shuai, Du Xuewen, Zhang Xin, Huang Kaijie, Han Min, Liu Jintong, Quan Yueyuan, Jiang Nijun, Liu Siqin, and Zhao Jitong. Ten Ten said she was in a personal relationship with Justin Sun during Tron’s early days, which she claims gave her direct knowledge of these events. She added that she stayed silent for years out of fear, saying money, influence, and power kept her from speaking earlier, but that fear is now gone. She then followed up with a joke that, “I also have an ‘Epstein files’ of the crypto world.” Lastly, Ten Ten said she is prepared to cooperate fully with an investigation by the U.S. Securities and Exchange Commission. She claimed to hold WeChat chat records, emails, exchange activity logs, phone data, and employee-provided evidence to support her allegations. She also publicly requested U.S. authorities to contact her. As of now, Justin Sun has not publicly responded, and no official action from regulators has been announced. Stay ahead with breaking news, expert analysis, and real-time updates on the latest trends in Bitcoin, altcoins, DeFi, NFTs, and more. If authorities verify the claims, he could face fines, sanctions, or SEC enforcement actions for market abuse. Insider trading can harm investor trust, reduce market liquidity, and trigger regulatory investigations. Diversify holdings, research projects carefully, avoid hype-driven trades, and monitor market activity for red flags. CoinPedia has been delivering accurate and timely cryptocurrency and blockchain updates since 2017. All content is created by our expert panel of analysts and journalists, following strict Editorial Guidelines based on E-E-A-T (Experience, Expertise, Authoritativeness, Trustworthiness). Every article is fact-checked against reputable sources to ensure accuracy, transparency, and reliability. Our review policy guarantees unbiased evaluations when recommending exchanges, platforms, or tools. We strive to provide timely updates about everything crypto & blockchain, right from startups to industry majors. All opinions and insights shared represent the author's own views on current market conditions. Please do your own research before making investment decisions. Neither the writer nor the publication assumes re"
    },
    {
      "title": "Meme Coin Crash Wipes Out $58M From Murad Mahmudov’s Portfolio",
      "source": "Coinpedia",
      "summary": "Log in to access your notifications and stay updated. If you’re not a member yet, Sign Up to get started! Fun-loving and cheerful, a passionate blockchain and crypto writer who knows no boundary…connect if you share the same passion. With 10+ years of writing experience, I am a Crypto Journalist by chance, exploring, and learning all the dynamics of the sci-fi action-filled crypto world. Currently, focusing on cryptocurrency news and price data. With a passion for research and challenging my capabilities, I am slowly getting into the crypto arena to bring new insights every day. Nidhi is a Certified Digital Marketing Executive and Passionate crypto Journalist covering the world of alternative currencies. She shares the latest and trending news on Cryptocurrency and Blockchain. Bitcoin slid toward $82,000 as crypto liquidations hit $1.7B, triggering extreme fear and a sharp sell-off in high-risk meme coins. Meme-coin KOL Murad Mahmudov saw his portfolio plunge 86%, losing $58M as concentrated bets and leverage amplified losses in the downturn.",
      "full_text": "Log in to access your notifications and stay updated. If you’re not a member yet, Sign Up to get started! Fun-loving and cheerful, a passionate blockchain and crypto writer who knows no boundary…connect if you share the same passion.  With 10+ years of writing experience, I am a Crypto Journalist by chance, exploring, and learning all the dynamics of the sci-fi action-filled crypto world. Currently, focusing on cryptocurrency news and price data. With a passion for research and challenging my capabilities, I am slowly getting into the crypto arena to bring new insights every day. Nidhi is a Certified Digital Marketing Executive and Passionate crypto Journalist covering the world of alternative currencies. She shares the latest and trending news on Cryptocurrency and Blockchain. Bitcoin slid toward $82,000 as crypto liquidations hit $1.7B, triggering extreme fear and a sharp sell-off in high-risk meme coins. Meme-coin KOL Murad Mahmudov saw his portfolio plunge 86%, losing $58M as concentrated bets and leverage amplified losses in the downturn. January 2026 opened with a sharp reminder of crypto’s volatility. Bitcoin slipped toward the $82,000 mark, while total market liquidations surged past $1.7 billion in a single wave of selling. Investor sentiment deteriorated rapidly, with the Crypto Fear & Greed Index falling into extreme fear territory. Amid this market stress, a high-profile meme coin collapse drew widespread attention across the crypto community. According to Ash Crypto , prominent meme-coin KOL Murad Mahmudov saw his meme coin portfolio collapse by nearly 86% over the past six months. At its peak in July 2025, the portfolio was valued at around $67 million. Today, that figure has fallen sharply to roughly $9.1 million, translating to cumulative losses of about $58 million during the downturn. The scale of the drawdown has made Murad’s portfolio a clear case study of how quickly speculative crypto wealth can evaporate when market conditions shift. Murad’s holdings were heavily concentrated in meme-based tokens, which suffered some of the steepest declines during the broader market pullback that began in late 2024. His largest reported position, SPX6900 (SPX), dropped more than 80% from its all-time high. Other major meme coin positions reportedly fell between 75% and 90%, compounding the overall damage. This concentration significantly amplified losses as risk appetite faded. Unlike larger cryptocurrencies with deeper liquidity and broader use cases, meme coins tend to move sharply with sentiment, making them especially vulnerable during market-wide sell-offs. Analysts point to several overlapping factors driving such extreme declines. A shift in macro sentiment often pushes investors away from speculative assets first. Meme coins , which typically lack strong fundamentals or utility, are highly dependent on hype cycles and social momentum. Once that momentum breaks, selling pressure can escalate quickly. Leverage also plays a key role. Aggressive traders frequently use borrowed capital in meme coin markets, which can trigger cascading liquidations as prices fall, accelerating losses across the board. While Mahmudov’s experience is notable due to his public profile, the pattern itself is familiar to seasoned crypto observers. Sharp drawdowns of 75% to 95% are not unusual for meme coins during broader downturns. The episode reinforces a long-standing lesson: diversification matters, speculative assets carry outsized risk, and capital allocated to high-volatility tokens must be money investors can afford to lose. As crypto markets remain fragile , Murad’s portfolio collapse stands as a timely reminder that even during bull cycles, risk management remains essential. Stay ahead with breaking news, expert analysis, and real-time updates on the latest trends in Bitcoin, altcoins, DeFi, NFTs, and more. Meme coins rely heavily on hype and leverage, so when sentiment turns negative, they often fall faster and deeper than established assets like Bitcoin. SPX6900 lost over 80%, while other top meme tokens fell 75–90% during the latest crypto market downturn. Yes. Meme coins often fall 75–95% during downturns, highlighting the importance of risk management and portfolio balance. High returns come with high risk; disciplined investing, research, and diversification reduce the chance of catastrophic losses. CoinPedia has been delivering accurate and timely cryptocurrency and blockchain updates since 2017. All content is created by our expert panel of analysts and journalists, following strict Editorial Guidelines based on E-E-A-T (Experience, Expertise, Authoritativeness, Trustworthiness). Every article is fact-checked against reputable sources to ensure accuracy, transparency, and reliability. Our review policy guarantees unbiased evaluations when recommending exchanges, platforms, or tools. We strive to provide timely updates about everything crypto & blockchain, right from startups to industry majors. All opi"
    },
    {
      "title": "Why is Bitcoin Price Going Down Today?",
      "source": "Coinpedia",
      "summary": "Log in to access your notifications and stay updated. If you’re not a member yet, Sign Up to get started! Writer by choice, CryptoCurrency Writer, and Researcher by chance. Currently, focusing on financial news and analysis, as well as cryptocurrency news and data. One may not call me a crypto “Enthusiast” but trust me I'm getting there. The crypto market is under heavy pressure today, with prices falling sharply over the weekend and investors asking one question: what went wrong? The answer lies in a mix of forced selling, weak demand, and price levels breaking all at once. The total crypto market value has dropped to around $2.6 trillion, down nearly 5% in the last 24 hours. Bitcoin, which was trying to hold above $78,000, has now slipped below that level, adding to market fear. Many traders are now watching the next major support near $75,000.",
      "full_text": "Log in to access your notifications and stay updated. If you’re not a member yet, Sign Up to get started! Writer by choice, CryptoCurrency Writer, and Researcher by chance.  Currently, focusing on financial news and analysis, as well as cryptocurrency news and data. One may not call me a crypto “Enthusiast” but trust me I'm getting there. The crypto market is under heavy pressure today, with prices falling sharply over the weekend and investors asking one question: what went wrong? The answer lies in a mix of forced selling, weak demand, and price levels breaking all at once. The total crypto market value has dropped to around $2.6 trillion, down nearly 5% in the last 24 hours. Bitcoin, which was trying to hold above $78,000, has now slipped below that level, adding to market fear. Many traders are now watching the next major support near $75,000. The biggest driver of today’s crash is liquidations. In just 24 hours, more than $2.58 billion worth of crypto positions were wiped out. This happens when traders use borrowed money and prices move against them, forcing exchanges to close positions automatically. Weekend markets usually have lower trading volume and thinner liquidity. That means fewer buyers are available when prices start falling. As Bitcoin dropped below key levels, sell orders piled up quickly, pushing prices down faster than usual. Bitcoin falling below $78,000 was a major technical trigger. This level had been acting as short-term support. Once it broke, many traders exited positions. Bitcoin is also testing an important long-term support level when compared to gold, making this zone critical. If Bitcoin fails to hold near current levels, analysts see $75,000 as the next strong support. A break below that could bring even more selling. Altcoins are feeling even more pain: Investor sentiment has collapsed. The Fear and Greed Index is at 18, which signals extreme fear . Technical indicators show most coins are now oversold, meaning prices have fallen very quickly in a short time. On top of liquidations, demand has been weak. Large investors have been cautious, and there has been no strong buying support to absorb the selling. When forced liquidations meet low demand, prices fall fast. The market now depends on whether Bitcoin can stabilise above $75,000. If selling slows and liquidations dry up, a short-term bounce is possible. But if fear continues and key supports fail, volatility could remain high in the coming days. For now, the weekend crash shows how quickly crypto markets can turn when leverage, fear, and low liquidity collide. CoinPedia has been delivering accurate and timely cryptocurrency and blockchain updates since 2017. All content is created by our expert panel of analysts and journalists, following strict Editorial Guidelines based on E-E-A-T (Experience, Expertise, Authoritativeness, Trustworthiness). Every article is fact-checked against reputable sources to ensure accuracy, transparency, and reliability. Our review policy guarantees unbiased evaluations when recommending exchanges, platforms, or tools. We strive to provide timely updates about everything crypto & blockchain, right from startups to industry majors. All opinions and insights shared represent the author's own views on current market conditions. Please do your own research before making investment decisions. Neither the writer nor the publication assumes responsibility for your financial choices. Sponsored content and affiliate links may appear on our site. Advertisements are marked clearly, and our editorial content remains entirely independent from our ad partners. Search keywords to find relevant companies. Search keywords to find relevant market exchanges."
    },
    {
      "title": "No Crypto Tax Cuts in India Budget 2026, New Penalties Introduced for Non-Compliance",
      "source": "Coinpedia",
      "summary": "Log in to access your notifications and stay updated. If you’re not a member yet, Sign Up to get started! Writer by choice, CryptoCurrency Writer, and Researcher by chance. Currently, focusing on financial news and analysis, as well as cryptocurrency news and data. One may not call me a crypto “Enthusiast” but trust me I'm getting there. India’s Union Budget 2026 has kept the existing crypto tax framework unchanged, even as the government moved to tighten compliance through stricter penalties. While oversight has increased, industry leaders say the Budget missed a key opportunity to support long-term growth in crypto and Web3. The Finance Bill introduces penalties to enforce reporting under Section 509 of the Income-tax Act, 2025. Union Finance Minister Nirmala Sitharaman said the aim is to deter non-compliance in crypto-asset reporting. Under the amendment, entities that fail to file crypto transaction statements will face a ₹200 per day penalty, while furnishing incorrect or misleading information — or failing to correct it — will attract a ₹50,000 fine.",
      "full_text": "Log in to access your notifications and stay updated. If you’re not a member yet, Sign Up to get started! Writer by choice, CryptoCurrency Writer, and Researcher by chance.  Currently, focusing on financial news and analysis, as well as cryptocurrency news and data. One may not call me a crypto “Enthusiast” but trust me I'm getting there. India’s Union Budget 2026 has kept the existing crypto tax framework unchanged, even as the government moved to tighten compliance through stricter penalties. While oversight has increased, industry leaders say the Budget missed a key opportunity to support long-term growth in crypto and Web3. The Finance Bill introduces penalties to enforce reporting under Section 509 of the Income-tax Act, 2025. Union Finance Minister Nirmala Sitharaman said the aim is to deter non-compliance in crypto-asset reporting. Under the amendment, entities that fail to file crypto transaction statements will face a ₹200 per day penalty, while furnishing incorrect or misleading information — or failing to correct it — will attract a ₹50,000 fine. These provisions will take effect from April 1, 2026. Reacting to the Budget, Sathvik Vishwanath, Co-founder and CEO of Unocoin, said expectations from Budget 2026 were much broader than enforcement alone. “The Union Budget 2026 was expected to play a decisive role in shaping India’s approach to crypto assets and Web3 technologies,” he said in an interview with Coinpedia. “A primary expectation was the rationalisation of the existing tax regime for virtual digital assets, which is currently restrictive and misaligned with broader financial market practices.” Sathvik added that allowing loss set-offs, reducing transaction-level friction, and aligning crypto taxation with other asset classes would have helped restore domestic liquidity and encourage compliant participation within India. Beyond taxes, Sathvik stressed that the lack of a clear regulatory framework continues to hurt Indian exchanges. “The absence of a comprehensive, crypto-specific framework has created uncertainty for exchanges, investors, and technology developers,” he said. “Clear definitions, licensing norms, compliance standards, and consumer protection mechanisms are essential for long-term planning and responsible innovation.” He warned that unclear rules have already reduced local trading volumes and pushed users to offshore platforms. “A well-defined framework would help retain market activity within India, strengthen domestic exchanges, and improve regulatory oversight,” Sathvik said. Sathvik also opened up about how India lags behind global crypto hubs. He pointed out that Dubai has introduced purpose-built digital asset regulations, while Singapore follows a structured licensing and consumer protection model. The United States, despite earlier fragmentation, is gradually moving toward clearer asset classification. “Compared to these jurisdictions, India’s current framework lacks the clarity and cohesiveness required to compete effectively for global capital, talent, and innovation,” he said. CoinPedia has been delivering accurate and timely cryptocurrency and blockchain updates since 2017. All content is created by our expert panel of analysts and journalists, following strict Editorial Guidelines based on E-E-A-T (Experience, Expertise, Authoritativeness, Trustworthiness). Every article is fact-checked against reputable sources to ensure accuracy, transparency, and reliability. Our review policy guarantees unbiased evaluations when recommending exchanges, platforms, or tools. We strive to provide timely updates about everything crypto & blockchain, right from startups to industry majors. All opinions and insights shared represent the author's own views on current market conditions. Please do your own research before making investment decisions. Neither the writer nor the publication assumes responsibility for your financial choices. Sponsored content and affiliate links may appear on our site. Advertisements are marked clearly, and our editorial content remains entirely independent from our ad partners. Search keywords to find relevant companies. Search keywords to find relevant market exchanges."
    },
    {
      "title": "Ripple secures full EU e-money license in Luxembourg",
      "source": "CoinDesk",
      "summary": "Ripple said Monday it had received full approval of an Electronic Money Institution (EMI) license from Luxembourg’s financial regulator, the Commission de Surveillance du Secteur Financier (CSSF), a step that would let the company scale regulated payments services across the European Union. Ripple announced “preliminary” approval last month and has since met all conditions required by the CSSF, which has now granted final authorization. \"Europe has always been a strategic priority for us, and this authorization allows us to scale our mission of providing robust, compliant blockchain infrastructure to clients across the EU,\" Cassie Craddock, Managing Director, UK & Europe at Ripple, said. \"We are now better positioned than ever to help European businesses transition into a more efficient, digital-first financial era,\" he added. The move builds on Ripple’s recent regulatory push in Europe. The company said it received an EMI license and cryptoasset registration from the U.K.’s Financial Conduct Authority (FCA) last month, adding to a growing set of permissions for operating payments and crypto-related services in key jurisdictions. Ripple framed the Luxembourg license as a lever to accelerate “Ripple Payments” across the EU — its cross-border payments product aimed at banks, fintechs and enterprise clients. Luxembourg is commonly used as a base for regulated financial services across the EU, though Ripple did not detail how quickly it expects to roll out services or which member states are first in line. Ripple also said its global license count has grown to more than 75, positioning it as one of the more heavily licensed companies in crypto as the industry shifts toward regulated, institution-facing use cases.",
      "full_text": "Ripple said Monday it had received full approval of an Electronic Money Institution (EMI) license from Luxembourg’s financial regulator, the Commission de Surveillance du Secteur Financier (CSSF), a step that would let the company scale regulated payments services across the European Union. Ripple announced “preliminary” approval last month and has since met all conditions required by the CSSF, which has now granted final authorization. \"Europe has always been a strategic priority for us, and this authorization allows us to scale our mission of providing robust, compliant blockchain infrastructure to clients across the EU,\" Cassie Craddock, Managing Director, UK & Europe at Ripple, said. \"We are now better positioned than ever to help European businesses transition into a more efficient, digital-first financial era,\" he added. The move builds on Ripple’s recent regulatory push in Europe. The company said it received an EMI license and cryptoasset registration from the U.K.’s Financial Conduct Authority (FCA) last month, adding to a growing set of permissions for operating payments and crypto-related services in key jurisdictions. Ripple framed the Luxembourg license as a lever to accelerate “Ripple Payments” across the EU — its cross-border payments product aimed at banks, fintechs and enterprise clients. Luxembourg is commonly used as a base for regulated financial services across the EU, though Ripple did not detail how quickly it expects to roll out services or which member states are first in line. Ripple also said its global license count has grown to more than 75, positioning it as one of the more heavily licensed companies in crypto as the industry shifts toward regulated, institution-facing use cases."
    },
    {
      "title": "Crypto stocks slide in pre-market trading as bitcoin stabilizes around $77,000",
      "source": "CoinDesk",
      "summary": "equities fell in pre-market trading as market participants continued to digest President Donald Trump's Friday choice of Kevin Warsh as his nominee for Federal Reserve chair, which spilled over into a sharp crypto selloff over the weekend. Strategy (MSTR), the largest publicly traded holder of bitcoin, fell more than 6%, while Galaxy Digital (GLXY) dropped over 7%. Bitcoin BTC $ 77,709.17 mining and AI-linked companies are also weaker, with IREN (IREN) and Cipher Mining (CIFR) both losing around 4%. Crypto exchange Coinbase (COIN) is also lower by roughly 4%. Volatility continues to rise, with the Volatility S&P 500 Index (VIX) up 10% on the day. The Volmex implied volatility index has surged over the past week, climbing from 40 to 50. Implied volatility reflects the market’s expectation of future price swings, with higher readings indicating that traders are pricing in greater uncertainty and larger moves ahead. Bitcoin is up around 1% on the day, trading near $77,000 after dipping as low as $74,500 on Saturday. Precious metals remain under pressure, with gold falling 4% to $4,700 per ounce and silver also sliding 4% to $82 per ounce. West Texas Intermediate futures fell 5% to $62 a barrel.",
      "full_text": "Crypto-related U.S. equities fell in pre-market trading as market participants continued to digest President Donald Trump's Friday choice of Kevin Warsh as his nominee for Federal Reserve chair, which spilled over into a sharp crypto selloff over the weekend. Strategy (MSTR), the largest publicly traded holder of bitcoin, fell more than 6%, while Galaxy Digital (GLXY) dropped over 7%. Bitcoin BTC $ 77,709.17 mining and AI-linked companies are also weaker, with IREN (IREN) and Cipher Mining (CIFR) both losing around 4%. Crypto exchange Coinbase (COIN) is also lower by roughly 4%. Volatility continues to rise, with the Volatility S&P 500 Index (VIX) up 10% on the day. The Volmex implied volatility index has surged over the past week, climbing from 40 to 50. Implied volatility reflects the market’s expectation of future price swings, with higher readings indicating that traders are pricing in greater uncertainty and larger moves ahead. Bitcoin is up around 1% on the day, trading near $77,000 after dipping as low as $74,500 on Saturday. Precious metals remain under pressure, with gold falling 4% to $4,700 per ounce and silver also sliding 4% to $82 per ounce. Oil is weaker as well.  West Texas Intermediate futures fell 5% to $62 a barrel. U.S. equity index futures, in contrast, recovered slightly, with Invesco QQQ ETF (QQQ), which tracks the Nasdaq 100 Index, down less than 1% in pre-market trading. The DXY index, which measures the strength of the dollar against a basket of major currencies, has pulled back slightly to 97. CoinDesk Research noted that bitcoin and the DXY showed a clear inverse relationship last week. Once again, bitcoin is ticking higher as the dollar eases."
    },
    {
      "title": "Justin Sun swoops to buy $100 million of bitcoin as rest of the market bleeds",
      "source": "CoinDesk",
      "summary": "Justin Sun plans to add between $50 million and $100 million worth of bitcoin BTC $ 77,709.17 to the blockchain's holdings, the Tron founder told CoinDesk. Bitcoin fell as low as $74,674 during the Asian morning on Monday, its lowest point since last April with BTC now having lost 21% of its value since Jan. 15. It would mark as astute purchase in comparison to the hoards of digital asset treasury (DAT) companies that raised money to purchase crypto at record highs last year, many of which are now facing losses of more than 30% on their holdings, according to bitcointreasuries . Binance also announced that it would purchase $1 billion worth of bitcoin at the tail end of last week with the funds being allocated to the exchange's user protection fund. TRX $ 0.2836 is currently trading at $0.284 having outperformed bitcoin in recent months, it remains above its December low of $0.27 and in a macro sense remains in an uptrend since late 2022.",
      "full_text": "Justin Sun plans to add between $50 million and $100 million worth of bitcoin BTC $ 77,709.17 to the blockchain's holdings, the Tron founder told CoinDesk. Bitcoin fell as low as $74,674 during the Asian morning on Monday, its lowest point since last April with BTC now having lost 21% of its value since Jan. 15. It would mark as astute purchase in comparison to the hoards of digital asset treasury (DAT) companies that raised money to purchase crypto at record highs last year, many of which are now facing losses of more than 30% on their holdings, according to bitcointreasuries . Binance also announced that it would purchase $1 billion worth of bitcoin at the tail end of last week with the funds being allocated to the exchange's user protection fund. TRX $ 0.2836 is currently trading at $0.284 having outperformed bitcoin in recent months, it remains above its December low of $0.27 and in a macro sense remains in an uptrend since late 2022."
    },
    {
      "title": "Binance moves 1,315 bitcoin into user protection fund as it prepares to buy $1 billion BTC",
      "source": "CoinDesk",
      "summary": "Binance transferred roughly $100 million worth of bitcoin BTC $ 77,709.17 from a hot wallets into its Secure Asset Fund for Users (SAFU), marking an early on-chain step in the largest crypto exchange's plan to reframe its user protection reserve around the largest cryptocurrency. Blockchain data identified by Arkham shows about 1,315 BTC moved in a single transaction from a Binance-labeled wallet to a known SAFU fund address early Monday. The transfer was direct and showed no signs of interaction with external wallets, suggesting an internal treasury reclassification rather than a market-facing trade. Binance later confirmed on X that the movements were part of its proposal SAFU fund, following CoinDesk's coverage. \"Binance has completed the first batch of Bitcoin conversion for the SAFU Fund, amounting to 100M USD stablecoins,\" the exchange said. \"We’re continuing to acquire Bitcoin for the SAFU fund, aiming to complete conversion of the fund within 30 days of our original announcement.\" #Binance SAFU Fund Asset Conversion progress update. Binance has completed the first batch of Bitcoin conversion for the SAFU Fund, amounting to 100M USD stablecoins. Our SAFU BTC address: 1BAuq7Vho2CEkVkUxbfU26LhwQjbCmWQkD TXID: https://t.co/OdrvSINsRs We’re continuing to… pic.twitter.com/Ue47ayJfbS SAFU is a security fund created to protect users from losses due to unforeseen events such as hacks. Last week, Binance said it would convert $1 billion worth of dollar-pegged tokens into bitcoin for the fund over the next 30 days, and pledged to replenish the amount if the value fell below $800 million due to price swings.",
      "full_text": "Binance transferred roughly $100 million worth of bitcoin BTC $ 77,709.17 from a hot wallets into its Secure Asset Fund for Users (SAFU), marking an early on-chain step in the largest crypto exchange's plan to reframe its user protection reserve around the largest cryptocurrency. Blockchain data identified by Arkham shows about 1,315 BTC moved in a single transaction from a Binance-labeled wallet to a known SAFU fund address early Monday. The transfer was direct and showed no signs of interaction with external wallets, suggesting an internal treasury reclassification rather than a market-facing trade. Binance later confirmed on X that the movements were part of its proposal SAFU fund, following CoinDesk's coverage. \"Binance has completed the first batch of Bitcoin conversion for the SAFU Fund, amounting to 100M USD stablecoins,\" the exchange said. \"We’re continuing to acquire Bitcoin for the SAFU fund, aiming to complete conversion of the fund within 30 days of our original announcement.\" #Binance SAFU Fund Asset Conversion progress update. Binance has completed the first batch of Bitcoin conversion for the SAFU Fund, amounting to 100M USD stablecoins. Our SAFU BTC address: 1BAuq7Vho2CEkVkUxbfU26LhwQjbCmWQkD TXID: https://t.co/OdrvSINsRs We’re continuing to… pic.twitter.com/Ue47ayJfbS SAFU is a security fund created to protect users from losses due to unforeseen events such as hacks. Last week, Binance said it would convert $1 billion worth of dollar-pegged tokens into bitcoin for the fund over the next 30 days, and pledged to replenish the amount if the value fell below $800 million due to price swings. That announcement sparked speculation the exchange would become a large spot buyer of bitcoin. Monday’s on-chain activity suggests otherwise, at least for now. The transaction does not represent a conversion of stablecoins into bitcoin. Instead, Binance appears to be allocating bitcoin it already held into the fund, effectively ring-fencing part of its existing reserves as designated user protection capital. The shift does, however, introduce a different risk profile. A bitcoin-backed SAFU fund will fluctuate in value alongside the broader market, increasing the importance of Binance’s promise to top it back up during periods of volatility. UPDATE (Feb. 2, 10:04 UTC): Adds Arkham in second paragraph, reason for SAFU fund in third. UPDATE (Feb. 2, 10:28 UTC): Adds Binance's confirmation tweet about the movements belonging to the SAFU fund."
    },
    {
      "title": "Bitcoin ETF holders, sitting on paper losses, may throw in the towel",
      "source": "CoinDesk",
      "summary": "Bitcoin's BTC $ 77,709.17 price crash has left investors in the token's spot exchange-traded funds (ETF) holding losses of 15% on average, setting the stage for potential panic selling if the crypto market doesn't stabilize. debut two years ago, the investors have paid an average of roughly $90,200 per BTC, according to estimates by Bianco Research and 10x Research. With the largest cryptocurrency now trading around $76,800, that leaves them with a paper loss of about $13,400 per BTC. Being underwater could trigger ETF redemptions, particularly by short-term traders and speculators who bought in hopes of continued gains and quick profits. These potential redemptions could add to bearish pressures in the market. Demand for ETFs has cratered since the Oct. 8 crash, which social media is widely blaming on Binance , the leading cryptocurrency exchange by volume and open interest. January already marked a third straight month of net outflows, the first three-month run since their inception. The 11 spot bitcoin ETFs have registered a net outflow of $6.18 billion in the period, according to data source SoSoValue. A deepening of the bear market could potentially spur a full-scale capitulation: Long-term holders give up, liquidate, and volumes explode.",
      "full_text": "Bitcoin's BTC $ 77,709.17 price crash has left investors in the token's spot exchange-traded funds (ETF) holding losses of 15% on average, setting the stage for potential panic selling if the crypto market doesn't stabilize. Since their U.S. debut two years ago, the investors have paid an average of roughly $90,200 per BTC, according to estimates by Bianco Research and 10x Research. With the largest cryptocurrency now trading around $76,800, that leaves them with a paper loss of about $13,400 per BTC. Being underwater could trigger ETF redemptions, particularly by short-term traders and speculators who bought in hopes of continued gains and quick profits. These potential redemptions could add to bearish pressures in the market. Demand for ETFs has cratered since the Oct. 8 crash, which social media is widely blaming on Binance , the leading cryptocurrency exchange by volume and open interest. January already marked a third straight month of net outflows, the first three-month run since their inception. The 11 spot bitcoin ETFs have registered a net outflow of $6.18 billion in the period, according to data source SoSoValue. A deepening of the bear market could potentially spur a full-scale capitulation: Long-term holders give up, liquidate, and volumes explode. This dynamic often marks peak bear phases. That said, analysts have previously told CoinDesk that institutional capital flowing into ETFs is meant for the long haul, and is \"sticky\", meaning a full-blown capitulation is unlikely."
    },
    {
      "title": "Bitcoin's crash exposes painful truth – crypto market still dances to BTC's tune",
      "source": "CoinDesk",
      "summary": "A decade ago, the crypto market was straightforward: When bitcoin BTC $ 77,709.17 surged, some 500 or more alternative cryptocurrencies followed suit; when it plunged, the entire market crashed. Portfolios spread across \"diverse tokens\" with unique use cases looked diversified on paper, but cratered during the bitcoin slides. Fast forward to 2026, and very little has changed, even though the number of altcoins has increased to several thousand. Despite institutions supposedly painting crypto as a multifaceted asset class akin to stocks, with each project boasting distinct investment appeal, the reality is grim. The market's still a one-trick pony, following BTC up and down, offering no real diversification. The year-to-date price action underlines that fact. Bitcoin's price has tanked 14% to $75,000, the lowest since April last year, with almost all major and minor tokens bleeding by a similar amount, if not more. CoinDesk has 16 indices tracking the performance of various coins with unique use cases and appeal, and nearly all are down 15% to 19% this year. Indexes tied to DeFi, smart contract and computing coins are down 20%-25%. Here's where it gets more alarming: Tokens tied to blockchain protocols generating real revenue have dropped alongside BTC.",
      "full_text": "A decade ago, the crypto market was straightforward: When bitcoin BTC $ 77,709.17 surged, some 500 or more alternative cryptocurrencies followed suit; when it plunged, the entire market crashed. Portfolios spread across \"diverse tokens\" with unique use cases looked diversified on paper, but cratered during the bitcoin slides. Fast forward to 2026, and very little has changed, even though the number of altcoins has increased to several thousand. Despite institutions supposedly painting crypto as a multifaceted asset class akin to stocks, with each project boasting distinct investment appeal, the reality is grim. The market's still a one-trick pony, following BTC up and down, offering no real diversification. The year-to-date price action underlines that fact. Bitcoin's price has tanked 14% to $75,000, the lowest since April last year, with almost all major and minor tokens bleeding by a similar amount, if not more. CoinDesk has 16 indices tracking the performance of various coins with unique use cases and appeal, and nearly all are down 15% to 19% this year. Indexes tied to DeFi, smart contract and computing coins are down 20%-25%. Here's where it gets more alarming: Tokens tied to blockchain protocols generating real revenue have dropped alongside BTC. According to DefiLlama, decentralized exchanges and lending and borrowing protocols like Hyperliquid, Pump, Aave, Jupiter, Aerodrome, Ligther, Base, and layer 1 blockchains like Tron are among the leading revenue generators over the past 30 days. This starkly contrasts with bitcoin, which has lately failed to hold up to its dual use case as digital gold and a payments infrastructure. The native tokens of most of these protocols are in the red. For instance, leading Ethereum-based lending and borrowing protocol Aave's AAVE token has dropped 26%. Hyperliquid's HYPE stands alone, up 20% even after pulling back from $34.80 to $30, fueled by booming tokenized gold and silver trading. The disappointing trend is the result of a popular narrative that labels large-cap tokens like bitcoin, ether and solana as safe havens (safe pockets during downturns) while calling revenue-generating projects volatile, according to some observers. \"The jokers that run this industry will keep telling you that BTC, ETH and SOL are the \"safe haven majors\" -- meanwhile the only things that make any money in downturns are $HYPE, $PUMP, $AAVE, $AERO and some other DeFi protocols,\" Jeff Dorman, chief investment officer at Arca, said on X . He added that the crypto industry needs to borrow a page from traditional markets by building consensus around truly resilient sectors, such as DeFi platforms, and hammering their haven appeal home via exchanges, analysts, and funds. Just as Wall Street brokers and research firms etched \"consumer staples\" or \"investment-grade bonds\" as downturn darlings, turning data into price outperformance during bear markets, crypto must anoint and promote its safe havens to make them real. \"Why do you think certain corporate bonds and stocks do better than others in downturns? Because the industry decided certain sectors were \"defensive\" -- consumer staples, utilities, healthcare, etc,\" Dorman explained. According to Markus Thielen, founder of 10x Research , part of the problem is stablecoins, digital tokens whose values are pegged to an external reference, such as the U.S. dollar. These are often seen as cash equivalents. And so, when the largest cryptocurrency slides, traders de-risk their portfolios by moving into stablecoins. \"Unlike equity markets—where capital is typically required to remain invested—the rise of stablecoins has fundamentally changed positioning in crypto. Stablecoins allow investors to shift quickly from bullish to neutral exposure, effectively serving as the defensive allocation within the crypto market,\" Thielen told CoinDesk. He added that bitcoin has always been the most dominant cryptocurrency, consistently accounting for over 50% of the total digital asset market value. This makes it harder to diversify. \"[Still] among major tokens, BNB and TRX have historically behaved more defensively, with TRX showing the strongest defensive characteristics,\" he noted. TRX is down just 1% this year, outpacing BTC's sharper drop. Institutional participation in the bitcoin market boomed after the debut of spot ETFs in the U.S. two years ago. This is evident from BTC's share of the total crypto market, which has held above 50% since then. This trend is unlikely to change, which means the prospects of wider crypto market decoupling from bitcoin look bleak. \"It will continue to concentrate into BTC, as the ongoing downturn helps kill off zombie projects and unprofitable businesses,\" Jimmy Yang, co-founder of institutional liquidity provider Orbit Markets ."
    },
    {
      "title": "Jupiter brings Polymarket to Solana and lands $35 million investment deal",
      "source": "CoinDesk",
      "summary": "Solana-based decentralized excange Jupiter said it will bring Polymarket to the network for the first time, rolling out an integration that it pitched as a push to make Jupiter a fuller on-chain predictions hub. “For the first time, Polymarket is coming to Solana. On Jupiter,” the exchange posted on X, adding users will be able to trade prediction markets “on one onchain platform.” Jupiter called Polymarket “the biggest predictions market in crypto” and said the deal is “primed for making Jupiter the most innovative predictions platform on Solana.” The announcement came alongside a separate funding update: Jupiter said it has secured a $35 million strategic investment in JUP from ParaFi Capital to accelerate work on “onchain financial infrastructure.” The deal will be settled entirely in JupUSD, Jupiter’s dollar-pegged token, and was closed at spot price, the project said. ParaFi has also committed to an extended token lockup as part of the arrangement. Jupiter's pseudonymous co-founder meow said “Jupiter predict” will be a major focus over the next year, with planned work spanning prediction market APIs and revamped market discovery tools. jupiter predict is going to be a major focus for us in the next year, and we aim to innovate on a number of things: - robust prediction market apis - new ux on market discovery - useful data on individual markets - novel mechanisms to trade and communicate we have put… https://t.co/5cgJtOxg9e Prediction markets have seen renewed attention over the past year as they’ve become a popular venue for trading event outcomes, particularly around elections, macro data releases and high-profile news cycles. Polymarket has been one of the category’s main beneficiaries, drawing liquidity and mindshare even as parts of the sector face regulatory scrutiny in key jurisdictions. Jupiter’s onchain footprint is already sizable, with the total value of assets locked on the platform at about $2.35 billion as of Monday. Annualized fees stand near $650 million and annualized protocol revenue around $150 million, per DefiLlama. Neither Jupiter nor Polymarket shared a timeline for rollout or details on how the integration will work across custody, market access and compliance considerations.",
      "full_text": "Solana-based decentralized excange Jupiter said it will bring Polymarket to the network for the first time, rolling out an integration that it pitched as a push to make Jupiter a fuller on-chain predictions hub. “For the first time, Polymarket is coming to Solana. On Jupiter,” the exchange posted on X, adding users will be able to trade prediction markets “on one onchain platform.” Jupiter called Polymarket “the biggest predictions market in crypto” and said the deal is “primed for making Jupiter the most innovative predictions platform on Solana.” The announcement came alongside a separate funding update: Jupiter said it has secured a $35 million strategic investment in JUP from ParaFi Capital to accelerate work on “onchain financial infrastructure.” The deal will be settled entirely in JupUSD, Jupiter’s dollar-pegged token, and was closed at spot price, the project said. ParaFi has also committed to an extended token lockup as part of the arrangement. Jupiter's pseudonymous co-founder meow said “Jupiter predict” will be a major focus over the next year, with planned work spanning prediction market APIs and revamped market discovery tools. jupiter predict is going to be a major focus for us in the next year, and we aim to innovate on a number of things: - robust prediction market apis - new ux on market discovery - useful data on individual markets - novel mechanisms to trade and communicate we have put… https://t.co/5cgJtOxg9e Prediction markets have seen renewed attention over the past year as they’ve become a popular venue for trading event outcomes, particularly around elections, macro data releases and high-profile news cycles. Polymarket has been one of the category’s main beneficiaries, drawing liquidity and mindshare even as parts of the sector face regulatory scrutiny in key jurisdictions. Jupiter’s onchain footprint is already sizable, with the total value of assets locked on the platform at about $2.35 billion as of Monday. Annualized fees stand near $650 million and annualized protocol revenue around $150 million, per DefiLlama. Neither Jupiter nor Polymarket shared a timeline for rollout or details on how the integration will work across custody, market access and compliance considerations. Still, Jupiter’s messaging suggests it wants prediction markets to sit alongside swaps and other on-chain products as a core pillar of the platform’s growth strategy."
    },
    {
      "title": "India's 2026 budget keeps 30% crypto tax, adds $545 penalty for missed reports",
      "source": "CoinDesk",
      "summary": "India’s Union Budget for 2026-27 has left the country’s crypto tax regime unchanged, retaining the existing transaction tax and withholding rules, while proposing a new penalty framework aimed at tightening compliance around crypto-asset reporting. Under amendments proposed in the Finance Bill, 2026, entities required to report crypto-asset transactions to tax authorities would face monetary penalties for lapses, including daily fines for non-filing and a fixed charge for inaccurate disclosures. The provisions are set to take effect from April 1, 2026. The proposal applies to reporting entities covered under Section 509 of the Income-tax Act, which mandates the furnishing of statements related to crypto-asset transactions. Failure to submit the required statement would attract a penalty of ₹200 per day — roughly $2.20 — for as long as the default continues. A separate flat penalty of ₹50,000, or about $545, would apply in cases where incorrect information is filed or errors are not rectified after being flagged. The changes are detailed in the Memorandum Explaining the Provisions in the Finance Bill and would be implemented through amendments to Section 446 of the Act. The memorandum says the move is intended to strengthen compliance and discourage inaccurate or incomplete reporting. While the government has sharpened enforcement on reporting, it stopped short of altering the broader crypto tax framework. India continues to levy a flat 30% tax on gains from crypto transactions, along with a 1% tax deducted at source (TDS) on trades — measures that industry participants have long argued dampen liquidity and push trading activity offshore.",
      "full_text": "India’s Union Budget for 2026-27 has left the country’s crypto tax regime unchanged, retaining the existing transaction tax and withholding rules, while proposing a new penalty framework aimed at tightening compliance around crypto-asset reporting. Under amendments proposed in the Finance Bill, 2026, entities required to report crypto-asset transactions to tax authorities would face monetary penalties for lapses, including daily fines for non-filing and a fixed charge for inaccurate disclosures. The provisions are set to take effect from April 1, 2026. The proposal applies to reporting entities covered under Section 509 of the Income-tax Act, which mandates the furnishing of statements related to crypto-asset transactions. Failure to submit the required statement would attract a penalty of ₹200 per day — roughly $2.20 — for as long as the default continues. A separate flat penalty of ₹50,000, or about $545, would apply in cases where incorrect information is filed or errors are not rectified after being flagged. The changes are detailed in the Memorandum Explaining the Provisions in the Finance Bill and would be implemented through amendments to Section 446 of the Act. The memorandum says the move is intended to strengthen compliance and discourage inaccurate or incomplete reporting. While the government has sharpened enforcement on reporting, it stopped short of altering the broader crypto tax framework. India continues to levy a flat 30% tax on gains from crypto transactions, along with a 1% tax deducted at source (TDS) on trades — measures that industry participants have long argued dampen liquidity and push trading activity offshore. The decision to keep taxes and TDS unchanged disappointed parts of the domestic crypto industry, which had hoped for relief or recalibration after months of lobbying. Market participants say the lack of reform leaves existing frictions in place even as compliance obligations expand. \"The current tax framework presents challenges for retail participants by taxing transactions without recognising losses, creating friction rather than fairness,\"Ashish Singhal, co-founder of local exchange CoinSwitch, said in an email. \"A reduction in TDS on VDA transactions from 1% to 0.01% could improve liquidity, ease compliance, and enhance transparency while preserving transaction traceability.\" \"Raising the TDS threshold to ₹5 lakh would help protect small investors from disproportionate impact,\" he added."
    },
    {
      "title": "Bitcoin liquidations spike as Warsh Fed pick rattles markets",
      "source": "Crypto.News",
      "summary": "Bitcoin slid below $80k after Warsh’s Fed nod, triggering $2.5B liquidations before stabilizing near a key mid-cycle support zone analysts see as potential cycle floor. Bitcoin fell below $80,000 over the weekend following confirmation that Kevin Warsh will become the next chair of the Federal Reserve, triggering widespread deleveraging across cryptocurrency markets, according to analysts at QCP Asia. In a Monday market note, QCP Asia reported that bitcoin briefly declined to a mid-cycle support area after breaking key technical support levels, while ether dropped to lower thresholds. The sell-off resulted in approximately $2.5 billion in liquidations of leveraged long positions, intensifying downward pressure amid persistent outflows from U.S. spot Bitcoin exchange-traded funds. Risk aversion following the Warsh announcement extended beyond cryptocurrency markets. Equities weakened and traditional safe-haven assets such as gold and silver pulled back from recent highs, as traders reassessed the probable policy direction under a Warsh-led Federal Reserve. Markets have begun pricing in a higher probability of earlier policy normalization or tighter monetary conditions, which has pressured non-yielding assets, according to QCP Asia. Higher margin requirements in futures markets also accelerated the unwinding of leveraged positions, the firm stated. Bitcoin has since stabilized above a level that corresponds with cycle lows observed earlier in the year. Options markets continue to reflect caution, with positioning skewed toward put protection, though demand for downside hedges has moderated compared with previous periods of market stress, QCP Asia noted.",
      "full_text": "Bitcoin slid below $80k after Warsh’s Fed nod, triggering $2.5B liquidations before stabilizing near a key mid-cycle support zone analysts see as potential cycle floor. Bitcoin fell below $80,000 over the weekend following confirmation that Kevin Warsh will become the next chair of the Federal Reserve, triggering widespread deleveraging across cryptocurrency markets, according to analysts at QCP Asia. In a Monday market note, QCP Asia reported that bitcoin briefly declined to a mid-cycle support area after breaking key technical support levels, while ether dropped to lower thresholds. The sell-off resulted in approximately $2.5 billion in liquidations of leveraged long positions, intensifying downward pressure amid persistent outflows from U.S. spot Bitcoin exchange-traded funds. Risk aversion following the Warsh announcement extended beyond cryptocurrency markets. Equities weakened and traditional safe-haven assets such as gold and silver pulled back from recent highs, as traders reassessed the probable policy direction under a Warsh-led Federal Reserve. Markets have begun pricing in a higher probability of earlier policy normalization or tighter monetary conditions, which has pressured non-yielding assets, according to QCP Asia. Higher margin requirements in futures markets also accelerated the unwinding of leveraged positions, the firm stated. Bitcoin has since stabilized above a level that corresponds with cycle lows observed earlier in the year. Options markets continue to reflect caution, with positioning skewed toward put protection, though demand for downside hedges has moderated compared with previous periods of market stress, QCP Asia noted. The firm observed that during the November decline from peak levels, hedging activity was more aggressive than current levels near the mid-cycle area, suggesting some exposure has already been eliminated. Analysts at QCP Asia warned that price action remains vulnerable. Momentum indicators continue to point lower and upside appears limited near recent resistance levels, leaving the market exposed to further liquidation-driven moves if support fails. A sustained break below current support could lead to a deeper retracement toward earlier levels, while a decisive recovery above prior resistance may help reduce volatility and stabilize sentiment, the firm stated. “In the current environment, attention is likely to focus on whether institutional accumulation re-emerges, particularly given Strategy’s average cost basis, alongside any de-escalation in geopolitical risks, notably around Iran,” QCP Asia stated. “Fed communication will also be closely watched, with any remarks from Chair-designate Warsh that temper expectations of tightening potentially serving as an additional stabilizing influence.” Analyst PlanC stated that bitcoin’s weekend drop to mid-cycle levels may represent a cycle floor, characterizing the move as a capitulation-style low rather than the beginning of a prolonged downturn. Bitcoin briefly reached that area before stabilizing and rebounding, though it remains significantly lower on the month and below its October peak. PlanC compared the recent sell-off to past drawdowns that preceded major recoveries, including the 2018 bear market low, the March 2020 decline and the sharp drops following the FTX and Terra-Luna collapses. The analyst estimated the current cycle bottom likely falls within the mid-range of recent lows, stating the move could represent a final shakeout within an ongoing bull cycle. Best crypto platforms Wyoming’s stablecoin isn’t hype — it’s how payments get de-risked | Opinion Bitcoin retreats below $77,000, Tether posts $10B annual profit, DOJ seizes $400M in Helix assets | Weekly recap The hidden problem with crypto ETFs | Opinion KuCoin CEO on MiCA: Compliance becomes the cost of doing business in Europe The machine economy: AI will benefit crypto, or break it | Opinion What crypto treasuries must do to survive as the hype dies | Opinion Trump’s tariffs: Boosting or hurting XRP price? Capital without borders: Decentralized crowdfunding thrives in global turmoil | Opinion Meet Jingliang Su, Chinese man gets 46 months sentence for $36.9M crypto scam Intelligence on the chain: AI must become a tokenized asset | Opinion Get crypto market analysis and curated news delivered right to your inbox every week. You have successfully joined our subscriber list. Sign up for our free newsletters"
    },
    {
      "title": "Singapore Gulf Bank announces regulated fiat-stablecoin interoperability service",
      "source": "Crypto.News",
      "summary": "Singapore Gulf Bank has announced a new service that lets institutions mint, trade and convert stablecoins to fiat within a single regulated platform. According to a press release shared with crypto.news, the new service will allow SGB clients to mint, convert, hold, and trade stablecoins like USDC ( USDC ) and USDT usdt 0% Tether across major blockchain networks like Solana, Ethereum, and Arbitrum on SGB Net. “Our ambition is to become the one bank for all of finance,” SGB’s Chief Executive Officer Shawn Chan said in an accompanying statement, adding that stablecoin management solutions remain “unnecessarily complex.” SGB Net is a proprietary real-time, multi-currency clearing network that the bank launched earlier this year, specifically for digital asset firms. According to the bank, it currently processes over $2 billion in monthly fiat transaction volume. The platform will come with built-in safeguards, including full compliance with Know Your Customer, Know Your Business, and anti-money laundering rules. The bank has partnered with crypto infrastructure provider Fireblocks to handle custody of funds. Singapore Gulf Bank and Fireblocks partnered in November. At the time, the bank said the partnership would help it automate treasury operations and mitigate operational risks. SGB is currently working with its ecosystem partners and regulators to implement appropriate guardrails and expects to begin providing access to the service by Q1 2026. Based on ongoing market trends, it is evident that there has been an increase in demand for regulated access to stablecoins, specifically dollar-backed stablecoins, which remain the dominant vehicle for digital liquidity and global settlements.",
      "full_text": "Singapore Gulf Bank has announced a new service that lets institutions mint, trade and convert stablecoins to fiat within a single regulated platform. According to a press release shared with crypto.news, the new service will allow SGB clients to mint, convert, hold, and trade stablecoins like USDC ( USDC ) and USDT usdt 0% Tether across major blockchain networks like Solana, Ethereum, and Arbitrum on SGB Net. “Our ambition is to become the one bank for all of finance,” SGB’s Chief Executive Officer Shawn Chan said in an accompanying statement, adding that stablecoin management solutions remain “unnecessarily complex.” SGB Net is a proprietary real-time, multi-currency clearing network that the bank launched earlier this year, specifically for digital asset firms. According to the bank, it currently processes over $2 billion in monthly fiat transaction volume. The platform will come with built-in safeguards, including full compliance with Know Your Customer, Know Your Business, and anti-money laundering rules. The bank has partnered with crypto infrastructure provider Fireblocks to handle custody of funds. Singapore Gulf Bank and Fireblocks partnered in November. At the time, the bank said the partnership would help it automate treasury operations and mitigate operational risks. SGB is currently working with its ecosystem partners and regulators to implement appropriate guardrails and expects to begin providing access to the service by Q1 2026. Based on ongoing market trends, it is evident that there has been an increase in demand for regulated access to stablecoins, specifically dollar-backed stablecoins, which remain the dominant vehicle for digital liquidity and global settlements. Last month, USDT issuer Tether launched USA₮ , a federally regulated U.S. stablecoin that is compliant with the newly enacted GENIUS Act. Elsewhere, in the UAE, Universal Digital Intl Limited has launched the country’s first central bank–approved stablecoin dubbed USDU, which is fully backed by U.S. dollars. Best crypto platforms Wyoming’s stablecoin isn’t hype — it’s how payments get de-risked | Opinion Bitcoin retreats below $77,000, Tether posts $10B annual profit, DOJ seizes $400M in Helix assets | Weekly recap The hidden problem with crypto ETFs | Opinion KuCoin CEO on MiCA: Compliance becomes the cost of doing business in Europe The machine economy: AI will benefit crypto, or break it | Opinion What crypto treasuries must do to survive as the hype dies | Opinion Trump’s tariffs: Boosting or hurting XRP price? Capital without borders: Decentralized crowdfunding thrives in global turmoil | Opinion Meet Jingliang Su, Chinese man gets 46 months sentence for $36.9M crypto scam Intelligence on the chain: AI must become a tokenized asset | Opinion Wyoming’s stablecoin isn’t hype — it’s how payments get de-risked | Opinion Sony Ventures injects $13m into Startale Group to support Soneium Can Bitcoin price reclaim $90K ahead of Fed rate decision today? Get crypto market analysis and curated news delivered right to your inbox every week. You have successfully joined our subscriber list. Sign up for our free newsletters"
    },
    {
      "title": "CrossCurve exploited for $3 million in multi-network bridge attack",
      "source": "Crypto.News",
      "summary": "Cross-chain liquidity protocol CrossCurve has been targeted in a smart contract exploit, with attackers draining roughly $3 million across multiple networks. CrossCurve confirmed the exploit via a Feb. 2 X post and has requested all users to “pause all interactions” with the protocol until the vulnerability has been patched. In a follow-up post , the protocol said it had identified 10 addresses that had received tokens from the exploit and urged the attackers to return the funds in exchange for a reward. “We do not believe this was intentional on your part, and there is no indication of malicious intent. We hope for your cooperation in returning the funds,” CrossCurve wrote. The protocol has offered 10% of the stolen funds as a bounty, similar to what it offers under its SafeHarbor WhiteHat policy. If the funds are not returned within 72 hours, the protocol has vowed to pursue legal options, including civil litigation to recover damages and coordinate with law enforcement and other projects to freeze the assets . At the time of publication, CrossCurve has not released an official post-mortem report regarding the extent of losses and how many users may have been affected. According to blockchain security account Defimon Alerts, total losses may be close to $3 million. “Anyone could call expressExecute on ReceiverAxelar contract with a spoofed cross-chain message, bypassing gateway validation and triggering unlock on PortalV2,” Defimon said.",
      "full_text": "Cross-chain liquidity protocol CrossCurve has been targeted in a smart contract exploit, with attackers draining roughly $3 million across multiple networks. CrossCurve confirmed the exploit via a Feb. 2 X post and has requested all users to “pause all interactions” with the protocol until the vulnerability has been patched. In a follow-up post , the protocol said it had identified 10 addresses that had received tokens from the exploit and urged the attackers to return the funds in exchange for a reward. “We do not believe this was intentional on your part, and there is no indication of malicious intent. We hope for your cooperation in returning the funds,” CrossCurve wrote. The protocol has offered 10% of the stolen funds as a bounty, similar to what it offers under its SafeHarbor WhiteHat policy. If the funds are not returned within 72 hours, the protocol has vowed to pursue legal options, including civil litigation to recover damages and coordinate with law enforcement and other projects to freeze the assets . At the time of publication, CrossCurve has not released an official post-mortem report regarding the extent of losses and how many users may have been affected. According to blockchain security account Defimon Alerts, total losses may be close to $3 million. “Anyone could call expressExecute on ReceiverAxelar contract with a spoofed cross-chain message, bypassing gateway validation and triggering unlock on PortalV2,” Defimon said. Arkham Intelligence data cited by Defimon showed the balance of the PortalV2 contract dropping to near zero around January 31. CrossCurve, formerly known as EYWA Protocol, operates a cross-chain DEX and consensus bridge built in collaboration with Curve Finance. It uses a consensus mechanism that routes transactions through multiple independent validation protocols to reduce single points of failure. “Users who have allocated votes to Eywa-related pools may wish to review their positions and consider removing those votes. We continue to encourage all participants to remain vigilant and make risk-aware decisions when interacting with third-party projects,” the official Curve Finance X account posted after the incident was confirmed. The CrossCurve incident is the second major exploit in recent weeks, as it closely follows the SagaEVM chain smart contract breach, which resulted in the loss of approximately $7 million in bridged assets. As previously reported by crypto.news , Saga had to pause the SagaEVM chain and work with bridge operators to blacklist the address and limit further movement of funds. Best crypto platforms Wyoming’s stablecoin isn’t hype — it’s how payments get de-risked | Opinion Bitcoin retreats below $77,000, Tether posts $10B annual profit, DOJ seizes $400M in Helix assets | Weekly recap The hidden problem with crypto ETFs | Opinion KuCoin CEO on MiCA: Compliance becomes the cost of doing business in Europe The machine economy: AI will benefit crypto, or break it | Opinion What crypto treasuries must do to survive as the hype dies | Opinion Trump’s tariffs: Boosting or hurting XRP price? Capital without borders: Decentralized crowdfunding thrives in global turmoil | Opinion Meet Jingliang Su, Chinese man gets 46 months sentence for $36.9M crypto scam Intelligence on the chain: AI must become a tokenized asset | Opinion Saga EVM chain paused following $7M smart contract exploit MakinaFi bulls face security reckoning as 1,299 ETH vanishes in exploit XRP bulls face make-or-break test as BNB grabs fourth place Get crypto market analysis and curated news delivered right to your inbox every week. You have successfully joined our subscriber list. Sign up for our free newsletters"
    },
    {
      "title": "Jupiter brings Polymarket to Solana in push to expand on-chain prediction markets",
      "source": "Crypto.News",
      "summary": "Jupiter has integrated Polymarket into its platform, bringing crypto’s largest prediction market to Solana for the first time and giving users direct access to event-based trading without leaving the Jupiter app. The decentralized exchange announced the partnership on Feb. 1, saying Polymarket is now available through a dedicated “Prediction” tab inside Jupiter. Users can trade prediction markets directly on-chain, without bridging stablecoins or switching platforms. In a post on X, Jupiter jup 5.5% Jupiter said the integration is aimed at turning the app into “the most innovative predictions platform on Solana,” combining Polymarket’s markets with what it described as a streamlined user experience. The new feature allows Jupiter users to access Polymarket’s contracts natively on Solana sol -0.97% Solana , reducing the technical steps that previously limited participation. Using prediction markets has usually meant switching between several tools and platforms. With Polymarket now integrated into its app, Jupiter streamlines that experience, allowing users to access event-based markets and decentralized trading in one place. Jupiter previously introduced a Kalshi-powered beta product in late 2025 focusing on sports and other major events. Through the new partnership, Polymarket gains deeper exposure to the Solana ecosystem and taps into Jupiter’s growing community of users. Previous expansions had been achieved via integrations with MetaMask and World App.",
      "full_text": "Jupiter has integrated Polymarket into its platform, bringing crypto’s largest prediction market to Solana for the first time and giving users direct access to event-based trading without leaving the Jupiter app. The decentralized exchange announced the partnership on Feb. 1, saying Polymarket is now available through a dedicated “Prediction” tab inside Jupiter. Users can trade prediction markets directly on-chain, without bridging stablecoins or switching platforms. In a post on X, Jupiter jup 5.5% Jupiter said the integration is aimed at turning the app into “the most innovative predictions platform on Solana,” combining Polymarket’s markets with what it described as a streamlined user experience. The new feature allows Jupiter users to access Polymarket’s contracts natively on Solana sol -0.97% Solana , reducing the technical steps that previously limited participation. Using prediction markets has usually meant switching between several tools and platforms. With Polymarket now integrated into its app, Jupiter streamlines that experience, allowing users to access event-based markets and decentralized trading in one place. Jupiter previously introduced a Kalshi-powered beta product in late 2025 focusing on sports and other major events. Through the new partnership, Polymarket gains deeper exposure to the Solana ecosystem and taps into Jupiter’s growing community of users. Previous expansions had been achieved via integrations with MetaMask and World App. The collaboration with Jupiter introduces an additional distribution channel. Analysts suggest that keeping users within Jupiter’s ecosystem could generate significant new fee revenue. The prediction market sector has been expanding rapidly heading into 2026, fueled by political betting, sports events, and real-time speculation on economic and social trends. Industry reports show that roughly $12 billion in trading volume was recorded in January alone, producing over $11 million in on-chain fees. With an estimated valuation of between $9 billion and $10 billion, Polymarket has become the industry leader. Its dominance has been further cemented through data partnerships with major media outlets like Yahoo Finance, Dow Jones, and The Wall Street Journal. The state of regulations has also improved. A proposal introduced in 2024 that sought to restrict political and sports-based contracts was later withdrawn by the U.S. Commodities Futures Trading Commission, easing some regulatory uncertainty for the sector. Industry estimates suggest that if adoption continues to expand, annual trading volumes could eventually exceed $500 billion. Best crypto platforms Wyoming’s stablecoin isn’t hype — it’s how payments get de-risked | Opinion Bitcoin retreats below $77,000, Tether posts $10B annual profit, DOJ seizes $400M in Helix assets | Weekly recap The hidden problem with crypto ETFs | Opinion KuCoin CEO on MiCA: Compliance becomes the cost of doing business in Europe The machine economy: AI will benefit crypto, or break it | Opinion What crypto treasuries must do to survive as the hype dies | Opinion Trump’s tariffs: Boosting or hurting XRP price? Capital without borders: Decentralized crowdfunding thrives in global turmoil | Opinion Meet Jingliang Su, Chinese man gets 46 months sentence for $36.9M crypto scam Intelligence on the chain: AI must become a tokenized asset | Opinion Solana price breaks below $100 to 10-month low — Can bulls defend the next support? Solana price flashes a multi-year bearish pattern despite soaring network metrics PUMP token jumps 25% as Pump.fun, Solana Foundation face class action heat Get crypto market analysis and curated news delivered right to your inbox every week. You have successfully joined our subscriber list. Sign up for our free newsletters"
    },
    {
      "title": "Bitcoin’s $75K–$80K zone may be the final major dip of the cycle, analyst says",
      "source": "Crypto.News",
      "summary": "Analyst PlanC called the current $75,000–$80,000 zone a potential cycle bottom, stating there is “a decent chance this will be the deepest pullback opportunity this Bitcoin bull run.” Bitcoin btc -0.95% Bitcoin traded between $77,082 and $83,426 over the past 24 hours, sitting 37.8% below its all-time high of $126,080 reached on October 6, 2025. The drawdown has extended across multiple timeframes. Bitcoin posted losses of 6.0% over 24 hours, 11.6% over seven days and 23.5% over one year. PlanC noted that 35–40% corrections have occurred during previous Bitcoin bull markets. The current decline to $75,000–$80,000 would be a correction within that historical range from the October 2025 all-time high. The analyst compared the current pattern to three prior capitulation events: the 2018 bear market low near $3,000, the March 2020 crash to approximately $5,100, and the FTX collapse that pushed Bitcoin to around $15,500. “There is a decent chance we are going through another major capitulation low as we speak,” PlanC wrote on X. Bitcoin advocate and financial accountant Rajat Soni urged caution against overreacting to weekend volatility. “Never trust a weekend pump OR dump,” Soni wrote. “Bitcoin will make a comeback when you least expect it.” Not all analysts share PlanC’s view that the bottom is forming. Veteran trader Peter Brandt predicted Bitcoin could fall as low as $60,000 by the third quarter of 2026.",
      "full_text": "Analyst PlanC called the current $75,000–$80,000 zone a potential cycle bottom, stating there is “a decent chance this will be the deepest pullback opportunity this Bitcoin bull run.” Bitcoin btc -0.95% Bitcoin traded between $77,082 and $83,426 over the past 24 hours, sitting 37.8% below its all-time high of $126,080 reached on October 6, 2025. The drawdown has extended across multiple timeframes. Bitcoin posted losses of 6.0% over 24 hours, 11.6% over seven days and 23.5% over one year. PlanC noted that 35–40% corrections have occurred during previous Bitcoin bull markets. The current decline to $75,000–$80,000 would be a correction within that historical range from the October 2025 all-time high. The analyst compared the current pattern to three prior capitulation events: the 2018 bear market low near $3,000, the March 2020 crash to approximately $5,100, and the FTX collapse that pushed Bitcoin to around $15,500. “There is a decent chance we are going through another major capitulation low as we speak,” PlanC wrote on X. Bitcoin advocate and financial accountant Rajat Soni urged caution against overreacting to weekend volatility. “Never trust a weekend pump OR dump,” Soni wrote. “Bitcoin will make a comeback when you least expect it.” Not all analysts share PlanC’s view that the bottom is forming. Veteran trader Peter Brandt predicted Bitcoin could fall as low as $60,000 by the third quarter of 2026. Crypto analyst Benjamin Cowen placed the market cycle low in early October 2026. He also warned that rallies will occur between now and then before the ultimate bottom happens. His timeline implies months of volatility ahead with interim recoveries that could trap buyers expecting a sustained rebound. Best crypto platforms Wyoming’s stablecoin isn’t hype — it’s how payments get de-risked | Opinion Bitcoin retreats below $77,000, Tether posts $10B annual profit, DOJ seizes $400M in Helix assets | Weekly recap The hidden problem with crypto ETFs | Opinion KuCoin CEO on MiCA: Compliance becomes the cost of doing business in Europe The machine economy: AI will benefit crypto, or break it | Opinion What crypto treasuries must do to survive as the hype dies | Opinion Trump’s tariffs: Boosting or hurting XRP price? Capital without borders: Decentralized crowdfunding thrives in global turmoil | Opinion Meet Jingliang Su, Chinese man gets 46 months sentence for $36.9M crypto scam Intelligence on the chain: AI must become a tokenized asset | Opinion Here’s why Bitcoin price is crashing today? (Feb. 2) Will MSTR stock price fall as Strategy’s BTC holdings slip into $900M unrealized loss? Crypto prices today (Feb. 2): BTC dips below $75K, XRP, LINK, XMR slide amid market crash Get crypto market analysis and curated news delivered right to your inbox every week. You have successfully joined our subscriber list. Sign up for our free newsletters"
    },
    {
      "title": "Epstein once said he had contact with Bitcoin’s creators",
      "source": "Crypto.News",
      "summary": "Classified emails from the Department of Justice’s document release revealed Jeffrey Epstein claimed direct contact with Bitcoin’s creators as early as 2016. A October 13, 2016 email from Epstein to recipients Raafat Alsabbagh and Aziza Alahmadi discussed using Bitcoin technology to build a Sharia-compliant digital currency for the Middle East. The email, sent from Epstein’s address, stated he had spoken to “some of the founders of bitcoin” who were “very excited” about the project. The claim remains unverified, as Bitcoin’s ( BTC ) pseudonymous creator Satoshi Nakamoto has never been publicly identified. Earlier DOJ documents show Epstein received Bitcoin-related materials dating back to April 2013, when Boris Nikolic forwarded him analysis from Tren Griffin discussing Bitcoin’s properties as a payment mechanism. The DOJ files show Epstein maintained connections to prominent figures in technology and finance who were active in early cryptocurrency discussions. A July 31, 2014 email from Austin Hill to Epstein, carbon copied to Reid Hoffman and Joichi Ito, discussed concerns about Stellar’s launch and its relationship to Ripple. Hill’s email carried the subject line “Stellar isn’t so Stellar” and raised concerns that investors backing both Ripple and Stellar created conflicts within the ecosystem. The correspondence was carbon copied to Hoffman, a LinkedIn co-founder and prominent tech investor, and Ito, who served as director of MIT Media Lab at the time. The April 2013 forwarded email from Boris Nikolic contained analysis from Tren Griffin, who wrote extensively about Bitcoin’s use as a payment mechanism and its relationship to network effects.",
      "full_text": "Classified emails from the Department of Justice’s document release revealed Jeffrey Epstein claimed direct contact with Bitcoin’s creators as early as 2016. A October 13, 2016 email from Epstein to recipients Raafat Alsabbagh and Aziza Alahmadi discussed using Bitcoin technology to build a Sharia-compliant digital currency for the Middle East. The email, sent from Epstein’s address, stated he had spoken to “some of the founders of bitcoin” who were “very excited” about the project. The claim remains unverified, as Bitcoin’s ( BTC ) pseudonymous creator Satoshi Nakamoto has never been publicly identified. Earlier DOJ documents show Epstein received Bitcoin-related materials dating back to April 2013, when Boris Nikolic forwarded him analysis from Tren Griffin discussing Bitcoin’s properties as a payment mechanism. The DOJ files show Epstein maintained connections to prominent figures in technology and finance who were active in early cryptocurrency discussions. A July 31, 2014 email from Austin Hill to Epstein, carbon copied to Reid Hoffman and Joichi Ito, discussed concerns about Stellar’s launch and its relationship to Ripple. Hill’s email carried the subject line “Stellar isn’t so Stellar” and raised concerns that investors backing both Ripple and Stellar created conflicts within the ecosystem. The correspondence was carbon copied to Hoffman, a LinkedIn co-founder and prominent tech investor, and Ito, who served as director of MIT Media Lab at the time. The April 2013 forwarded email from Boris Nikolic contained analysis from Tren Griffin, who wrote extensively about Bitcoin’s use as a payment mechanism and its relationship to network effects. Griffin’s analysis noted that Bitcoin’s value depends on the number of users and that the asset had no intrinsic value beyond what participants assigned to it. Epstein’s 2016 proposal described creating two new currencies, one Sharia-compliant, designed for internal use among Muslims in the Middle East. The email suggested the digital currency would function like a dollar but incorporate religious compliance requirements. The documents are part of a broader DOJ release containing approximately three million files related to Epstein’s associates and business dealings. Researchers continue examining the collection for additional references to cryptocurrency involvement. Best crypto platforms Wyoming’s stablecoin isn’t hype — it’s how payments get de-risked | Opinion Bitcoin retreats below $77,000, Tether posts $10B annual profit, DOJ seizes $400M in Helix assets | Weekly recap The hidden problem with crypto ETFs | Opinion KuCoin CEO on MiCA: Compliance becomes the cost of doing business in Europe The machine economy: AI will benefit crypto, or break it | Opinion What crypto treasuries must do to survive as the hype dies | Opinion Trump’s tariffs: Boosting or hurting XRP price? Capital without borders: Decentralized crowdfunding thrives in global turmoil | Opinion Meet Jingliang Su, Chinese man gets 46 months sentence for $36.9M crypto scam Intelligence on the chain: AI must become a tokenized asset | Opinion Here’s why Bitcoin price is crashing today? (Feb. 2) Will MSTR stock price fall as Strategy’s BTC holdings slip into $900M unrealized loss? Crypto prices today (Feb. 2): BTC dips below $75K, XRP, LINK, XMR slide amid market crash Get crypto market analysis and curated news delivered right to your inbox every week. You have successfully joined our subscriber list. Sign up for our free newsletters"
    },
    {
      "title": "Wintermute founder says Binance wasn’t at fault in October flash crash",
      "source": "Crypto.News",
      "summary": "Wintermute founder Evgeny Gaevoy dismissed claims that Binance caused the October 10 crypto market crash, calling attempts to blame a single exchange “intellectually dishonest.” Writing on X, Gaevoy called the event as “a flash crash on mega leveraged market on illiquid Friday night driven by macro news” rather than platform-specific failures. The comments responded to OKX CEO Star Xu’s criticism that Binance irresponsibly marketed USDe with 12% yields while allowing the token to serve as collateral without proper risk warnings. Tens of billions of dollars were liquidated during the October 10 event, which Xu claimed fundamentally changed crypto market microstructure. Gaevoy countered that “finding a scapegoat is comfy” during bear markets but does not address underlying market conditions. Gaevoy rejected characterizations of October 10 as a “software glitch,” stating the crash resulted from macro news hitting an overleveraged market during illiquid trading hours. The Friday night timing amplified volatility as fewer market makers provided liquidity to absorb selling pressure. “I get that nobody likes being in bear market, watching every single asset class besides crypto going up,” Gaevoy wrote. Gaevoy urged “public figures would pick words more carefully” when discussing the crash. His pushback came as multiple industry leaders debated causes of the liquidation that some participants compared to FTX’s collapse in severity. The October event followed announcement of 100% tariffs on China by the United States.",
      "full_text": "Wintermute founder Evgeny Gaevoy dismissed claims that Binance caused the October 10 crypto market crash, calling attempts to blame a single exchange “intellectually dishonest.” Writing on X, Gaevoy called the event as “a flash crash on mega leveraged market on illiquid Friday night driven by macro news” rather than platform-specific failures. The comments responded to OKX CEO Star Xu’s criticism that Binance irresponsibly marketed USDe with 12% yields while allowing the token to serve as collateral without proper risk warnings. Tens of billions of dollars were liquidated during the October 10 event, which Xu claimed fundamentally changed crypto market microstructure. Gaevoy countered that “finding a scapegoat is comfy” during bear markets but does not address underlying market conditions. Gaevoy rejected characterizations of October 10 as a “software glitch,” stating the crash resulted from macro news hitting an overleveraged market during illiquid trading hours. The Friday night timing amplified volatility as fewer market makers provided liquidity to absorb selling pressure. “I get that nobody likes being in bear market, watching every single asset class besides crypto going up,” Gaevoy wrote. Gaevoy urged “public figures would pick words more carefully” when discussing the crash. His pushback came as multiple industry leaders debated causes of the liquidation that some participants compared to FTX’s collapse in severity. The October event followed announcement of 100% tariffs on China by the United States. The macro catalyst caused liquidations across leveraged positions, with total crypto market capitalization falling 23.7% in Q4 2025 according to CoinGecko data. OKX CEO Star Xu provided detailed mechanics of how Binance’s USDe promotion created systemic risk. Users converted USDT and USDC into USDe to earn 12% yields, then used USDe as collateral to borrow USDT, converted borrowed funds back into USDe, and repeated the cycle. The leverage loop produced artificial APYs reaching 24%, 36%, and exceeding 70%, which users perceived as low risk because a major platform offered the yields. “Systemic risk accumulated quickly across the global crypto market,” Xu wrote. USDe differs fundamentally from tokenized money market funds like BlackRock BUIDL and Franklin Templeton BENJI, Xu argued. When volatility hit, USDe depegged quickly. Cascading liquidations followed, with weaknesses in risk management around assets like WETH and BNSOL amplifying the crash. Some tokens briefly traded near zero. “I am discussing the root cause, not assigning blame or launching an attack on Binance,” Xu stated. Best crypto platforms Wyoming’s stablecoin isn’t hype — it’s how payments get de-risked | Opinion Bitcoin retreats below $77,000, Tether posts $10B annual profit, DOJ seizes $400M in Helix assets | Weekly recap The hidden problem with crypto ETFs | Opinion KuCoin CEO on MiCA: Compliance becomes the cost of doing business in Europe The machine economy: AI will benefit crypto, or break it | Opinion What crypto treasuries must do to survive as the hype dies | Opinion Trump’s tariffs: Boosting or hurting XRP price? Capital without borders: Decentralized crowdfunding thrives in global turmoil | Opinion Meet Jingliang Su, Chinese man gets 46 months sentence for $36.9M crypto scam Intelligence on the chain: AI must become a tokenized asset | Opinion What crash? Binance’s CZ rejects claims platform caused $19b crypto crash Binance to convert $1B SAFU reserve from stablecoins to BTC in long-term bet DeLorean DMC rallies over 200% after Binance perpetuals removal as community reasserts control Get crypto market analysis and curated news delivered right to your inbox every week. You have successfully joined our subscriber list. Sign up for our free newsletters"
    },
    {
      "title": "Bitcoin ETFs extend four-day outflow streak while BTC stalls near $83,000",
      "source": "Crypto.News",
      "summary": "Bitcoin spot ETFs recorded $509.70 million in net outflows on January 30 and mark the fourth day of redemptions in five trading sessions. BlackRock’s IBIT led withdrawals with $528.30 million in outflows, while Fidelity’s FBTC attracted $7.30 million in inflows as one of just three funds posting positive flows. The weekly total reached $1.49 billion in outflows for the period ending January 30, following the previous week’s $1.33 billion exodus. Bitcoin btc -0.95% Bitcoin struggled to maintain momentum near $83,000 as sustained Bitcoin ETFs selling pressure dragged total net assets to $106.96 billion from $115.88 billion on January 23. Cumulative total net inflow fell to $55.01 billion from $56.49 billion over the same period. The outflow streak intensified January 29 with $817.87 million in redemptions, the largest single-day withdrawal since the selling wave began. January 27 saw $147.37 million in outflows, while January 28 posted a more modest $19.64 million in withdrawals. January 26 provided brief respite with $6.84 million in inflows before redemptions resumed. Ark & 21Shares’ ARKB attracted $8.34 million in inflows on January 30, while VanEck’s HODL posted $2.96 million in positive flows. Grayscale’s GBTC and mini BTC trust, along with Bitwise’s BITB, Invesco’s BTCO, Valkyrie’s BRRR, Franklin’s EZBC, WisdomTree’s BTCW, and Hashdex’s DEFI all recorded zero flows.",
      "full_text": "Bitcoin spot ETFs recorded $509.70 million in net outflows on January 30 and mark the fourth day of redemptions in five trading sessions. BlackRock’s IBIT led withdrawals with $528.30 million in outflows, while Fidelity’s FBTC attracted $7.30 million in inflows as one of just three funds posting positive flows. The weekly total reached $1.49 billion in outflows for the period ending January 30, following the previous week’s $1.33 billion exodus. Bitcoin btc -0.95% Bitcoin struggled to maintain momentum near $83,000 as sustained Bitcoin ETFs selling pressure dragged total net assets to $106.96 billion from $115.88 billion on January 23. Cumulative total net inflow fell to $55.01 billion from $56.49 billion over the same period. The outflow streak intensified January 29 with $817.87 million in redemptions, the largest single-day withdrawal since the selling wave began. January 27 saw $147.37 million in outflows, while January 28 posted a more modest $19.64 million in withdrawals. January 26 provided brief respite with $6.84 million in inflows before redemptions resumed. Ark & 21Shares’ ARKB attracted $8.34 million in inflows on January 30, while VanEck’s HODL posted $2.96 million in positive flows. Grayscale’s GBTC and mini BTC trust, along with Bitwise’s BITB, Invesco’s BTCO, Valkyrie’s BRRR, Franklin’s EZBC, WisdomTree’s BTCW, and Hashdex’s DEFI all recorded zero flows. Total value traded reached $5.32 billion on January 30, down from $7.51 billion the previous day. The two-week outflow period from January 20 through January 30 has drained approximately $2.82 billion from Bitcoin ETFs. BlackRock’s IBIT holds $61.96 billion in cumulative net inflows. Fidelity’s FBTC has accumulated $11.27 billion in total inflows. Ethereum spot ETFs recorded $252.87 million in net outflows on January 30, with BlackRock’s ETHA accounting for $157.16 million and Fidelity’s FETH posting $95.71 million in redemptions. Total net assets for Ethereum products fell to $15.86 billion from $17.70 billion on January 23. Cumulative total net inflow dropped to $11.97 billion from $12.30 billion. Total value traded reached $1.80 billion on January 30. Ethereum ETFs have posted outflows in three of the past four trading days. January 29 saw $155.61 million in withdrawals, while January 27 recorded $63.53 million in redemptions. January 28 provided a brief reversal with $28.10 million in inflows before selling resumed. Best crypto platforms Wyoming’s stablecoin isn’t hype — it’s how payments get de-risked | Opinion Bitcoin retreats below $77,000, Tether posts $10B annual profit, DOJ seizes $400M in Helix assets | Weekly recap The hidden problem with crypto ETFs | Opinion KuCoin CEO on MiCA: Compliance becomes the cost of doing business in Europe The machine economy: AI will benefit crypto, or break it | Opinion What crypto treasuries must do to survive as the hype dies | Opinion Trump’s tariffs: Boosting or hurting XRP price? Capital without borders: Decentralized crowdfunding thrives in global turmoil | Opinion Meet Jingliang Su, Chinese man gets 46 months sentence for $36.9M crypto scam Intelligence on the chain: AI must become a tokenized asset | Opinion Here’s why Bitcoin price is crashing today? (Feb. 2) Will MSTR stock price fall as Strategy’s BTC holdings slip into $900M unrealized loss? Crypto prices today (Feb. 2): BTC dips below $75K, XRP, LINK, XMR slide amid market crash Get crypto market analysis and curated news delivered right to your inbox every week. You have successfully joined our subscriber list. Sign up for our free newsletters"
    },
    {
      "title": "Crypto VC Funding: Mesh secures $75 million, Talos bags $45 million",
      "source": "Crypto.News",
      "summary": "The week of January 25-31, 2026, recorded $243.9 million in crypto VC funding across 14 projects, with Mesh (ex Front Finance) leading the final week of January. Here’s a look into this week’s crypto funding activity as per Cryptofundraising data. Best crypto platforms Wyoming’s stablecoin isn’t hype — it’s how payments get de-risked | Opinion Bitcoin retreats below $77,000, Tether posts $10B annual profit, DOJ seizes $400M in Helix assets | Weekly recap The hidden problem with crypto ETFs | Opinion KuCoin CEO on MiCA: Compliance becomes the cost of doing business in Europe The machine economy: AI will benefit crypto, or break it | Opinion What crypto treasuries must do to survive as the hype dies | Opinion Trump’s tariffs: Boosting or hurting XRP price? Capital without borders: Decentralized crowdfunding thrives in global turmoil | Opinion Meet Jingliang Su, Chinese man gets 46 months sentence for $36.9M crypto scam Intelligence on the chain: AI must become a tokenized asset | Opinion Crypto VC Funding: BitGo leads with $212.8m IPO, Superstate bags $82.5m Pump.fun price charts a bearish wedge pattern as whales exit, will it crash? Pump.fun expands into startup funding with new $3M ecosystem fund Get crypto market analysis and curated news delivered right to your inbox every week. You have successfully joined our subscriber list. Sign up for our free newsletters",
      "full_text": "The week of January 25-31, 2026, recorded $243.9 million in crypto VC funding across 14 projects, with Mesh (ex Front Finance) leading the final week of January. Here’s a look into this week’s crypto funding activity as per Cryptofundraising data. Best crypto platforms Wyoming’s stablecoin isn’t hype — it’s how payments get de-risked | Opinion Bitcoin retreats below $77,000, Tether posts $10B annual profit, DOJ seizes $400M in Helix assets | Weekly recap The hidden problem with crypto ETFs | Opinion KuCoin CEO on MiCA: Compliance becomes the cost of doing business in Europe The machine economy: AI will benefit crypto, or break it | Opinion What crypto treasuries must do to survive as the hype dies | Opinion Trump’s tariffs: Boosting or hurting XRP price? Capital without borders: Decentralized crowdfunding thrives in global turmoil | Opinion Meet Jingliang Su, Chinese man gets 46 months sentence for $36.9M crypto scam Intelligence on the chain: AI must become a tokenized asset | Opinion Crypto VC Funding: BitGo leads with $212.8m IPO, Superstate bags $82.5m Pump.fun price charts a bearish wedge pattern as whales exit, will it crash? Pump.fun expands into startup funding with new $3M ecosystem fund Get crypto market analysis and curated news delivered right to your inbox every week. You have successfully joined our subscriber list. Sign up for our free newsletters"
    },
    {
      "title": "Sorry, you have been blocked",
      "source": "The Block",
      "summary": "This website is using a security service to protect itself from online attacks. The action you just performed triggered the security solution. There are several actions that could trigger this block including submitting a certain word or phrase, a SQL command or malformed data. You can email the site owner to let them know you were blocked. Please include what you were doing when this page came up and the Cloudflare Ray ID found at the bottom of this page. Cloudflare Ray ID: 9c79563cde55e1b1 • Your IP: Click to reveal 172.183.135.147 • Performance & security by Cloudflare.",
      "full_text": "This website is using a security service to protect itself from online attacks. The action you just performed triggered the security solution. There are several actions that could trigger this block including submitting a certain word or phrase, a SQL command or malformed data. You can email the site owner to let them know you were blocked. Please include what you were doing when this page came up and the Cloudflare Ray ID found at the bottom of this page. Cloudflare Ray ID: 9c79563cde55e1b1 • Your IP: Click to reveal 172.183.135.147 • Performance & security by Cloudflare"
    },
    {
      "title": "Sorry, you have been blocked",
      "source": "The Block",
      "summary": "This website is using a security service to protect itself from online attacks. The action you just performed triggered the security solution. There are several actions that could trigger this block including submitting a certain word or phrase, a SQL command or malformed data. You can email the site owner to let them know you were blocked. Please include what you were doing when this page came up and the Cloudflare Ray ID found at the bottom of this page. Cloudflare Ray ID: 9c79565cba49e1b1 • Your IP: Click to reveal 172.183.135.147 • Performance & security by Cloudflare.",
      "full_text": "This website is using a security service to protect itself from online attacks. The action you just performed triggered the security solution. There are several actions that could trigger this block including submitting a certain word or phrase, a SQL command or malformed data. You can email the site owner to let them know you were blocked. Please include what you were doing when this page came up and the Cloudflare Ray ID found at the bottom of this page. Cloudflare Ray ID: 9c79565cba49e1b1 • Your IP: Click to reveal 172.183.135.147 • Performance & security by Cloudflare"
    },
    {
      "title": "Sorry, you have been blocked",
      "source": "The Block",
      "summary": "This website is using a security service to protect itself from online attacks. The action you just performed triggered the security solution. There are several actions that could trigger this block including submitting a certain word or phrase, a SQL command or malformed data. You can email the site owner to let them know you were blocked. Please include what you were doing when this page came up and the Cloudflare Ray ID found at the bottom of this page. Cloudflare Ray ID: 9c79567c3c9fe1b1 • Your IP: Click to reveal 172.183.135.147 • Performance & security by Cloudflare.",
      "full_text": "This website is using a security service to protect itself from online attacks. The action you just performed triggered the security solution. There are several actions that could trigger this block including submitting a certain word or phrase, a SQL command or malformed data. You can email the site owner to let them know you were blocked. Please include what you were doing when this page came up and the Cloudflare Ray ID found at the bottom of this page. Cloudflare Ray ID: 9c79567c3c9fe1b1 • Your IP: Click to reveal 172.183.135.147 • Performance & security by Cloudflare"
    },
    {
      "title": "Sorry, you have been blocked",
      "source": "The Block",
      "summary": "This website is using a security service to protect itself from online attacks. The action you just performed triggered the security solution. There are several actions that could trigger this block including submitting a certain word or phrase, a SQL command or malformed data. You can email the site owner to let them know you were blocked. Please include what you were doing when this page came up and the Cloudflare Ray ID found at the bottom of this page. Cloudflare Ray ID: 9c79569bdf2fe1b1 • Your IP: Click to reveal 172.183.135.147 • Performance & security by Cloudflare.",
      "full_text": "This website is using a security service to protect itself from online attacks. The action you just performed triggered the security solution. There are several actions that could trigger this block including submitting a certain word or phrase, a SQL command or malformed data. You can email the site owner to let them know you were blocked. Please include what you were doing when this page came up and the Cloudflare Ray ID found at the bottom of this page. Cloudflare Ray ID: 9c79569bdf2fe1b1 • Your IP: Click to reveal 172.183.135.147 • Performance & security by Cloudflare"
    },
    {
      "title": "Sorry, you have been blocked",
      "source": "The Block",
      "summary": "This website is using a security service to protect itself from online attacks. The action you just performed triggered the security solution. There are several actions that could trigger this block including submitting a certain word or phrase, a SQL command or malformed data. You can email the site owner to let them know you were blocked. Please include what you were doing when this page came up and the Cloudflare Ray ID found at the bottom of this page. Cloudflare Ray ID: 9c7956bb69bae1b1 • Your IP: Click to reveal 172.183.135.147 • Performance & security by Cloudflare.",
      "full_text": "This website is using a security service to protect itself from online attacks. The action you just performed triggered the security solution. There are several actions that could trigger this block including submitting a certain word or phrase, a SQL command or malformed data. You can email the site owner to let them know you were blocked. Please include what you were doing when this page came up and the Cloudflare Ray ID found at the bottom of this page. Cloudflare Ray ID: 9c7956bb69bae1b1 • Your IP: Click to reveal 172.183.135.147 • Performance & security by Cloudflare"
    },
    {
      "title": "Sorry, you have been blocked",
      "source": "The Block",
      "summary": "This website is using a security service to protect itself from online attacks. The action you just performed triggered the security solution. There are several actions that could trigger this block including submitting a certain word or phrase, a SQL command or malformed data. You can email the site owner to let them know you were blocked. Please include what you were doing when this page came up and the Cloudflare Ray ID found at the bottom of this page. Cloudflare Ray ID: 9c7956daecf4e1b1 • Your IP: Click to reveal 172.183.135.147 • Performance & security by Cloudflare.",
      "full_text": "This website is using a security service to protect itself from online attacks. The action you just performed triggered the security solution. There are several actions that could trigger this block including submitting a certain word or phrase, a SQL command or malformed data. You can email the site owner to let them know you were blocked. Please include what you were doing when this page came up and the Cloudflare Ray ID found at the bottom of this page. Cloudflare Ray ID: 9c7956daecf4e1b1 • Your IP: Click to reveal 172.183.135.147 • Performance & security by Cloudflare"
    },
    {
      "title": "Sorry, you have been blocked",
      "source": "The Block",
      "summary": "This website is using a security service to protect itself from online attacks. The action you just performed triggered the security solution. There are several actions that could trigger this block including submitting a certain word or phrase, a SQL command or malformed data. You can email the site owner to let them know you were blocked. Please include what you were doing when this page came up and the Cloudflare Ray ID found at the bottom of this page. Cloudflare Ray ID: 9c7956fa8fdce1b1 • Your IP: Click to reveal 172.183.135.147 • Performance & security by Cloudflare.",
      "full_text": "This website is using a security service to protect itself from online attacks. The action you just performed triggered the security solution. There are several actions that could trigger this block including submitting a certain word or phrase, a SQL command or malformed data. You can email the site owner to let them know you were blocked. Please include what you were doing when this page came up and the Cloudflare Ray ID found at the bottom of this page. Cloudflare Ray ID: 9c7956fa8fdce1b1 • Your IP: Click to reveal 172.183.135.147 • Performance & security by Cloudflare"
    },
    {
      "title": "Sorry, you have been blocked",
      "source": "The Block",
      "summary": "This website is using a security service to protect itself from online attacks. The action you just performed triggered the security solution. There are several actions that could trigger this block including submitting a certain word or phrase, a SQL command or malformed data. You can email the site owner to let them know you were blocked. Please include what you were doing when this page came up and the Cloudflare Ray ID found at the bottom of this page. Cloudflare Ray ID: 9c79571a29c9e1b1 • Your IP: Click to reveal 172.183.135.147 • Performance & security by Cloudflare.",
      "full_text": "This website is using a security service to protect itself from online attacks. The action you just performed triggered the security solution. There are several actions that could trigger this block including submitting a certain word or phrase, a SQL command or malformed data. You can email the site owner to let them know you were blocked. Please include what you were doing when this page came up and the Cloudflare Ray ID found at the bottom of this page. Cloudflare Ray ID: 9c79571a29c9e1b1 • Your IP: Click to reveal 172.183.135.147 • Performance & security by Cloudflare"
    },
    {
      "title": "Sorry, you have been blocked",
      "source": "The Block",
      "summary": "This website is using a security service to protect itself from online attacks. The action you just performed triggered the security solution. There are several actions that could trigger this block including submitting a certain word or phrase, a SQL command or malformed data. You can email the site owner to let them know you were blocked. Please include what you were doing when this page came up and the Cloudflare Ray ID found at the bottom of this page. Cloudflare Ray ID: 9c795739bbc4e1b1 • Your IP: Click to reveal 172.183.135.147 • Performance & security by Cloudflare.",
      "full_text": "This website is using a security service to protect itself from online attacks. The action you just performed triggered the security solution. There are several actions that could trigger this block including submitting a certain word or phrase, a SQL command or malformed data. You can email the site owner to let them know you were blocked. Please include what you were doing when this page came up and the Cloudflare Ray ID found at the bottom of this page. Cloudflare Ray ID: 9c795739bbc4e1b1 • Your IP: Click to reveal 172.183.135.147 • Performance & security by Cloudflare"
    },
    {
      "title": "Sorry, you have been blocked",
      "source": "The Block",
      "summary": "This website is using a security service to protect itself from online attacks. The action you just performed triggered the security solution. There are several actions that could trigger this block including submitting a certain word or phrase, a SQL command or malformed data. You can email the site owner to let them know you were blocked. Please include what you were doing when this page came up and the Cloudflare Ray ID found at the bottom of this page. Cloudflare Ray ID: 9c7957594eb2e1b1 • Your IP: Click to reveal 172.183.135.147 • Performance & security by Cloudflare.",
      "full_text": "This website is using a security service to protect itself from online attacks. The action you just performed triggered the security solution. There are several actions that could trigger this block including submitting a certain word or phrase, a SQL command or malformed data. You can email the site owner to let them know you were blocked. Please include what you were doing when this page came up and the Cloudflare Ray ID found at the bottom of this page. Cloudflare Ray ID: 9c7957594eb2e1b1 • Your IP: Click to reveal 172.183.135.147 • Performance & security by Cloudflare"
    },
    {
      "title": "FIGR_HELOC",
      "source": "Decrypt",
      "summary": "Some of the data collected by this provider is for the purposes of personalization and measuring advertising effectiveness. Some of the data collected by this provider is for the purposes of personalization and measuring advertising effectiveness. Your gateway into the world of Web3 The latest news, articles, and resources, sent to your inbox weekly. © A next-generation media company. 2026 Decrypt Media, Inc.",
      "full_text": "Some of the data collected by this provider is for the purposes of personalization and measuring advertising effectiveness. Some of the data collected by this provider is for the purposes of personalization and measuring advertising effectiveness. Your gateway into the world of Web3 The latest news, articles, and resources, sent to your inbox weekly. © A next-generation media company. 2026 Decrypt Media, Inc."
    },
    {
      "title": "No Relief For Crypto Investors As India Retains Current Crypto Tax In Budget 2026",
      "source": "Decrypt",
      "summary": "Some of the data collected by this provider is for the purposes of personalization and measuring advertising effectiveness. Some of the data collected by this provider is for the purposes of personalization and measuring advertising effectiveness. No Relief For Crypto Investors As India Retains Current Crypto Tax In Budget 2026 India's crypto investors will get no respite from one of the world's harshest digital asset tax regimes, as Finance Minister Nirmala Sitharaman on Sunday left the punitive 30% tax rate and 1% Tax Deducted at Source (TDS) unchanged in her ninth consecutive Union Budget presentation . The decision to maintain the status quo on crypto taxation, first introduced in February 2022, dashes industry hopes for relief from a framework that has driven nearly three-quarters of India's $6.1 billion (₹51,252 crore) in crypto trading volume to offshore platforms. The 2022 regime imposed a flat 30% tax on virtual digital asset income with zero deductions except acquisition costs, alongside a 1% TDS that has since crippled high-frequency trading on domestic exchanges. The unchanged policy means investors continue facing restrictions that prohibit offsetting losses from price drops or security breaches against other income, while the 1% TDS on every transaction makes thin-margin trading strategies commercially unviable on Indian platforms. The Indian government's stance \"signals that they are still choosing to wait and watch before they decide on next steps,\" Pranav Agarwal, independent director at Jetking Infotrain India—the country's first listed Bitcoin treasury company, told Decrypt . CA Sonu Jain, chief risk and compliance officer at 9Point Capital, told Decrypt the expectation of unchanged crypto taxes stemmed from the government's current priorities, which focus \"not on revisiting crypto tax policy but on strengthening enforcement, reporting, and compliance.\" India is coordinating policy discussions “at the G20 level on a comprehensive regulatory framework for crypto assets,” Jain said, adding that any revisions to tax rules are likely only once “such regulations are in place.” While tax rates remain untouched, Budget 2026 did ease one enforcement provision. Criminal liability for TDS defaults, previously punishable with up to seven years’ imprisonment, has been reduced to a maximum of two years, with courts now allowed to convert violations into monetary penalties.",
      "full_text": "Some of the data collected by this provider is for the purposes of personalization and measuring advertising effectiveness. Some of the data collected by this provider is for the purposes of personalization and measuring advertising effectiveness. No Relief For Crypto Investors As India Retains Current Crypto Tax In Budget 2026 India's crypto investors will get no respite from one of the world's harshest digital asset tax regimes, as Finance Minister Nirmala Sitharaman on Sunday left the punitive 30% tax rate and 1% Tax Deducted at Source (TDS) unchanged in her ninth consecutive Union Budget presentation . The decision to maintain the status quo on crypto taxation, first introduced in February 2022, dashes industry hopes for relief from a framework that has driven nearly three-quarters of India's $6.1 billion (₹51,252 crore) in crypto trading volume to offshore platforms. The 2022 regime imposed a flat 30% tax on virtual digital asset income with zero deductions except acquisition costs, alongside a 1% TDS that has since crippled high-frequency trading on domestic exchanges. The unchanged policy means investors continue facing restrictions that prohibit offsetting losses from price drops or security breaches against other income, while the 1% TDS on every transaction makes thin-margin trading strategies commercially unviable on Indian platforms. The Indian government's stance \"signals that they are still choosing to wait and watch before they decide on next steps,\" Pranav Agarwal, independent director at Jetking Infotrain India—the country's first listed Bitcoin treasury company, told Decrypt . CA Sonu Jain, chief risk and compliance officer at 9Point Capital, told Decrypt the expectation of unchanged crypto taxes stemmed from the government's current priorities, which focus \"not on revisiting crypto tax policy but on strengthening enforcement, reporting, and compliance.\" India is coordinating policy discussions “at the G20 level on a comprehensive regulatory framework for crypto assets,” Jain said, adding that any revisions to tax rules are likely only once “such regulations are in place.” While tax rates remain untouched, Budget 2026 did ease one enforcement provision. Criminal liability for TDS defaults, previously punishable with up to seven years’ imprisonment, has been reduced to a maximum of two years, with courts now allowed to convert violations into monetary penalties. Jain called the move “a big positive for P2P traders who have been non-compliant.” The regime had already tightened in Budget 2025 , when undisclosed crypto gains were brought under Section 158B, enabling retrospective audits going back 48 months and penalties of up to 70% on unpaid taxes. However, the budget introduced new penalty provisions for non-compliance with crypto asset transaction reporting requirements under Section 509 of the Income Tax Act, 2025. Entities failing to furnish statements face a penalty of $2.19 (₹200) per day, while those providing inaccurate information or failing to correct inaccuracies will be penalized $546 (₹50,000), taking effect from the 1st of April. India's income tax authorities have joined the Reserve Bank of India in raising concerns over virtual digital assets, citing enforcement challenges that threaten the government's ability to track and tax crypto transactions as the Union Budget approaches.\nOn Wednesday, Tax authorities presented their concerns about cryptocurrency and other virtual digital assets to the parliamentary standing committee of finance, according to a Times of India report.\n\nOfficials outlined challenges in tracking cr... \"Taxation was introduced as an interim step until clear and comprehensive regulations are defined,\" Sudhakar Lakshmanaraja, founder of Digital South Trust, a Web3 policy advocacy body, told Decrypt , echoing Jain’s sentiments. Amid ongoing volatility in crypto and Web3 markets, he said India’s approach “reflects policy maturity,” and that “regulatory certainty at this stage strengthens compliance” while supporting long-term ecosystem growth. Ethereum co-founder Vitalik Buterin has disclosed the strategy he uses on the prediction marketplace Polymarket in a recent interview.\nButerin told Foresight News that he looks for markets in what he calls “crazy mode” and bets that “crazy things won’t happen.”\n“For example, there’s a market betting on whether Trump will win the Nobel Peace Prize,\" he said. \"Or some markets predict the dollar will go to zero next year during periods of extreme panic.”\nGen Z Is Betting Big on Prediction Markets—L... U.S. President Donald Trump nominated financier and former Federal Reserve governor Kevin Warsh to succeed Jerome Powell as Chair of the country's central bank on Friday, a choice that lands as cryptocurrency markets slide and investors reassess the outlook for interest rates.\nAnnouncing the pick on Truth Social, Trump praised Warsh’s credentials and record, calling him a future “GREAT Fed Chairman” and signaling an end to mon"
    },
    {
      "title": "CrossCurve Threatens Legal Action After $3M Cross-Chain Bridge Exploit",
      "source": "Decrypt",
      "summary": "Defimon Alerts, a social account run by blockchain security firm Decurity, provided an initial estimate that the exploit resulted in losses of around $3 million across “several networks,” adding that the flaw let an attacker send a fake cross-chain message on CrossCurve’s smart contract that bypassed checks and caused the bridge to release funds. Blockchain security firm BlockSec, meanwhile, estimated total losses at about $2.76 million, including roughly $1.3 million on Ethereum and about $1.28 million on Arbitrum, as well as several chains, including Optimism, Base, Mantle, Kava, Frax, Celo, and Blast. CrossCurve has not publicly confirmed the loss estimate cited by security firms, and has not shared its own figure for the funds affected. Decrypt has reached out to CrossCurve for comment. This year was a record for hacks in the crypto sector, with over $2.72 billion stolen, according to data from TRM Labs. Yes, with depressed crypto prices getting investors down, 2025 was a particularly bad year for exploits—even after 2024 broke records. The year got off to a terrible start with a $1.5 billion loss in February after North Korean hackers targeted centralized exchange Bybit in the most significant crypto exploit in history. ﻿\nThat set the tone for the rest of the year, with \"eve... The exploit stemmed from a “lack of validation,” the team at BlockSec told Decrypt. “The cross‑chain messages that should have been validated were not verified, causing the destination‑chain contract to believe the message reflected a genuine transaction initiated on the source chain and to release the corresponding assets based on attacker‑forged payload data,” BlockSec said.",
      "full_text": "Some of the data collected by this provider is for the purposes of personalization and measuring advertising effectiveness. Some of the data collected by this provider is for the purposes of personalization and measuring advertising effectiveness. CrossCurve Threatens Legal Action After $3M Cross-Chain Bridge Exploit Decentralized finance protocol CrossCurve, formerly known as EYWA, says it has publicly identified ten Ethereum addresses linked to a hack of its token transfer system on Sunday. CrossCurve disclosed Sunday afternoon that an attacker exploited a flaw “involving the exploitation of a vulnerability in one of the smart contracts” used for its cross-chain bridge, a system that lets users move tokens between different blockchains. Hours later, CrossCurve CEO Boris Povar said the team had identified ten Ethereum addresses that received the funds in question. “These tokens were wrongfully taken from users due to a smart contract exploit,” Povar said. “We do not believe this was intentional on your part, and there is no indication of malicious intent.” Povar warned that if the funds are not returned or no contact is established within 72 hours, their team would “assume malicious intent and treat the matter as a judicial issue.” Failure to return the funds would trigger immediate escalation, including criminal referrals, civil litigation, coordination with exchanges and issuers to freeze assets, public disclosure of wallet and transaction data, and cooperation with law enforcement and blockchain analytics firms, Povar added. A smart contract is a program that runs on a blockchain and automatically executes transactions according to predefined rules. Ethereum-based DeFi platform Makina Finance has lost 1,299 ETH, worth around $4 million, after hackers successfully manipulated prices on one of its USDC liquidity pools.\nAccording to PeckShield and other blockchain security firms, the perpetrator(s) caused the exploit by issuing a flash loan for $280 million in USDC, and then harnessing $170 million of this to manipulate the MachineShareOracle that determines prices for the Dialectic USD (DUSD) and Dialectic USDC (DUSDC) liquidity pool.\n\n#PeckS... Defimon Alerts, a social account run by blockchain security firm Decurity, provided an initial estimate that the exploit resulted in losses of around $3 million across “several networks,” adding that the flaw let an attacker send a fake cross-chain message on CrossCurve’s smart contract that bypassed checks and caused the bridge to release funds. Blockchain security firm BlockSec, meanwhile, estimated total losses at about $2.76 million, including roughly $1.3 million on Ethereum and about $1.28 million on Arbitrum, as well as several chains, including Optimism, Base, Mantle, Kava, Frax, Celo, and Blast. CrossCurve has not publicly confirmed the loss estimate cited by security firms, and has not shared its own figure for the funds affected. Decrypt has reached out to CrossCurve for comment. This year was a record for hacks in the crypto sector, with over $2.72 billion stolen, according to data from TRM Labs.  \nYes, with depressed crypto prices getting investors down, 2025 was a particularly bad year for exploits—even after 2024 broke records.\nThe year got off to a terrible start with a $1.5 billion loss in February after North Korean hackers targeted centralized exchange Bybit in the most significant crypto exploit in history.\n﻿\nThat set the tone for the rest of the year, with \"eve... The exploit stemmed from a “lack of validation,” the team at BlockSec told Decrypt . “The cross‑chain messages that should have been validated were not verified, causing the destination‑chain contract to believe the message reflected a genuine transaction initiated on the source chain and to release the corresponding assets based on attacker‑forged payload data,” BlockSec said. The incident shows that “cross-chain security still leans too heavily on a single validation pathway,” BlockSec added. “If any alternate execution path bypasses that check, the entire trust model collapses.” “This exploit wasn’t a failure of Axelar’s core protocol; it was a receiver-side failure,” Dan Dadybayo, research and strategy lead at Unstoppable Wallet, told Decrypt . “CrossCurve’s custom ReceiverAxelar contract executed cross-chain messages without sufficiently authenticating them first.” Dadybayo said this pattern has been seen before in cases like Nomad’s 2022 hack . “The hard part of bridge security isn’t the messaging layer, it’s making sure nothing happens until authenticity is fully proven,” he added. “Custom receivers remain the weakest link. As long as bridges concentrate liquidity and rely on bespoke validation logic, they will continue to be the highest-risk surface in DeFi.” A Nevada state court has issued a temporary restraining order blocking Blockratize, the entity behind Polymarket, from offering event-based contracts in the state for two weeks, finding that the platform’s activities lik"
    },
    {
      "title": "Nevada Court Grants Temporary Restraining Order Against Polymarket",
      "source": "Decrypt",
      "summary": "Some of the data collected by this provider is for the purposes of personalization and measuring advertising effectiveness. Some of the data collected by this provider is for the purposes of personalization and measuring advertising effectiveness. Nevada Court Grants Temporary Restraining Order Against Polymarket A Nevada state court has issued a temporary restraining order blocking Blockratize, the entity behind Polymarket, from offering event-based contracts in the state for two weeks, finding that the platform’s activities likely violate Nevada gaming law and are not shielded by exclusive federal derivatives oversight. In an order issued Saturday, Judge Jason Woodbury sided with the Nevada Gaming Control Board, ruling that the Commodity Exchange Act \"does not vest exclusive jurisdiction over Polymarket's contracts with the Commodity Futures Trading Commission.\" The order blocks Polymarket from offering sports and events contracts to Nevada residents ahead of a February 11 hearing on a preliminary injunction. If upheld, platforms like Polymarket and competitor Kalshi may be forced to obtain state-by-state gambling licenses or abandon sports-related markets entirely, a business segment representing over 80% of some platforms' trading volumes. The Nevada Gaming Control Board filed its civil enforcement action seeking \"a declaration and injunction to stop Polymarket from offering unlicensed wagering\" through its mobile app, which it considers sports wagering activity under state statutes. \"The resulting harm in evasion of Nevada's 'comprehensive regulatory structure' and 'strict licensing standards' is immediate, irreparable, and not sufficiently remediable by compensatory damages,\" the judge wrote. The order declared that \"an unlicensed participant beyond the Board's control, such as Polymarket, obstructs the Board's ability to fulfill its statutory functions,\" including preventing wagers from individuals who could influence sporting event outcomes, blocking underage participants, and keeping unsuitable individuals from involvement. \"The balance of hardships and public interest in maintaining meaningful control over Nevada's gaming industry for the purpose of ensuring its integrity strongly supports issuance of the temporary restraining order,\" Judge Woodbury added.",
      "full_text": "Some of the data collected by this provider is for the purposes of personalization and measuring advertising effectiveness. Some of the data collected by this provider is for the purposes of personalization and measuring advertising effectiveness. Nevada Court Grants Temporary Restraining Order Against Polymarket A Nevada state court has issued a temporary restraining order blocking Blockratize, the entity behind Polymarket, from offering event-based contracts in the state for two weeks, finding that the platform’s activities likely violate Nevada gaming law and are not shielded by exclusive federal derivatives oversight. In an order issued Saturday, Judge Jason Woodbury sided with the Nevada Gaming Control Board, ruling that the Commodity Exchange Act \"does not vest exclusive jurisdiction over Polymarket's contracts with the Commodity Futures Trading Commission.\" The order blocks Polymarket from offering sports and events contracts to Nevada residents ahead of a February 11 hearing on a preliminary injunction. If upheld, platforms like Polymarket and competitor Kalshi may be forced to obtain state-by-state gambling licenses or abandon sports-related markets entirely, a business segment representing over 80% of some platforms' trading volumes. The Nevada Gaming Control Board filed its civil enforcement action seeking \"a declaration and injunction to stop Polymarket from offering unlicensed wagering\" through its mobile app, which it considers sports wagering activity under state statutes. \"The resulting harm in evasion of Nevada's 'comprehensive regulatory structure' and 'strict licensing standards' is immediate, irreparable, and not sufficiently remediable by compensatory damages,\" the judge wrote. The order declared that \"an unlicensed participant beyond the Board's control, such as Polymarket, obstructs the Board's ability to fulfill its statutory functions,\" including preventing wagers from individuals who could influence sporting event outcomes, blocking underage participants, and keeping unsuitable individuals from involvement. \"The balance of hardships and public interest in maintaining meaningful control over Nevada's gaming industry for the purpose of ensuring its integrity strongly supports issuance of the temporary restraining order,\" Judge Woodbury added. Ethereum co-founder Vitalik Buterin has disclosed the strategy he uses on the prediction marketplace Polymarket in a recent interview.\nButerin told Foresight News that he looks for markets in what he calls “crazy mode” and bets that “crazy things won’t happen.”\n“For example, there’s a market betting on whether Trump will win the Nobel Peace Prize,\" he said. \"Or some markets predict the dollar will go to zero next year during periods of extreme panic.”\nGen Z Is Betting Big on Prediction Markets—L... “It appears that Polymarket has already ceased offering event contracts in Nevada,” Daniel Wallach, founder and principal of Wallach Legal LLC, a law firm specializing in sports wagering and gaming law, posted on X. State-level enforcement may increase “compliance costs and legal uncertainties, potentially deterring investment and slowing the development of new features or products in the prediction market sector,” Even Alex Chandra, a partner at IGNOS Law Alliance, told Decrypt . Chandra said the government needs to provide “clearer guidelines, potentially standardizing the industry and fostering long-term growth.” The Nevada action follows similar enforcement moves across multiple jurisdictions. Both the Hungarian Supervisory Authority for Regulated Activities and the Portuguese Gaming Regulatory Authority issued bans against Polymarket this month, accusing it of illegal gambling activity. Earlier this month, Tennessee's Sports Wagering Council sent cease-and-desist letters to Polymarket, Kalshi, and Crypto.com, ordering the companies to immediately pull sports-related markets accessible to Tennessee customers and refund pending wagers. Rep. Ritchie Torres (D-NY) and 30 House colleagues, including former House Speaker Nancy Pelosi (D-CA), recently introduced the Public Integrity in Financial Prediction Markets Act of 2026. The bill would stop federal elected officials, political appointees, and employees of Congress and executive agencies from participating in prediction markets when they possess \"material non-public information\" about a market or the ability to influence its outcome. Decrypt has reached out to Polyarket for comment. Decentralized finance protocol CrossCurve, formerly known as EYWA, says it has publicly identified ten Ethereum addresses linked to a hack of its token transfer system on Sunday.\nCrossCurve disclosed Sunday afternoon that an attacker exploited a flaw “involving the exploitation of a vulnerability in one of the smart contracts” used for its cross-chain bridge, a system that lets users move tokens between different blockchains.\nHours later, CrossCurve CEO Boris Povar said the team had identified t... A UAE-backed entity t"
    },
    {
      "title": "Bitcoin Derivatives Signal Elevated Stress Following Market Rout",
      "source": "Decrypt",
      "summary": "Some of the data collected by this provider is for the purposes of personalization and measuring advertising effectiveness. Some of the data collected by this provider is for the purposes of personalization and measuring advertising effectiveness. Bitcoin Derivatives Signal Elevated Stress Following Market Rout A sharp selloff has pushed Bitcoin into one of its largest CME futures gaps on record and driven momentum indicators to levels previously seen only during major drawdowns. The leading crypto has slipped more than 10% from a weekend high of $84,177 to $75,947, according to CoinGecko data. The scale of the weekend rout is most visible in the CME futures gap. Because the world’s largest derivatives marketplace, CME, closes on Friday and reopens Monday, the price disconnect created a more than 8% gap—the fourth-largest since Bitcoin futures launched in 2017. The broader risk-off environment is being driven, in part, by a confluence of macroeconomic and geopolitical factors, experts told Decrypt . Key catalysts include the partial U.S. government shutdown , trade-war headlines, rising long-dated Japanese government bond yields, and geopolitical tensions, including the ongoing war in Iran and brewing friction in the South China Sea. Occurring during a period of thin weekend liquidity, the slump triggered $2.56 billion in liquidations on Sunday, marking the largest single-event wipeout in over three months. Since Thursday, total liquidations have exceeded $5.42 billion, per CoinGlass data.",
      "full_text": "Some of the data collected by this provider is for the purposes of personalization and measuring advertising effectiveness. Some of the data collected by this provider is for the purposes of personalization and measuring advertising effectiveness. Bitcoin Derivatives Signal Elevated Stress Following Market Rout A sharp selloff has pushed Bitcoin into one of its largest CME futures gaps on record and driven momentum indicators to levels previously seen only during major drawdowns. The leading crypto has slipped more than 10% from a weekend high of $84,177 to $75,947, according to CoinGecko data. The scale of the weekend rout is most visible in the CME futures gap. Because the world’s largest derivatives marketplace, CME, closes on Friday and reopens Monday, the price disconnect created a more than 8% gap—the fourth-largest since Bitcoin futures launched in 2017. The broader risk-off environment is being driven, in part, by a confluence of macroeconomic and geopolitical factors, experts told Decrypt . Key catalysts include the partial U.S. government shutdown , trade-war headlines, rising long-dated Japanese government bond yields, and geopolitical tensions, including the ongoing war in Iran and brewing friction in the South China Sea. Occurring during a period of thin weekend liquidity, the slump triggered $2.56 billion in liquidations on Sunday, marking the largest single-event wipeout in over three months. Since Thursday, total liquidations have exceeded $5.42 billion, per CoinGlass data. The deleveraging has effectively hollowed out the market’s speculative foundation, with aggregated open interest plummeting to $24.17 billion, a nine-month low, according to CryptoQuant data. “The CME gap formed from this move is one of the largest since the March 2020 COVID selloff,” Jeff Ko, Chief Analyst at CoinEx Research, told Decrypt . A CME gap forms when Bitcoin’s spot price moves while CME futures are closed, leaving a price gap when trading reopens that traders often expect to be revisited. Crypto prices extended their recent decline Saturday, with top assets like Bitcoin, Ethereum, and XRP plunging to prices not seen in several months or more, with liquidations continuing to climb throughout the day.\nBitcoin is down 8% over the last day at a recent price of $77,195, according to CoinGecko, marking the lowest price seen in nine months and extending its weekly slide to over 13%. The price of the top cryptocurrency has fallen nearly 39% since peaking above $126,000 in October.\nMeanwh... Ko noted that while most CME gaps tend to be filled within days to a week, the timing of a mean reversion move in February will \"depend heavily on macro variables such as bond yields and broader risk sentiment.\" The gap—sitting roughly between $77,000 and $84,000—will likely act as a magnet for traders once volatility compresses, Andri Fauzan Adziima, research lead at Bitrue, told Decrypt . “It probably won’t close this week with the current pressure, but a bounce could push it toward $84,000 in the next few weeks if we get oversold relief,” Adziima explained. Further signaling extreme technical exhaustion, the Weekly Relative Strength Index (RSI) plummeted to 32.22. However, the breakdown below the 100-week moving average and the emergence of a \"death cross\" suggest a more bearish structural shift, the Bitrue analyst said. The selloff has also pushed Bitcoin below a critical psychological floor: the average cost basis for U.S. spot Bitcoin ETFs, according to a tweet from Alex Thorn, Head of Research at Galaxy. Bitcoin is trading below that threshold after the second and third-largest outflow weeks ever recorded. The decline has also brought Bitcoin dangerously close to Strategy’s average purchase price of roughly $76,000, according to Bitcoin Treasuries data. “While volatility is likely to persist through Q1 amid ongoing macro uncertainty, this environment may also present opportunities to accumulate Bitcoin at a discounted price,” Ko said, describing the current phase as a \"healthy deleveraging\" rather than a structural bear market. U.S. spot Bitcoin exchange-traded funds (ETFs) notched a massive $817 million net outflow on Thursday, as the leading cryptocurrency’s price plummeted to a nine-month low.\nThe exodus was led by BlackRock’s IBIT, which saw $317.81 million in redemptions—a figure higher than the combined outflows of Fidelity’s FBTC ($168.05M) and Grayscale’s GBTC ($119.44M), according to SoSoValue data.\nThe aggressive selling followed a streak of negative catalysts that pushed Bitcoin out of its multi-week trading... In the options market, the outlook remains defensive. Bitcoin’s 7-day and 30-day 25 delta skew dropped below -12% and -8%, respectively, over the weekend, signaling that investors are paying a significant premium for downside protection (puts). “Traders have switched to defense mode. Futures positions are shrinking, and options show heavy buying of puts,” Adziima added. While the Bitrue analyst forecasted a"
    },
    {
      "title": "UAE Royal’s Alleged Stake in Trump Crypto Venture Raises Ethical Concerns",
      "source": "Decrypt",
      "summary": "Over the same period, the Solana-bas... Officials named by Warren, including Steve Witkoff, David Sacks, Secretary of Commerce Howard Lutnick, and other Trump Administration officials, “must testify in front of Congress on mounting evidence that they sold out American national security in order to benefit the President’s crypto company,” Senator Warren said. This should include an inquiry about whether any officials “lined their own pockets in the process,” she noted, adding that Congress “needs to grow a spine and put a stop to Trump’s crypto corruption.” Senator Warren’s statement follows an earlier call for an investigation in May last year into the extent of Donald Trump and his family’s crypto ventures in the UAE, as well as another request from December on whether Trump Administration officials “used their positions to cash in on foreign crypto deals.” Other critics have warned that Trump’s personal and family ties to crypto ventures risk blurring the line between policymaking and private financial interest at a moment when the administration is backing crypto regulation and expanding U.S. Some have also noted how the Trump family’s ventures have been “ frustrating ” bipartisan negotiations pushing for crypto regulation. What’s concerning in the financial arrangement is that it appears “like a subscription for policy access,” Andrew Rossow, public affairs attorney and CEO of AR Media Consulting, told Decrypt. The \"four-day window\" with which the deal with the UAE was reportedly signed appears as “a massive red flag,” Rossow said, because Congressional committees “typically use proximity to policy shifts as the primary justification for subpoenas.” “Where a company with no revenue and no product sells 49% of itself for $500 million, there is a very strong presumption that this fails the ‘arms-length transaction’ test, and instead, appears to be a ‘disguised gift,’ which bypasses traditional campaign finance and gift limit laws,” he added. President Donald Trump’s return to public office, the Securities and Exchange Commission has scaled back its crypto enforcement agenda. It has dropped cases, closed investigations, and changed what it prioritizes for enforcement. The most prominent case to fall out of the docket so far is the SEC’s lawsuit against Gemini Trust Company. Earlier this week, the SEC, alongside Gemini’s exchange now operating as Gemini Space Station, filed a joint stipulation to dismiss the Earn case after... The Committee on Foreign Investment in the U.S. (CFIUS) has the power to review foreign investments in U.S.",
      "full_text": "Some of the data collected by this provider is for the purposes of personalization and measuring advertising effectiveness. Some of the data collected by this provider is for the purposes of personalization and measuring advertising effectiveness. UAE Royal’s Alleged Stake in Trump Crypto Venture Raises Ethical Concerns A UAE-backed entity tied to Sheikh Tahnoon bin Zayed agreed to buy a 49% stake in Trump-linked crypto firm World Liberty Financial for $500 million four days before President Donald Trump’s inauguration, according to a report from the Wall Street Journal on Saturday. A large share of the proceeds flowed to Trump and Witkoff family entities, the report said, with the deal preceding the Trump administration's approval of expanded UAE access to advanced U.S. AI chips that had been restricted under the Biden administration. The primary agreement was signed by Eric Trump on behalf of World Liberty Financial, the family’s crypto investment and decentralized finance project. It involved an investment vehicle linked to Sheikh Tahnoon bin Zayed Al Nahyan, the UAE’s national security adviser and a member of the UAE royal family. The deal made the UAE-linked entity the crypto firm’s largest outside shareholder and directed roughly $187 million to Trump family entities and at least $31 million to Witkoff family-affiliated entities, the Wall Street Journal reported. The White House did not immediately return Decrypt’s request for comment. It comes as Congress continues to table a broad crypto market structure bill less than a year after the GENIUS Act took effect and began reshaping federal oversight of stablecoins and digital asset markets. \"This is corruption, plain and simple,” Senator Elizabeth Warren, ranking member of the Senate Banking, Housing, and Urban Affairs Committee, told Decrypt . “The Trump Administration must reverse its decision to sell sensitive AI chips to the United Arab Emirates.” A Trump-linked stablecoin has crossed a $5 billion market cap in under a year, while the U.S. President’s official meme coin has collapsed more than 94% from its peak, as capital flows shift toward yield-bearing, institution-friendly stablecoins.\nWorld Liberty Financial’s dollar-backed stablecoin USD1 surpassed $5 billion in market capitalization this week, making it the fifth-largest stablecoin less than a year after its launch, according to CoinGecko data.\n\nOver the same period, the Solana-bas... Officials named by Warren, including Steve Witkoff, David Sacks, Secretary of Commerce Howard Lutnick, and other Trump Administration officials, “must testify in front of Congress on mounting evidence that they sold out American national security in order to benefit the President’s crypto company,” Senator Warren said. This should include an inquiry about whether any officials “lined their own pockets in the process,” she noted, adding that Congress “needs to grow a spine and put a stop to Trump’s crypto corruption.” Senator Warren’s statement follows an earlier call for an investigation in May last year into the extent of Donald Trump and his family’s crypto ventures in the UAE, as well as another request from December on whether Trump Administration officials “used their positions to cash in on foreign crypto deals.” Other critics have warned that Trump’s personal and family ties to crypto ventures risk blurring the line between policymaking and private financial interest at a moment when the administration is backing crypto regulation and expanding U.S. crypto market access. Some have also noted how the Trump family’s ventures have been “ frustrating ” bipartisan negotiations pushing for crypto regulation. What’s concerning in the financial arrangement is that it appears “like a subscription for policy access,” Andrew Rossow, public affairs attorney and CEO of AR Media Consulting, told Decrypt . The \"four-day window\" with which the deal with the UAE was reportedly signed appears as “a massive red flag,” Rossow said, because Congressional committees “typically use proximity to policy shifts as the primary justification for subpoenas.” “Where a company with no revenue and no product sells 49% of itself for $500 million, there is a very strong presumption that this fails the ‘arms-length transaction’ test, and instead, appears to be a ‘disguised gift,’ which bypasses traditional campaign finance and gift limit laws,” he added. Since U.S. President Donald Trump’s return to public office, the Securities and Exchange Commission has scaled back its crypto enforcement agenda. It has dropped cases, closed investigations, and changed what it prioritizes for enforcement.\nThe most prominent case to fall out of the docket so far is the SEC’s lawsuit against Gemini Trust Company.\nEarlier this week, the SEC, alongside Gemini’s exchange now operating as Gemini Space Station, filed a joint stipulation to dismiss the Earn case after... The Committee on Foreign Investment in the U.S. (CFIUS) has the power to review foreign inve"
    },
    {
      "title": "Will Artificial Intelligence Save Humanity—Or End It?",
      "source": "Decrypt",
      "summary": "Some of the data collected by this provider is for the purposes of personalization and measuring advertising effectiveness. Some of the data collected by this provider is for the purposes of personalization and measuring advertising effectiveness. Will Artificial Intelligence Save Humanity—Or End It? A sharp divide over the future of artificial intelligence played out this week as four prominent technologists and transhumanists debated whether building artificial general intelligence, or AGI , would save humanity or destroy it. The panel hosted by the nonprofit Humanity+ brought together one of the most vocal AI \"Doomers,\" Eliezer Yudkowsky, who has called for shutting down advanced AI development, alongside philosopher and futurist Max More, computational neuroscientist Anders Sandberg, and Humanity+ President Emeritus Natasha Vita‑More. Their discussion revealed fundamental disagreements over whether AGI can be aligned with human survival or whether its creation would make extinction unavoidable. Yudkowsky warned that modern AI systems are fundamentally unsafe because their internal decision-making processes cannot be fully understood or controlled. “Anything black box is probably going to end up with remarkably similar problems to the current technology,” Yudkowsky warned. He argued that humanity would need to move “very, very far off the current paradigms” before advanced AI could be developed safely. Artificial general intelligence refers to a form of AI that can reason and learn across a wide range of tasks, rather than being built for a single job like text , image , or video generation.",
      "full_text": "Some of the data collected by this provider is for the purposes of personalization and measuring advertising effectiveness. Some of the data collected by this provider is for the purposes of personalization and measuring advertising effectiveness. Will Artificial Intelligence Save Humanity—Or End It? A sharp divide over the future of artificial intelligence played out this week as four prominent technologists and transhumanists debated whether building artificial general intelligence, or AGI , would save humanity or destroy it. The panel hosted by the nonprofit Humanity+ brought together one of the most vocal AI \"Doomers,\" Eliezer Yudkowsky, who has called for shutting down advanced AI development, alongside philosopher and futurist Max More, computational neuroscientist Anders Sandberg, and Humanity+ President Emeritus Natasha Vita‑More. Their discussion revealed fundamental disagreements over whether AGI can be aligned with human survival or whether its creation would make extinction unavoidable. Yudkowsky warned that modern AI systems are fundamentally unsafe because their internal decision-making processes cannot be fully understood or controlled. “Anything black box is probably going to end up with remarkably similar problems to the current technology,” Yudkowsky warned. He argued that humanity would need to move “very, very far off the current paradigms” before advanced AI could be developed safely. Artificial general intelligence refers to a form of AI that can reason and learn across a wide range of tasks, rather than being built for a single job like text , image , or video generation. AGI is often associated with the idea of the technological singularity , because reaching that level of intelligence could enable machines to improve themselves faster than humans can keep up. Yudkowsky pointed to the “ paperclip maximizer ” analogy popularized by philosopher Nick Bostrom to illustrate the risk. The thought experiment features a hypothetical AI that converts all available matter into paperclips, furthering its fixation on a single objective at the expense of mankind. Adding more objectives, Yudkowsky said, would not meaningfully improve safety. Referring to the title of his recent book on AI, \" If Anyone Builds It, Everyone Dies ,\" he said, “Our title is not like it might possibly kill you,” Yudkowsky said. “Our title is, if anyone builds it, everyone dies.” But More challenged the premise that extreme caution offers the safest outcome. He argued that AGI could provide humanity’s best chance to overcome aging and disease. Transhumanism, a movement that seeks to defeat aging and death through technology, was sharply criticized during a recent debate between philosophers, scientists, and transhumanist advocates, who rejected the accusation as misguided and reactionary.\nThe exchange took place Dec. 4 at the UK-based Institute of Art and Ideas’ “World’s Most Dangerous Idea” event, where neuroscientist and philosopher Àlex Gómez-Marín argued that the movement functions as a pseudo-religion—one that aims to eliminate t... “Most importantly to me, is AGI could help us to prevent the extinction of every person who’s living due to aging,” More stated. “We’re all dying. We’re heading for a catastrophe, one by one.” He warned that excessive restraint could push governments toward authoritarian controls as the only way to stop AI development worldwide. Sandberg positioned himself between the two camps, describing himself as “more sanguine” while remaining more cautious than transhumanist optimists. He recounted a personal experience in which he nearly used a large language model to assist with designing a bioweapon , an episode he described as “horrifying.” “We’re getting to a point where amplifying malicious actors is also going to cause a huge mess,” Sandberg said. Still, he argued that partial or “approximate safety” could be achievable. He rejected the idea that safety must be perfect to be meaningful, suggesting that humans could at least converge on minimal shared values such as survival. “So if you demand perfect safety, you're not going to get it. And that sounds very bad from that perspective,” he said. “On the other hand, I think we can actually have approximate safety. That's good enough.” Vita-More criticized the broader alignment debate itself, arguing that the concept assumes a level of consensus that does not exist even among longtime collaborators. “The alignment notion is a Pollyanna scheme,” she said. “It will never be aligned. I mean, even here, we’re all good people. We’ve known each other for decades, and we’re not aligned.” She described Yudkowsky’s claim that AGI would inevitably kill everyone as “absolutist thinking” that leaves no room for other outcomes. A new social network exclusively for AI agents has spawned something nobody expected: a lobster-themed religion called Crustafarianism.\nOf course, no one expects anything in the ever-surprising and fast-moving world of AI. Which is, per"
    },
    {
      "title": "Ethereum Founder Vitalik Buterin Made $70K Betting Against 'Crazy Mode' on Polymarket",
      "source": "Decrypt",
      "summary": "Some of the data collected by this provider is for the purposes of personalization and measuring advertising effectiveness. Some of the data collected by this provider is for the purposes of personalization and measuring advertising effectiveness. Ethereum Founder Vitalik Buterin Made $70K Betting Against 'Crazy Mode' on Polymarket Ethereum Ethereum co-founder Vitalik Buterin has disclosed the strategy he uses on the prediction marketplace Polymarket in a recent interview. Buterin told Foresight News that he looks for markets in what he calls “crazy mode” and bets that “crazy things won’t happen.” “For example, there’s a market betting on whether Trump will win the Nobel Peace Prize,\" he said. \"Or some markets predict the dollar will go to zero next year during periods of extreme panic.” A third of young Americans think prediction markets are the future. And they're putting their money where their mouth is. New survey data from The New Consumer and Coefficient Capital reveals that 31% of Americans believe prediction markets will become a bigger, more important part of culture. But that number masks a generational split that's as wide as the gap between TikTok and cable news. Younger consumers are much more aware of platforms like Polymarket and Kalshi. Gen Z and Millennials sho... Buterin claims he has made $70,000 on Polymarket in 2025 on a stake of $440,000, representing a gain of roughly 16%.",
      "full_text": "Some of the data collected by this provider is for the purposes of personalization and measuring advertising effectiveness. Some of the data collected by this provider is for the purposes of personalization and measuring advertising effectiveness. Ethereum Founder Vitalik Buterin Made $70K Betting Against 'Crazy Mode' on Polymarket Ethereum Ethereum co-founder Vitalik Buterin has disclosed the strategy he uses on the prediction marketplace Polymarket in a recent interview. Buterin told Foresight News that he looks for markets in what he calls “crazy mode” and bets that “crazy things won’t happen.” “For example, there’s a market betting on whether Trump will win the Nobel Peace Prize,\" he said. \"Or some markets predict the dollar will go to zero next year during periods of extreme panic.” A third of young Americans think prediction markets are the future. And they're putting their money where their mouth is.\nNew survey data from The New Consumer and Coefficient Capital reveals that 31% of Americans believe prediction markets will become a bigger, more important part of culture. But that number masks a generational split that's as wide as the gap between TikTok and cable news.\n\nYounger consumers are much more aware of platforms like Polymarket and Kalshi. Gen Z and Millennials sho... Buterin claims he has made $70,000 on Polymarket in 2025 on a stake of $440,000, representing a gain of roughly 16%. The Ethereum founder added that his strategy of betting against extreme market sentiment “usually makes money.” He encouraged bettors to seek out markets “where people are caught up in crazy and irrational predictions” if they want to profit. Loxley Fernandes, CEO at prediction market Myriad (owned by Decrypt ’s parent company Dastan), argues that Buterin’s profiting predicting that “obviously crazy things wouldn’t happen” is “the most honest endorsement of prediction markets you can get.” “When irrational sentiment and emotional extremes leak into markets, rational actors don’t just make money, they pull prices back toward reality,” he said, adding that, “That's the social function that prediction markets are designed to serve, to provide signal in the midst of noise.\" In the interview, Buterin also discussed what he sees as key issues currently affecting betting platforms like Polymarket, particularly around how oracles oracles function. These oracles are third-party services that act as bridges, connecting real world data to the blockchain. He cited an example involving a prediction market tied to the Russia—Ukraine conflict, which bet on whether the Russian army would control a specific city—in this case, Myrnohrad. The oracle for the market was anchored to maps from the Institute for the Study of War (ISW), a U.S. nonprofit research institution, which were posted on X, which defined “control” based on which army controlled the city’s train station. Polymarket has kicked off 2026 facing a new slew of regulatory actions from jurisdictions in Europe and the U.S., even as it edges its way back into the American market. \nOn Friday, both the Hungarian Supervisory Authority for Regulated Activities and the Portuguese Gaming Regulatory Authority issued bans against the prediction market, accusing it of illegal gambling activity.  \n\"The website is not authorized to offer betting in Portugal, and under national law, betting on political events or ha... After the institute’s X account was hacked, its maps were suddenly updated to show Russian troops controlling the train station. The offending information was then removed the next day, according to an apology from the Institute. The exact volume of payouts was not officially disclosed, but Ukrainian local media reported that some bettors may have had payouts over 33,000%, with trading volume of roughly $1.3 million. Buterin highlighted cases like this as evidence that prediction market oracles have “far too low security” standards. A trader on prediction market Polymarket struck gold, turning $3,000 into $125,000 by successfully guessing who would be the most Google-searched person in 2025.\nTheir 3,872% profit came about because the market's outcome was a big surprise. Leading into the results being revealed, Pope Leo XIV was the most likely to be the most Google-searched person this year, with 51.5% odds, followed by Donald Trump with 9.5% odds.\nAt the same time, American singer D4vd had just a 7.2% likelihood of being cr... “They never imagined that a single message they posted would determine the ownership of $1 million on the blockchain,” he told Foresight . Buterin proposed multiple approaches to addressing oracle issues. The first, which he described as a centralized model, would involve trusting a reputable news provider such as Bloomberg to supply data. The second approach involves token-based voting systems, such as those used by UMA. “A reliable oracle is very important because almost every DeFi project now requires one,” Buterin said. “If you want to develop r"
    },
    {
      "title": "The Biggest Games Releasing in February 2026",
      "source": "Decrypt",
      "summary": "Some of the data collected by this provider is for the purposes of personalization and measuring advertising effectiveness. Some of the data collected by this provider is for the purposes of personalization and measuring advertising effectiveness. The Biggest Games Releasing in February 2026 This month, Japanese games are dominating the charts, with games coming from most of the most-beloved publishers, including Nintendo, Enix, Capcom, Tecmo, RGG Studio, and Grasshopper Manufacture. In addition to these notable games arriving, this month will also see the arrival of High On Life 2, the PS5 release of Avowed, the Switch 2 release of PGA Tour 2K25, Tokyo Xtreme Racer, and more. Release Date: February 5 Platforms: PC (Steam/Microsoft Store), PlayStation 5, Xbox Series X/S, Nintendo Switch, Nintendo Switch 2 There was a time when Japanese RPGs dominated the gaming landscape, and Dragon Quest is one of the grand grandfathers of the genre. Dragon Quest VII Reimagined brings the 2000 PlayStation game into the present with gorgeously updated visuals and mechanics, including a revamped vocation system. The story has also been streamlined to make it easier to play through and understand. Release Date: February 6, 2026 Platforms: PC (Steam), PlayStation 5 Nioh 3 brings some significant new features to the series. You can now play through Samurai or Ninja paths, and you'll be able to navigate non-linear open areas for deeper exploration and more organic combat encounters. Three-player co-op is back, and if you like the demo, good news—your save carries over.",
      "full_text": "Some of the data collected by this provider is for the purposes of personalization and measuring advertising effectiveness. Some of the data collected by this provider is for the purposes of personalization and measuring advertising effectiveness. The Biggest Games Releasing in February 2026 This month, Japanese games are dominating the charts, with games coming from most of the most-beloved publishers, including Nintendo, Enix, Capcom, Tecmo, RGG Studio, and Grasshopper Manufacture. In addition to these notable games arriving, this month will also see the arrival of High On Life 2, the PS5 release of Avowed, the Switch 2 release of PGA Tour 2K25, Tokyo Xtreme Racer, and more. Release Date: February 5 Platforms: PC (Steam/Microsoft Store), PlayStation 5, Xbox Series X/S, Nintendo Switch, Nintendo Switch 2 There was a time when Japanese RPGs dominated the gaming landscape, and Dragon Quest is one of the grand grandfathers of the genre. Dragon Quest VII Reimagined brings the 2000 PlayStation game into the present with gorgeously updated visuals and mechanics, including a revamped vocation system. The story has also been streamlined to make it easier to play through and understand. Release Date: February 6, 2026 Platforms: PC (Steam), PlayStation 5 Nioh 3 brings some significant new features to the series. You can now play through Samurai or Ninja paths, and you'll be able to navigate non-linear open areas for deeper exploration and more organic combat encounters. Three-player co-op is back, and if you like the demo, good news—your save carries over. Release Date: February 10, 2026 Platforms: PC (Steam) Mewgenics, the newest game from The Binding of Isaac creator Edmund McMillen, has been in the works for a long time. In Mewgenics, your goal is to breed the ultimate cat. You'll send your cats on turn-based adventures, in search of the best of the best cats. Release Date: February 11, 2026 Platforms: PC, PlayStation 5, Xbox Series X/S After being killed by the shattering of space-time, Romeo Stargazer is revived as a special agent for the FBI's Space-Time Police division. This is a third-person, hyper-violent, single-player action game from Grasshopper Manufacture, directed by Suda Goichi (better known as Suda51). Having Suda51 in charge means we'll get a weird game for sure. The art style looks like something really special, too, making this one worth a look. Release Date: February 12, 2026 Platforms: Nintendo Switch 2 The Switch 2’s library is still finding its footing, and Nintendo’s latest first-party swing comes with Mario Tennis Fever, a Switch 2 exclusive that adds a flashy new twist to the series. The headline feature is Fever Rackets, which let players unleash special moves that can dramatically shift a match's momentum. Alongside the usual competitive modes, the game also includes an adventure mode, giving solo players more to dig into. Visually and tonally, Mario Tennis Fever borrows heavily from Super Mario Bros. Right down to a talking flower that offers running commentary and a court set in the Wonder world, the game comes complete with familiar reality-bending effects. The roster includes 38 playable characters and 30 different Fever Rackets, each with unique abilities, adding a layer of strategy on top of the series’ traditionally accessible gameplay. Release Date: February 12, 2026 Platforms: PC, PS4, PlayStation 5, Xbox Series X/S, Nintendo Switch 2 Yakuza Kiwami 3 is the latest game in the long-running series to get a modernized update. This similarly updates the visuals and gameplay. In addition to updating the original game, which is set in Tokyo and Okinawa, the game also includes Dark Ties, a side-story game featuring Yakuza 3 character Yoshitaka Mine, exploring how he becomes the character we meet in the main game. Release Date: February 27, 2026 Platforms: PC (Steam/Epic), PlayStation 5, Xbox Series X/S, Nintendo Switch 2 It's winter (at least in the Northern hemisphere), and that means it's time for a new Capcom game. In Resident Evil Requiem, you'll split your gameplay between FBI Analyst Grace Ashcroft and Action Movie Himbo Leon S. Kennedy. Kennedy's segments will be the kind of survival-horror action you've come to expect from him, as seen in games like Resident Evil 4. Meanwhile, Grace is not a strong character and isn't as well-trained with weapons as Leon is. Instead, she'll be trapped in an abandoned hotel, evading dangers by hiding and running for her life, bringing us back to the incredible horror sensations of the early hours of Resident Evil 7, where I definitely didn't pause the game and walk away for four hours because I could hear my character's Not-Wife breathing ominously from a pitch-black door into a basement. Brave is betting that the future of Web3 gaming adoption will look less like DeFi dashboards and more like a reality-TV heist show that plays out across social media.\nThe company behind the privacy-focused browser announced the Brave Games on Tuesday, as a mult"
    }
  ]
}