{
  "collected_at": "2026-01-30T21:20:48.933683+00:00",
  "total_articles": 38,
  "time_window_days": 2,
  "articles": [
    {
      "title": "India Budget 2026: Data Shows Crypto Traders Paid Tax Even After Losses",
      "source": "Coinpedia",
      "summary": "Log in to access your notifications and stay updated. If you’re not a member yet, Sign Up to get started! Writer by choice, CryptoCurrency Writer, and Researcher by chance. Currently, focusing on financial news and analysis, as well as cryptocurrency news and data. One may not call me a crypto “Enthusiast” but trust me I'm getting there. As the Union Budget 2026 approaches, India’s crypto tax regime is facing renewed scrutiny after fresh data showed that nearly half of crypto investors ended FY25 with losses, yet many still paid taxes due to the structure of capital gains rules and transaction-level deductions. A new report by KoinX, titled India’s Crypto Tax Story 2025, shows what it describes as a widening disconnect between actual trading outcomes and tax liabilities in the virtual digital assets (VDA) market. The report is based on anonymised data from nearly 7 lakh Indian crypto users who traded during FY 2024–25. It shows investor outcomes were almost evenly split: Despite this balance, investors who finished the year in losses still faced tax bills. According to the data, users who incurred net capital losses of ₹1,178 crore still paid tax on ₹180 crore of taxable gains, as current rules do not allow crypto losses to be offset against gains.",
      "full_text": "Log in to access your notifications and stay updated. If you’re not a member yet, Sign Up to get started! Writer by choice, CryptoCurrency Writer, and Researcher by chance.  Currently, focusing on financial news and analysis, as well as cryptocurrency news and data. One may not call me a crypto “Enthusiast” but trust me I'm getting there. As the Union Budget 2026 approaches, India’s crypto tax regime is facing renewed scrutiny after fresh data showed that nearly half of crypto investors ended FY25 with losses, yet many still paid taxes due to the structure of capital gains rules and transaction-level deductions. A new report by KoinX, titled India’s Crypto Tax Story 2025, shows what it describes as a widening disconnect between actual trading outcomes and tax liabilities in the virtual digital assets (VDA) market. The report is based on anonymised data from nearly 7 lakh Indian crypto users who traded during FY 2024–25. It shows investor outcomes were almost evenly split: Despite this balance, investors who finished the year in losses still faced tax bills. According to the data, users who incurred net capital losses of ₹1,178 crore still paid tax on ₹180 crore of taxable gains, as current rules do not allow crypto losses to be offset against gains. This also differs from the treatment of most other asset classes, where capital gains tax is applied to net profits, not isolated trades. The report also analysed the impact of the 1% tax deducted at source (TDS) levied on crypto transactions. While the measure has strengthened transaction-level reporting and compliance, it has also led to significant capital lock-in, particularly for high-frequency traders. Key findings for FY 2024–25 include: More than 30% of users had TDS deducted in excess of their final tax liability, making refunds a routine outcome rather than an exception. Nearly half of all TDS-paying users still ended the year with net losses, according to the report. The data also points to a sharp concentration in trading activity. Less than 5% of traders accounted for 87% of total TDS collections, reflecting the outsized role of active traders who typically operate on thin margins. Analysts say repeated upfront deductions reduce liquidity, widen bid-ask spreads, and raise trading costs, especially during periods of market volatility. With Budget 2026 approaching, industry observers say the findings add pressure on policymakers to revisit crypto taxation. Expectations centre on rationalisation rather than expansion, including possible changes to the TDS rate, thresholds, or rules around loss offsets. The broader policy question remains whether India’s crypto tax framework should continue to prioritise transaction visibility, or evolve toward a system that better reflects net economic outcomes. CoinPedia has been delivering accurate and timely cryptocurrency and blockchain updates since 2017. All content is created by our expert panel of analysts and journalists, following strict Editorial Guidelines based on E-E-A-T (Experience, Expertise, Authoritativeness, Trustworthiness). Every article is fact-checked against reputable sources to ensure accuracy, transparency, and reliability. Our review policy guarantees unbiased evaluations when recommending exchanges, platforms, or tools. We strive to provide timely updates about everything crypto & blockchain, right from startups to industry majors. All opinions and insights shared represent the author's own views on current market conditions. Please do your own research before making investment decisions. Neither the writer nor the publication assumes responsibility for your financial choices. Sponsored content and affiliate links may appear on our site. Advertisements are marked clearly, and our editorial content remains entirely independent from our ad partners. Search keywords to find relevant companies. Search keywords to find relevant market exchanges."
    },
    {
      "title": "Ethereum Price Breakdown Ignites Fresh Bear Fears Across Crypto",
      "source": "Coinpedia",
      "summary": "Log in to access your notifications and stay updated. If you’re not a member yet, Sign Up to get started! Zameer is a financial analyst and writer with a particular interest in cryptocurrency markets. He has been studying cryptocurrencies and their market behavior for several years and deeply understands the factors that affect the price of cryptocurrencies. His expertise lies in his ability to use both technical and fundamental analysis to make informed predictions about the future direction of cryptocurrency prices. He has a strong understanding of market sentiment and uses this to inform his trading decisions and price predictions. Nidhi is a Certified Digital Marketing Executive and Passionate crypto Journalist covering the world of alternative currencies. She shares the latest and trending news on Cryptocurrency and Blockchain. Ethereum slips below $2,700 as selling pressure builds. Peter Brandt warns a triangle breakdown could trigger deeper losses across the crypto market.",
      "full_text": "Log in to access your notifications and stay updated. If you’re not a member yet, Sign Up to get started! Zameer is a financial analyst and writer with a particular interest in cryptocurrency markets. He has been studying cryptocurrencies and their market behavior for several years and deeply understands the factors that affect the price of cryptocurrencies.  His expertise lies in his ability to use both technical and fundamental analysis to make informed predictions about the future direction of cryptocurrency prices. He has a strong understanding of market sentiment and uses this to inform his trading decisions and price predictions. Nidhi is a Certified Digital Marketing Executive and Passionate crypto Journalist covering the world of alternative currencies. She shares the latest and trending news on Cryptocurrency and Blockchain. Ethereum slips below $2,700 as selling pressure builds. Peter Brandt warns a triangle breakdown could trigger deeper losses across the crypto market. ETH ETF outflows, weak liquidity, and risk-off sentiment weigh on prices, keeping Ethereum stuck in a fragile range as volatility remains elevated. Ethereum is facing renewed downside pressure after breaking below the $2,700 level, reigniting concerns over a deeper correction. The second-largest cryptocurrency has now lost more than 7% in a single day and is down over 40% from recent highs, reflecting a broader shift toward risk-off sentiment across crypto markets. Market liquidity remains thin, institutional demand is weakening, and selling pressure continues to dominate short-term price action, setting the stage for heightened volatility. Veteran trader Peter Brandt has added to the cautious outlook, warning that Ethereum’s recent technical breakdown could lead to further losses. Sharing chart analysis, Brandt pointed to a completed symmetrical triangle breakdown on Ethereum’s price chart, a pattern typically associated with bearish continuation. Beyond ETH itself, Brandt also highlighted weakness across the broader crypto market. His analysis of total crypto market capitalization shows a drop to key support near $2.82 trillion. A sustained failure at this level, he warned, could drag total market value toward $2.41 trillion, implying a potential 15–20% market-wide decline that could pressure major assets including Bitcoin, Ethereum, and XRP . Institutional sentiment around Ethereum remains fragile, as reflected in continued outflows from spot Ethereum ETFs. On Thursday alone, ETH ETFs recorded nearly $156 million in net redemptions, led by Fidelity and BlackRock products. Grayscale’s Ethereum funds also saw notable withdrawals. These outflows suggest that large investors are still de-risking, reinforcing Brandt’s view that Ethereum’s weakness is tied more to liquidity stress and capital rotation than isolated technical issues. Adding another layer to the narrative, Ethereum co-founder Vitalik Buterin recently withdrew 16,384 ETH . While such movements often raise short-term market concerns, Buterin clarified that the funds are intended to support Ethereum’s long-term development and sustainability. According to Buterin, the ETH will help fund an aggressive roadmap focused on scalability, decentralization, and security, while also supporting the Ethereum Foundation’s core mission. He has also signaled interest in improving decentralized staking structures to better align rewards with Ethereum’s long-term goals. Ethereum’s price action continues to reflect a market stuck in limbo rather than one gearing up for a decisive move. Analysts note that ETH has been locked in a broad, well-defined range between roughly $2,600 and $3,350 for the past two months, with no clear trend emerging on higher timeframes. This prolonged consolidation has created what some describe as a forced equilibrium, where neither bulls nor bears have enough conviction to take control. Without a clean breakout above resistance or a confirmed breakdown below support, recent price swings are viewed as short-term liquidity rotations rather than the start of a new cycle. For now, Ethereum remains in a macro stalemate, trading around $2,798 and down about 5% on the week, as the market continues to wait for a decisive signal. Stay ahead with breaking news, expert analysis, and real-time updates on the latest trends in Bitcoin, altcoins, DeFi, NFTs, and more. Ethereum is dropping due to weak liquidity, ETF outflows, and a broader risk-off mood, not because of a fundamental breakdown in the network. ETF outflows signal institutional de-risking, which adds selling pressure and often amplifies short-term price volatility in Ethereum. ETH is holding a range between roughly $2,600 and $3,350. A clear break below support or above resistance may set the next trend. CoinPedia has been delivering accurate and timely cryptocurrency and blockchain updates since 2017. All content is created by our expert panel of analysts and journalists, following strict Editorial Guidelines ba"
    },
    {
      "title": "Why Bitcoin Is Falling Despite Progress on a US Government Shutdown Deal",
      "source": "Coinpedia",
      "summary": "Log in to access your notifications and stay updated. If you’re not a member yet, Sign Up to get started! Fun-loving and cheerful, a passionate blockchain and crypto writer who knows no boundary…connect if you share the same passion. With 10+ years of writing experience, I am a Crypto Journalist by chance, exploring, and learning all the dynamics of the sci-fi action-filled crypto world. Currently, focusing on cryptocurrency news and price data. With a passion for research and challenging my capabilities, I am slowly getting into the crypto arena to bring new insights every day. Nidhi is a Certified Digital Marketing Executive and Passionate crypto Journalist covering the world of alternative currencies. She shares the latest and trending news on Cryptocurrency and Blockchain. Crypto markets slide as Bitcoin drops to the low $80K range, even as US lawmakers near a deal to avert a government shutdown amid tightening liquidity. Bitcoin ETF outflows near $1B as Treasury liquidity drains markets, with political uncertainty and geopolitics keeping risk assets volatile.",
      "full_text": "Log in to access your notifications and stay updated. If you’re not a member yet, Sign Up to get started! Fun-loving and cheerful, a passionate blockchain and crypto writer who knows no boundary…connect if you share the same passion.  With 10+ years of writing experience, I am a Crypto Journalist by chance, exploring, and learning all the dynamics of the sci-fi action-filled crypto world. Currently, focusing on cryptocurrency news and price data. With a passion for research and challenging my capabilities, I am slowly getting into the crypto arena to bring new insights every day. Nidhi is a Certified Digital Marketing Executive and Passionate crypto Journalist covering the world of alternative currencies. She shares the latest and trending news on Cryptocurrency and Blockchain. Crypto markets slide as Bitcoin drops to the low $80K range, even as US lawmakers near a deal to avert a government shutdown amid tightening liquidity. Bitcoin ETF outflows near $1B as Treasury liquidity drains markets, with political uncertainty and geopolitics keeping risk assets volatile. While the crypto market is sinking to its lowest today, the US lawmakers and the White House are moving closer to a deal to avert a partial government shutdown , offering a measure of relief to markets after a turbulent week. Senate leaders confirmed that a bipartisan framework is in place, though the agreement still requires key congressional votes before the current funding deadline expires on Friday night. President Donald Trump said negotiations with Congress are progressing, warning that another prolonged shutdown would be harmful to the economy. While his remarks eased some immediate concerns, investors remain cautious as the legislative process enters its final and most uncertain stage. The political uncertainty has coincided with mounting pressure across risk assets, particularly in crypto markets. Bitcoin slipped into the low $80,000 range this week, while US spot Bitcoin and Ethereum ETFs have seen nearly $1 billion in net outflows. Market participants say the weakness reflects tightening liquidity rather than a breakdown in confidence toward digital assets. Analysts point to the rapid expansion of the US Treasury’s cash balance, which has drained liquidity from financial markets. When the Treasury General Account rises, risk assets typically come under stress, with crypto often reacting first. On-chain data shows large Bitcoin holders remain mostly inactive, supporting the view that recent selling is driven by macro liquidity conditions rather than fear. Traditional markets have also experienced sharp moves. Gold and silver, which rallied earlier this year on safe-haven demand, pulled back as investors adjusted positions. Silver has entered deeper correction territory, while gold briefly dipped below key psychological levels before stabilizing. Geopolitical tensions have further complicated the outlook. Renewed foreign policy uncertainty, including heightened rhetoric around Iran, has added to market unease and contributed to short-term volatility across commodities and currencies. Even if lawmakers succeed in passing a funding bill, analysts caution that uncertainty is unlikely to fade quickly. Historically, government shutdown risks tend to increase volatility rather than set a clear market direction, particularly for Bitcoin. With liquidity conditions tightening and geopolitical risks elevated, both traditional and digital asset markets remain highly sensitive to political and macroeconomic developments. Stay ahead with breaking news, expert analysis, and real-time updates on the latest trends in Bitcoin, altcoins, DeFi, NFTs, and more. Crypto is under pressure mainly due to tightening U.S. liquidity, ETF outflows, and broader risk-off sentiment, not a loss of confidence in Bitcoin itself. Shutdown risks increase uncertainty and volatility. Crypto often reacts early as liquidity tightens, even if the final outcome avoids a shutdown. No. On-chain data shows large holders are mostly inactive, suggesting the move is liquidity-driven rather than fear-based selling. A deal may ease short-term stress, but volatility can persist as liquidity conditions and geopolitical risks remain unresolved. CoinPedia has been delivering accurate and timely cryptocurrency and blockchain updates since 2017. All content is created by our expert panel of analysts and journalists, following strict Editorial Guidelines based on E-E-A-T (Experience, Expertise, Authoritativeness, Trustworthiness). Every article is fact-checked against reputable sources to ensure accuracy, transparency, and reliability. Our review policy guarantees unbiased evaluations when recommending exchanges, platforms, or tools. We strive to provide timely updates about everything crypto & blockchain, right from startups to industry majors. All opinions and insights shared represent the author's own views on current market conditions. Please do your own research before making investment de"
    },
    {
      "title": "XRP Leader Says Whale Manipulation Won’t Decide Crypto’s Long-Term Future",
      "source": "Coinpedia",
      "summary": "Log in to access your notifications and stay updated. If you’re not a member yet, Sign Up to get started! Writer by choice, CryptoCurrency Writer, and Researcher by chance. Currently, focusing on financial news and analysis, as well as cryptocurrency news and data. One may not call me a crypto “Enthusiast” but trust me I'm getting there. A senior executive at Ripple has said that expectations for XRP reaching $100 should be viewed with caution, arguing that large price jumps become less likely as crypto assets mature. David Schwartz, made the comments while responding to questions from XRP holders comparing XRP’s future price potential with Bitcoin’s early rise. Schwartz said the probability of XRP reaching $100 depends less on the number itself and more on the size of the price increase required. He explained that a 10-times move in XRP today is about as unlikely as a similar 10-times move in Bitcoin or Ethereum at their current sizes. According to Schwartz, as crypto assets grow larger and more established, achieving large multiples becomes increasingly difficult.",
      "full_text": "Log in to access your notifications and stay updated. If you’re not a member yet, Sign Up to get started! Writer by choice, CryptoCurrency Writer, and Researcher by chance.  Currently, focusing on financial news and analysis, as well as cryptocurrency news and data. One may not call me a crypto “Enthusiast” but trust me I'm getting there. A senior executive at Ripple has said that expectations for XRP reaching $100 should be viewed with caution, arguing that large price jumps become less likely as crypto assets mature. David Schwartz, made the comments while responding to questions from XRP holders comparing XRP’s future price potential with Bitcoin’s early rise. Schwartz said the probability of XRP reaching $100 depends less on the number itself and more on the size of the price increase required. He explained that a 10-times move in XRP today is about as unlikely as a similar 10-times move in Bitcoin or Ethereum at their current sizes. According to Schwartz, as crypto assets grow larger and more established, achieving large multiples becomes increasingly difficult. Schwartz said crypto markets are generally rational over the long term, even if individual traders are not. He argued that enough well-funded and rational participants exist to create effective price ceilings and floors. In his view, the current prices of major cryptocurrencies already reflect a market-wide estimate of their future value, adjusted for the likelihood of those outcomes. Addressing concerns about whale manipulation, Schwartz said short-term price moves can sometimes be influenced, particularly in smaller markets. However, he said he does not believe manipulation can sustainably control long-term price trends in major cryptocurrencies such as XRP. He acknowledged that this view is not widely shared and added that he does not have definitive evidence to settle the debate, noting that many investors believe manipulation plays a larger role. “While I do thing some crypto markets are sometimes manipulated, I cannot get myself to believe that this could affect long-term prices and price trends. But I will admit that I don’t really have good evidence to support this view and many others believe otherwise,” he said. CoinPedia has been delivering accurate and timely cryptocurrency and blockchain updates since 2017. All content is created by our expert panel of analysts and journalists, following strict Editorial Guidelines based on E-E-A-T (Experience, Expertise, Authoritativeness, Trustworthiness). Every article is fact-checked against reputable sources to ensure accuracy, transparency, and reliability. Our review policy guarantees unbiased evaluations when recommending exchanges, platforms, or tools. We strive to provide timely updates about everything crypto & blockchain, right from startups to industry majors. All opinions and insights shared represent the author's own views on current market conditions. Please do your own research before making investment decisions. Neither the writer nor the publication assumes responsibility for your financial choices. Sponsored content and affiliate links may appear on our site. Advertisements are marked clearly, and our editorial content remains entirely independent from our ad partners. Search keywords to find relevant companies. Search keywords to find relevant market exchanges."
    },
    {
      "title": "Market Crash Alert: $6.5 Trillion Erased Across Crypto, Metals and Equities",
      "source": "Coinpedia",
      "summary": "Log in to access your notifications and stay updated. If you’re not a member yet, Sign Up to get started! Writer by choice, CryptoCurrency Writer, and Researcher by chance. Currently, focusing on financial news and analysis, as well as cryptocurrency news and data. One may not call me a crypto “Enthusiast” but trust me I'm getting there. Global markets were hit by a sudden and violent sell-off, with more than $6.5 trillion erased across metals, equities, and cryptocurrencies in just 24 hours, triggering one of the most chaotic trading sessions in recent years. Precious metals led to the collapse. Gold plunged nearly 11%, wiping out about $4.1 trillion in value, while silver crashed more than 21%, erasing $1.4 trillion. Other industrial and precious metals were also hit hard, with copper, palladium, and platinum suffering double-digit losses as prices fell sharply within hours. U.S. stock markets did not escape the turmoil.",
      "full_text": "Log in to access your notifications and stay updated. If you’re not a member yet, Sign Up to get started! Writer by choice, CryptoCurrency Writer, and Researcher by chance.  Currently, focusing on financial news and analysis, as well as cryptocurrency news and data. One may not call me a crypto “Enthusiast” but trust me I'm getting there. Global markets were hit by a sudden and violent sell-off, with more than $6.5 trillion erased across metals, equities, and cryptocurrencies in just 24 hours, triggering one of the most chaotic trading sessions in recent years. Precious metals led to the collapse. Gold plunged nearly 11%, wiping out about $4.1 trillion in value, while silver crashed more than 21%, erasing $1.4 trillion. Other industrial and precious metals were also hit hard, with copper, palladium, and platinum suffering double-digit losses as prices fell sharply within hours. U.S. stock markets did not escape the turmoil. The S&P 500, Nasdaq, and Russell 2000 all turned lower, collectively losing hundreds of billions of dollars in market value. Technology stocks were under particular pressure after Microsoft shares sank around 11% in a single day, dragging major indices lower and shaking investor confidence. Crypto markets followed the broader risk-off move. Bitcoin fell about 6–7%, erasing more than $100 billion, while Ethereum dropped over 7%, as forced liquidations hit leveraged traders. Analysts noted that once prices started falling, automatic sell orders and margin calls accelerated the decline. Experts say the crash was not driven by one clear headline or policy shock. Instead, several factors came together at once: excessive leverage, heavy profit-taking after a massive multi-year rally in metals, weakness in large tech stocks, and extreme overbought conditions that left markets vulnerable. When prices began to slip, the selling quickly snowballed into a broad deleveraging event. In short, this was a classic unwind. After months of strong gains and crowded trades across assets, one small trigger was enough to break the momentum, sending prices sharply lower across almost everything at the same time. CoinPedia has been delivering accurate and timely cryptocurrency and blockchain updates since 2017. All content is created by our expert panel of analysts and journalists, following strict Editorial Guidelines based on E-E-A-T (Experience, Expertise, Authoritativeness, Trustworthiness). Every article is fact-checked against reputable sources to ensure accuracy, transparency, and reliability. Our review policy guarantees unbiased evaluations when recommending exchanges, platforms, or tools. We strive to provide timely updates about everything crypto & blockchain, right from startups to industry majors. All opinions and insights shared represent the author's own views on current market conditions. Please do your own research before making investment decisions. Neither the writer nor the publication assumes responsibility for your financial choices. Sponsored content and affiliate links may appear on our site. Advertisements are marked clearly, and our editorial content remains entirely independent from our ad partners. Search keywords to find relevant companies. Search keywords to find relevant market exchanges."
    },
    {
      "title": "Hong Kong Begins Stablecoin Licensing in Major Crypto Push",
      "source": "Coinpedia",
      "summary": "Log in to access your notifications and stay updated. If you’re not a member yet, Sign Up to get started! Zafar is a seasoned crypto and blockchain news writer with four years of experience. Known for accuracy, in-depth analysis, and a clear, engaging style, Zafar actively participates in blockchain communities. Beyond writing, Zafar enjoys trading and exploring the latest trends in the crypto market. Hong Kong has begun reviewing stablecoin license applications as its new crypto rules move into action. Regulators confirmed broader virtual asset regulations are coming. The move signals Hong Kong’s push to cement itself as a regulated crypto hub in Asia. Hong Kong’s stablecoin licensing regime is now live and processing applications . Christopher Hui, Secretary for Financial Services and the Treasury, confirmed today that the Hong Kong Monetary Authority (HKMA) is reviewing license applications under the Stablecoin Ordinance.",
      "full_text": "Log in to access your notifications and stay updated. If you’re not a member yet, Sign Up to get started! Zafar is a seasoned crypto and blockchain news writer with four years of experience. Known for accuracy, in-depth analysis, and a clear, engaging style, Zafar actively participates in blockchain communities. Beyond writing, Zafar enjoys trading and exploring the latest trends in the crypto market. Hong Kong has begun reviewing stablecoin license applications as its new crypto rules move into action. Regulators confirmed broader virtual asset regulations are coming. The move signals Hong Kong’s push to cement itself as a regulated crypto hub in Asia. Hong Kong’s stablecoin licensing regime is now live and processing applications . Christopher Hui, Secretary for Financial Services and the Treasury, confirmed today that the Hong Kong Monetary Authority (HKMA) is reviewing license applications under the Stablecoin Ordinance. Hui made the announcement at a Legislative Council Finance Committee policy briefing on January 30. He also revealed that a full regulatory framework for virtual assets will be submitted to the legislature this year. The Stablecoin Ordinance came into effect in August 2024. It introduced a licensing system for fiat-denominated stablecoin issuers in Hong Kong. The HKMA is now actively reviewing applications from issuers looking to operate legally in the city. This makes Hong Kong one of the few major financial hubs with a clear stablecoin licensing path. Stablecoins are just one piece. Hui confirmed that Hong Kong will submit a draft ordinance covering virtual asset trading platforms, custody providers, advisory services, and asset management providers to the Legislative Council in 2026. The Financial Services and Treasury Bureau (FSTB) and Securities and Futures Commission (SFC) wrapped up their consultation on trading and custody rules in December. A separate consultation on advisory and management services is still ongoing. Hong Kong is also preparing to implement the OECD’s Crypto-Asset Reporting Framework (CARF). Starting in 2028, the city will automatically exchange crypto transaction tax data with other jurisdictions. Public comments on the legislative proposals are currently being collected. The regulatory push comes as Hong Kong works to strengthen its role as an international financial center under China’s 15th Five-Year Plan. For crypto firms watching Asia, the city just made its intentions clear. CoinPedia has been delivering accurate and timely cryptocurrency and blockchain updates since 2017. All content is created by our expert panel of analysts and journalists, following strict Editorial Guidelines based on E-E-A-T (Experience, Expertise, Authoritativeness, Trustworthiness). Every article is fact-checked against reputable sources to ensure accuracy, transparency, and reliability. Our review policy guarantees unbiased evaluations when recommending exchanges, platforms, or tools. We strive to provide timely updates about everything crypto & blockchain, right from startups to industry majors. All opinions and insights shared represent the author's own views on current market conditions. Please do your own research before making investment decisions. Neither the writer nor the publication assumes responsibility for your financial choices. Sponsored content and affiliate links may appear on our site. Advertisements are marked clearly, and our editorial content remains entirely independent from our ad partners. Search keywords to find relevant companies. Search keywords to find relevant market exchanges."
    },
    {
      "title": "Will BTC, ETH and XRP Rally As Trump Formally Nominates Kevin Warsh as Fed Chair?",
      "source": "Coinpedia",
      "summary": "Log in to access your notifications and stay updated. If you’re not a member yet, Sign Up to get started! Writer by choice, CryptoCurrency Writer, and Researcher by chance. Currently, focusing on financial news and analysis, as well as cryptocurrency news and data. One may not call me a crypto “Enthusiast” but trust me I'm getting there. Qadir Ak is the founder of Coinpedia. He has over a decade of experience writing about technology and has been covering the blockchain and cryptocurrency space since 2010. He has also interviewed a few prominent experts within the cryptocurrency space. Donald Trump officially nominates former Fed governor Kevin Warsh as Federal Reserve chair, ending weeks of speculation over who would replace Jerome Powell. Seen as a crypto-friendly pick, Kevin Warsh’s Fed nomination could help stabilise market sentiment amid pressure on Bitcoin, Ethereum and XRP.",
      "full_text": "Log in to access your notifications and stay updated. If you’re not a member yet, Sign Up to get started! Writer by choice, CryptoCurrency Writer, and Researcher by chance.  Currently, focusing on financial news and analysis, as well as cryptocurrency news and data. One may not call me a crypto “Enthusiast” but trust me I'm getting there. Qadir Ak is the founder of Coinpedia. He has over a decade of experience writing about technology and has been covering the blockchain and cryptocurrency space since 2010. He has also interviewed a few prominent experts within the cryptocurrency space. Donald Trump officially nominates former Fed governor Kevin Warsh as Federal Reserve chair, ending weeks of speculation over who would replace Jerome Powell. Seen as a crypto-friendly pick, Kevin Warsh’s Fed nomination could help stabilise market sentiment amid pressure on Bitcoin, Ethereum and XRP. President Donald Trump on Friday formally announced the nomination of former Federal Reserve governor Kevin Warsh as chairman of the Board of Governors of the Federal Reserve System, confirming weeks of speculation over who would succeed Jerome Powell. “I am pleased to announce that I am nominating Kevin Warsh to be the Chairman of the Board of Governors of the Federal Reserve System,” Trump said in a statement, praising Warsh’s experience, credentials, and long-standing ties to economic policymaking. The nomination is subject to confirmation by the U.S. Senate. In his announcement, Trump opened up about Warsh’s deep academic and professional background. Warsh currently serves as the Shepard Family Distinguished Visiting Fellow in Economics at Stanford University’s Hoover Institution and lectures at the Stanford Graduate School of Business. He is also a partner at Duquesne Family Office, working alongside investor Stanley Druckenmiller. Warsh earned his undergraduate degree from Stanford University and a law degree from Harvard Law School. Trump noted that Warsh has conducted extensive research in economics and finance and has played an influential role in shaping monetary policy debates internationally. Trump pointed to Warsh’s work with the Bank of England, where he authored an independent report proposing reforms to the UK’s monetary policy framework. Those recommendations were later adopted by the British Parliament. Warsh became the youngest Federal Reserve governor in history at age 35, serving on the Fed’s Board of Governors from 2006 to 2011. During that period, he represented the Federal Reserve at Group of Twenty (G-20) meetings and acted as the board’s emissary to both emerging and advanced economies across Asia. He also served as the Fed’s administrative governor, overseeing internal operations, staffing, and financial performance at the central bank. Before joining the Federal Reserve, Warsh served from 2002 to 2006 as special assistant to the president for economic policy and executive secretary of the White House National Economic Council. Earlier in his career, he worked at Morgan Stanley in New York, where he held senior roles in the firm’s mergers and acquisitions division. Trump said he has known Warsh “for a long period of time” and expressed strong confidence in his leadership, calling him someone who could become “one of the great Fed chairmen, maybe the best.” According to market experts, Kevin Warsh is seen as a more crypto-friendly Fed nominee, and his nomination could act as a short-term positive signal for a market that is already under heavy pressure. Warsh’s perceived openness to markets and liquidity could help stabilise sentiment and possibly slow the bleeding in assets like Bitcoin, Ethereum, and XRP, even if it does not trigger an immediate rally. Stay ahead with breaking news, expert analysis, and real-time updates on the latest trends in Bitcoin, altcoins, DeFi, NFTs, and more. Kevin Warsh is a former Federal Reserve governor and Stanford fellow, nominated by Trump for his deep experience in monetary policy and markets. Yes. Kevin Warsh must be confirmed by the U.S. Senate before he can officially succeed Jerome Powell as chairman of the Federal Reserve. Many analysts see Warsh as more open to liquidity and market innovation, making him relatively more crypto-friendly than past Fed leadership. CoinPedia has been delivering accurate and timely cryptocurrency and blockchain updates since 2017. All content is created by our expert panel of analysts and journalists, following strict Editorial Guidelines based on E-E-A-T (Experience, Expertise, Authoritativeness, Trustworthiness). Every article is fact-checked against reputable sources to ensure accuracy, transparency, and reliability. Our review policy guarantees unbiased evaluations when recommending exchanges, platforms, or tools. We strive to provide timely updates about everything crypto & blockchain, right from startups to industry majors. All opinions and insights shared represent the author's own views on current market conditions. Please do "
    },
    {
      "title": "El Salvador Boosts Gold Reserves with $50 Million Purchase Amid Bitcoin Strategy",
      "source": "Coinpedia",
      "summary": "Log in to access your notifications and stay updated. If you’re not a member yet, Sign Up to get started! Fun-loving and cheerful, a passionate blockchain and crypto writer who knows no boundary…connect if you share the same passion. With 10+ years of writing experience, I am a Crypto Journalist by chance, exploring, and learning all the dynamics of the sci-fi action-filled crypto world. Currently, focusing on cryptocurrency news and price data. With a passion for research and challenging my capabilities, I am slowly getting into the crypto arena to bring new insights every day. Nidhi is a Certified Digital Marketing Executive and Passionate crypto Journalist covering the world of alternative currencies. She shares the latest and trending news on Cryptocurrency and Blockchain. El Salvador boosts gold reserves with $50M purchase, signaling a strategic shift while maintaining 7,547 BTC in dual reserve strategy. Amid global uncertainty, El Salvador adds gold to diversify, joining central banks and corporations in hedging with traditional and digital assets.",
      "full_text": "Log in to access your notifications and stay updated. If you’re not a member yet, Sign Up to get started! Fun-loving and cheerful, a passionate blockchain and crypto writer who knows no boundary…connect if you share the same passion.  With 10+ years of writing experience, I am a Crypto Journalist by chance, exploring, and learning all the dynamics of the sci-fi action-filled crypto world. Currently, focusing on cryptocurrency news and price data. With a passion for research and challenging my capabilities, I am slowly getting into the crypto arena to bring new insights every day. Nidhi is a Certified Digital Marketing Executive and Passionate crypto Journalist covering the world of alternative currencies. She shares the latest and trending news on Cryptocurrency and Blockchain. El Salvador boosts gold reserves with $50M purchase, signaling a strategic shift while maintaining 7,547 BTC in dual reserve strategy. Amid global uncertainty, El Salvador adds gold to diversify, joining central banks and corporations in hedging with traditional and digital assets. El Salvador has quietly joined the growing list of nations increasing their exposure to gold, announcing a $50 million purchase through its central bank. The acquisition comes at a time when gold prices remain near record highs, driven by persistent macroeconomic uncertainty, geopolitical risks, and weakening confidence in traditional financial systems. For El Salvador, the move marks a notable shift back toward a traditional reserve asset while continuing its parallel strategy of accumulating Bitcoin. In the meantime, Bitcoin falls to under $82,000, and $1.75 billion is liquidated from the crypto market in the past 24 hours. According to the Central Reserve Bank (BCR) of El Salvador, the country purchased 9,298 troy ounces of gold, valued at roughly $50 million. This is only the second gold purchase made by the central bank since 1990 and follows a similar acquisition in September 2025, when El Salvador bought 13,999 troy ounces, also worth about $50 million at the time. With the latest addition, the country’s total gold reserves now stand at 67,403 troy ounces. The BCR described gold as a “universally strategic reserve asset,” emphasizing its role in supporting long-term financial stability, protecting against structural shifts in global markets, and strengthening confidence among investors and the public. The gold purchase comes alongside El Salvador’s continued commitment to Bitcoin. According to data from the country’s Bitcoin office, El Salvador now holds 7,547 BTC, valued at approximately $635 million. This dual approach highlights a broader strategy of diversification, combining a centuries-old store of value with a modern digital asset. While Bitcoin underscores El Salvador’s image as a crypto-forward nation , gold provides a stabilizing counterbalance, particularly during periods of market stress when volatility in digital assets remains elevated. El Salvador’s move reflects a wider global trend. Gold demand has surged in 2026, with prices up nearly 20% year to date before a recent pullback. Central banks and institutions worldwide are increasingly turning to gold as a hedge against inflation, currency risk, and geopolitical instability. Poland’s central bank has outlined plans to expand its gold reserves to 700 tonnes, while China has continued to add gold aggressively, far more than official figures suggest, according to estimates cited by Goldman Sachs and The Kobeissi Letter . Beyond central banks, corporations are also increasing their exposure. Tether reportedly added around 27 tonnes of gold in late 2025 and is targeting a 10–15% allocation, while demand for tokenized gold products like XAUT and PAXG has surged, driven by large-scale on-chain purchases. Although gold dipped to around $5,176 amid heightened U.S.–Iran tensions, El Salvador’s purchase underscores a broader defensive posture. By strengthening its gold reserves while holding substantial Bitcoin, the country is positioning itself for resilience in an increasingly fragile global financial landscape. Stay ahead with breaking news, expert analysis, and real-time updates on the latest trends in Bitcoin, altcoins, DeFi, NFTs, and more. El Salvador purchased gold to diversify reserves, boost financial stability, and hedge against market volatility and global economic uncertainty. After the latest purchase, El Salvador’s gold reserves total 67,403 troy ounces, reinforcing its long-term financial security strategy. Yes, central banks worldwide use gold to hedge against inflation, currency risk, and geopolitical instability, boosting investor confidence. Gold stabilizes the reserves during market stress, while Bitcoin offers growth potential, creating a balanced, diversified national portfolio. CoinPedia has been delivering accurate and timely cryptocurrency and blockchain updates since 2017. All content is created by our expert panel of analysts and journalists, following strict Editori"
    },
    {
      "title": "Arthur Hayes Explains Why Bitcoin Is Falling Amid $300B Dollar Liquidity Drain",
      "source": "Coinpedia",
      "summary": "Log in to access your notifications and stay updated. If you’re not a member yet, Sign Up to get started! Zafar is a seasoned crypto and blockchain news writer with four years of experience. Known for accuracy, in-depth analysis, and a clear, engaging style, Zafar actively participates in blockchain communities. Beyond writing, Zafar enjoys trading and exploring the latest trends in the crypto market. Arthur Hayes says Bitcoin’s drop has less to do with crypto and more to do with what’s happening inside the U.S. financial system. A shift in government cash management is tightening dollar liquidity. As liquidity dries up, macro forces are starting to outweigh crypto-specific narratives in driving BTC’s price. Bitcoin’s recent drop has left traders searching for answers. But according to Arthur Hayes , the reason has little to do with crypto itself.",
      "full_text": "Log in to access your notifications and stay updated. If you’re not a member yet, Sign Up to get started! Zafar is a seasoned crypto and blockchain news writer with four years of experience. Known for accuracy, in-depth analysis, and a clear, engaging style, Zafar actively participates in blockchain communities. Beyond writing, Zafar enjoys trading and exploring the latest trends in the crypto market. Arthur Hayes says Bitcoin’s drop has less to do with crypto and more to do with what’s happening inside the U.S. financial system. A shift in government cash management is tightening dollar liquidity. As liquidity dries up, macro forces are starting to outweigh crypto-specific narratives in driving BTC’s price. Bitcoin’s recent drop has left traders searching for answers. But according to Arthur Hayes , the reason has little to do with crypto itself. The former BitMEX CEO says the weakness in Bitcoin is tied to something much bigger – a sharp drain in U.S. dollar liquidity happening behind the scenes. In a post on X , Hayes pointed to a sudden tightening in dollar liquidity over the past few weeks. “Roughly $300bn fall in $ liq over past few weeks driven mostly by $200bn rise in TGA, gov could be raising cash balances to fund spending in case of shutdown. $BTC falling not a surprise given the fall in $ liquidity,” he wrote. His message was clear: Bitcoin is reacting to macro conditions, not a crypto-specific problem. Hayes highlighted the role of the U.S. Treasury General Account (TGA), the government’s main cash account held at the Federal Reserve. When the Treasury increases its TGA balance, money is pulled out of the financial system. In recent weeks, the TGA has risen by around $200 billion, removing liquidity that would otherwise flow through markets. Hayes suggested the government may be building cash reserves to prepare for a possible shutdown, allowing federal spending to continue if budget talks break down. The tightening is visible in market data. The USDLIQ index, which tracks broad dollar liquidity, has fallen nearly 7% over the past six months. It dropped from highs near 11.8 million in August to around 10.88 million by late January. Bitcoin’s pullback has closely followed that trend, reinforcing the link between liquidity conditions and crypto prices. Historically, periods of rising TGA balances and shrinking liquidity have weighed on risk assets, including stocks and cryptocurrencies. When liquidity expands, those assets tend to perform better. The liquidity squeeze isn’t hitting Bitcoin alone. Reduced liquidity often leads to lower leverage, higher risk aversion, and selling across speculative assets. With futures open interest falling and capital rotating toward traditional safe havens like gold and silver, the broader message from Hayes is simple: until dollar liquidity improves, Bitcoin and other risk assets may continue to struggle. For now, macro cash flows are setting the tone. Stay ahead with breaking news, expert analysis, and real-time updates on the latest trends in Bitcoin, altcoins, DeFi, NFTs, and more. Bitcoin’s decline is linked to a sharp fall in U.S. dollar liquidity, not issues within the cryptocurrency market itself. When the Treasury increases its cash in the TGA, liquidity drains from markets, putting pressure on Bitcoin and other risk assets. Yes, historically, expansions in liquidity support risk assets like Bitcoin, potentially boosting prices and market confidence. Yes, reduced liquidity impacts stocks, crypto, and speculative assets, while capital often shifts toward safe havens like gold. CoinPedia has been delivering accurate and timely cryptocurrency and blockchain updates since 2017. All content is created by our expert panel of analysts and journalists, following strict Editorial Guidelines based on E-E-A-T (Experience, Expertise, Authoritativeness, Trustworthiness). Every article is fact-checked against reputable sources to ensure accuracy, transparency, and reliability. Our review policy guarantees unbiased evaluations when recommending exchanges, platforms, or tools. We strive to provide timely updates about everything crypto & blockchain, right from startups to industry majors. All opinions and insights shared represent the author's own views on current market conditions. Please do your own research before making investment decisions. Neither the writer nor the publication assumes responsibility for your financial choices. Sponsored content and affiliate links may appear on our site. Advertisements are marked clearly, and our editorial content remains entirely independent from our ad partners. Search keywords to find relevant companies. Search keywords to find relevant market exchanges."
    },
    {
      "title": "Binance Plans Major Expansion in South Korea After GoFi Repayments in 2026",
      "source": "Coinpedia",
      "summary": "Log in to access your notifications and stay updated. If you’re not a member yet, Sign Up to get started! Nidhi is a Certified Digital Marketing Executive and Passionate crypto Journalist covering the world of alternative currencies. She shares the latest and trending news on Cryptocurrency and Blockchain. Binance to repay GoFi users in 2026, clearing the path to expand in South Korea and challenge top exchanges like Upbit and Bithumb. Post-repayment, Binance plans to upgrade Gopax, focus on stablecoins, RWAs, and institutional crypto, while navigating Korean regulations. Binance is laying the groundwork for a serious push into South Korea, with plans to fully repay GoFi users in 2026 and then challenge the country’s dominant crypto exchanges. Speaking to The Block, Binance APAC head SB Seker said resolving the long-running GoFi restitution issue is the company’s top priority and a necessary step before scaling operations in the market. The repayment effort stems from Binance’s 2023 acquisition of Gopax , a South Korean exchange hit hard by the collapse of Genesis Global Capital. That move allowed Binance to re-enter the Korean market, though regulatory approvals slowed progress until late last year.",
      "full_text": "Log in to access your notifications and stay updated. If you’re not a member yet, Sign Up to get started! Nidhi is a Certified Digital Marketing Executive and Passionate crypto Journalist covering the world of alternative currencies. She shares the latest and trending news on Cryptocurrency and Blockchain. Binance to repay GoFi users in 2026, clearing the path to expand in South Korea and challenge top exchanges like Upbit and Bithumb. Post-repayment, Binance plans to upgrade Gopax, focus on stablecoins, RWAs, and institutional crypto, while navigating Korean regulations. Binance is laying the groundwork for a serious push into South Korea, with plans to fully repay GoFi users in 2026 and then challenge the country’s dominant crypto exchanges. Speaking to The Block, Binance APAC head SB Seker said resolving the long-running GoFi restitution issue is the company’s top priority and a necessary step before scaling operations in the market. The repayment effort stems from Binance’s 2023 acquisition of Gopax , a South Korean exchange hit hard by the collapse of Genesis Global Capital. That move allowed Binance to re-enter the Korean market, though regulatory approvals slowed progress until late last year. GoFi, a DeFi product operated by Gopax, froze withdrawals in early 2023 after Genesis halted redemptions and later filed for bankruptcy. Thousands of users were left unable to access their funds, prompting Binance to step in and acquire a majority stake in Gopax as part of a rescue plan. According to Seker, there is now alignment among regulators, users, and Binance to close the issue. The restitution wallet, currently under third-party custody, holds the same crypto assets users originally lost, not their fiat value. These include over 775 BTC, nearly 5,800 ETH, and more than 700,000 USDC, reflecting the strong price appreciation since withdrawals were frozen. While the funds are ready, Binance is still awaiting final approvals from South Korean authorities and is developing a distribution plan to minimize costs for all parties. Once repayments are complete, Binance plans to shift its focus to upgrading Gopax’s infrastructure. This includes technical and security enhancements aligned with Binance’s global standards, alongside gradual product expansion tailored to South Korea’s regulatory environment . Rebranding Gopax under the Binance name remains an option, but is not a priority for now. Instead, the emphasis is on offering compliant products that already exist in the local market and meet clear user demand. Looking ahead, Binance sees major opportunities in stablecoins, real-world asset tokenization, and institutional crypto adoption. Seker noted potential support for won-pegged stablecoins and payment systems, as lawmakers work toward clearer regulations. Tokenized securities and RWAs, potentially launched through local partnerships, are also on the radar. With South Korea gradually easing restrictions on corporate crypto investment, Binance is positioning Gopax to serve institutional clients as the market opens up. Challenges still exist. Proposed rules could cap major shareholders’ stakes in exchanges at 15–20%, far below Binance’s current 67% holding in Gopax. Still, Seker downplayed the risk, calling South Korea one of the most attractive and balanced crypto markets in the Asia-Pacific region. While Upbit and Bithumb currently dominate, Binance is clear about its ambition. Compete aggressively and aim for the top spot, starting once GoFi repayments are finally complete. Stay ahead with breaking news, expert analysis, and real-time updates on the latest trends in Bitcoin, altcoins, DeFi, NFTs, and more. Binance plans to fully repay GoFi users by 2026, returning their crypto assets and resolving the long-standing frozen withdrawals issue. Binance aims to upgrade Gopax’s infrastructure, offer compliant products, and explore stablecoins, tokenized assets, and institutional crypto. Rebranding is possible but not a priority. Binance focuses on compliant products and user demand while strengthening Gopax’s platform. Proposed rules may cap major shareholder stakes at 15–20%, but Binance sees Korea as an attractive market and is navigating regulations carefully. CoinPedia has been delivering accurate and timely cryptocurrency and blockchain updates since 2017. All content is created by our expert panel of analysts and journalists, following strict Editorial Guidelines based on E-E-A-T (Experience, Expertise, Authoritativeness, Trustworthiness). Every article is fact-checked against reputable sources to ensure accuracy, transparency, and reliability. Our review policy guarantees unbiased evaluations when recommending exchanges, platforms, or tools. We strive to provide timely updates about everything crypto & blockchain, right from startups to industry majors. All opinions and insights shared represent the author's own views on current market conditions. Please do your own research before making investment decis"
    },
    {
      "title": "Bitwise CIO Matt Hougan says bitcoin could hit $6.5 million in 20 years",
      "source": "CoinDesk",
      "summary": "Bitwise CIO Matt Hougan joined CoinDesk's Markets Outlook on Monday, he said crypto is in the late stages of a bear-market bottom, setting up a choppy but constructive path toward a stronger 2026. What Hougan is seeing: The CIO said recent weakness doesn’t change his long-term bullish view. Where bitcoin trades from here: Expect patience before the next leg higher. Why precious metals matter: Gold’s rally reinforces bitcoin’s long-term case. Central banks are circling, slowly: Interest is rising, but adoption is years away. The $6.5 million bitcoin call: A long-term bet on monetary reality. Zooming out: Volatility compression is key for institutions. Final take: Short-term chop, long-term conviction.",
      "full_text": "Bitwise CIO Matt Hougan joined CoinDesk's Markets Outlook on Monday, he said crypto is in the late stages of a bear-market bottom, setting up a choppy but constructive path toward a stronger 2026. What Hougan is seeing: The CIO said recent weakness doesn’t change his long-term bullish view. Where bitcoin trades from here: Expect patience before the next leg higher. Why precious metals matter: Gold’s rally reinforces bitcoin’s long-term case. Central banks are circling, slowly: Interest is rising, but adoption is years away. The $6.5 million bitcoin call: A long-term bet on monetary reality. Zooming out: Volatility compression is key for institutions. Final take: Short-term chop, long-term conviction. Watch the full interview ."
    },
    {
      "title": "U.S. government seizes $400 million Helix allegedly made from drug-linked transactions",
      "source": "CoinDesk",
      "summary": "government now has the legal title to more than $400 million worth of seized cryptocurrency, real estate and cash linked to the once-popular darknet bitcoin mixing service Helix, the Department of Justice (DOJ) announced on Thursday. Mixing services like Helix are designed to obscure the origin and destination of crypto transactions by pooling and redistributing funds, a practice long scrutinized by law enforcement and regulators. The DOJ alleged that Helix in particular was used by drug traffickers and other criminals to launder money. According to court documents, Helix was among the most widely used mixing services on the darknet, particularly by online drug dealers seeking to launder illicit profits. Investigators said Helix processed at least 354,468 bitcoin, valued at roughly $300 million at the time, much of it tied to darknet drug markets. Helix's operator, Larry Dean Harmon collected commissions and fees on these transactions. Harmon pleaded guilty in August 2021 to conspiracy to commit money laundering and was sentenced in November 2024 to 36 months in prison, followed by three years of supervised release, along with a forfeiture money judgment and the forfeiture of seized property. Harmon also operated Grams, a darknet search engine designed to connect users to major darknet markets. Helix’s application programming interface (API) allowed darknet marketplaces to integrate the mixer directly into their bitcoin withdrawal systems, enabling seamless Since 2020, the DOJ Criminal Division’s Computer Crime and Intellectual Property Section (CCIPS) has secured more than 180 cybercrime convictions and court orders for the return of over $350 million in victim funds, according to the Justice Department..",
      "full_text": "The U.S. government now has the legal title to more than $400 million worth of seized cryptocurrency, real estate and cash linked to the once-popular darknet bitcoin mixing service Helix, the Department of Justice (DOJ) announced on Thursday. Mixing services like Helix are designed to obscure the origin and destination of crypto transactions by pooling and redistributing funds, a practice long scrutinized by law enforcement and regulators. The DOJ alleged that Helix in particular was used by drug traffickers and other criminals to launder money. According to court documents, Helix was among the most widely used mixing services on the darknet, particularly by online drug dealers seeking to launder illicit profits. Investigators said Helix processed at least 354,468 bitcoin, valued at roughly $300 million at the time, much of it tied to darknet drug markets. Helix's operator, Larry Dean Harmon collected commissions and fees on these transactions. Harmon pleaded guilty in August 2021 to conspiracy to commit money laundering and was sentenced in November 2024 to 36 months in prison, followed by three years of supervised release, along with a forfeiture money judgment and the forfeiture of seized property. Harmon also operated Grams, a darknet search engine designed to connect users to major darknet markets. Helix’s application programming interface (API) allowed darknet marketplaces to integrate the mixer directly into their bitcoin withdrawal systems, enabling seamless Since 2020, the DOJ Criminal Division’s Computer Crime and Intellectual Property Section (CCIPS) has secured more than 180 cybercrime convictions and court orders for the return of over $350 million in victim funds, according to the Justice Department."
    },
    {
      "title": "Anatomy of bitcoin's plunge this week: The dollar's bottom was BTC's top",
      "source": "CoinDesk",
      "summary": "Bitcoin’s BTC $ 82,746.90 sell-off late this week might have had little to do with crypto-specific factors and instead everything to do with the U.S. After what’s now becoming a customary weekend decline in crypto prices, bitcoin was actually on the rise through the week, in part as the decline in the U.S. Bitcoin peaked for the week late Wednesday afternoon, just shy of $91,000, as the Fed held rates steady and attention turned to who President Trump might nominate as the next leader of the U.S. The peak coincided with a decline in the dollar index (DXY) to a multi-year low of 95.34. All other things being equal, a weaker U.S. dollar is often seen as supportive of asset prices, such as bitcoin, stocks, and commodities. Even though technicians sounded the alarm that the DXY below 96 meant even deeper declines for the greenback, markets thought otherwise. The dollar began a steady climb, and, alongside, bitcoin began pulling back from that $91,000 level. The dollar continued strengthening into Thursday, with bitcoin's losses accelerating throughout the session. Finally, the Thursday evening leak that Kevin Warsh (and his hawkish reputation) was to be nominated as Fed chairman forced another surge higher in the dollar and gap lower in bitcoin, with BTC ultimately bottoming at $81,000.",
      "full_text": "Bitcoin’s BTC $ 82,746.90 sell-off late this week might have had little to do with crypto-specific factors and instead everything to do with the U.S. dollar. After what’s now becoming a customary weekend decline in crypto prices, bitcoin was actually on the rise through the week, in part as the decline in the U.S. dollar accelerated. Bitcoin peaked for the week late Wednesday afternoon, just shy of $91,000, as the Fed held rates steady and attention turned to who President Trump might nominate as the next leader of the U.S. central bank. The peak coincided with a decline in the dollar index (DXY) to a multi-year low of 95.34. All other things being equal, a weaker U.S. dollar is often seen as supportive of asset prices, such as bitcoin, stocks, and commodities. Even though technicians sounded the alarm that the DXY below 96 meant even deeper declines for the greenback, markets thought otherwise. The dollar began a steady climb, and, alongside, bitcoin began pulling back from that $91,000 level. The dollar continued strengthening into Thursday, with bitcoin's losses accelerating throughout the session. Finally, the Thursday evening leak that Kevin Warsh (and his hawkish reputation) was to be nominated as Fed chairman forced another surge higher in the dollar and gap lower in bitcoin, with BTC ultimately bottoming at $81,000. Bitcoin's managed to bounce to $83,000 since then, but the dollar has continued to post gains, raising questions about how sustainable the crypto's rise might be."
    },
    {
      "title": "Precious metals crash, with silver plunging 35%, gold falling 12% while bitcoin holds at $83,000",
      "source": "CoinDesk",
      "summary": "The bubble in precious metals might have popped this week, with silver's violent decline on Friday leading the group lower. Having touched a new record of $120 per ounce earlier in the session, silver has pulled back to $75 in U.S. afternoon hours, now lower by 35% for the day. Gold — which as recently as Sunday had never seen $5,000 per ounce — climbed to $5,600 at one point Thursday, but has now retreated to $4,718, down 12% for the day. Platinum is lower by 24% and palladium by 20%. To put silver's move in perspective, it's given back nearly its entire massive January gain in the space of a few hours. While crypto bulls might be used to such action, only those precious metals traders who were around during the days of the Hunt Brothers in 1980 will be familiar with that sort of downside volatility. stocks are selling off as well, the Nasdaq down 1.25% and S&P 500 0.9%. After plunging earlier in the week, cryptocurrencies, by comparison, are moving somewhat sideways on Friday, holding above Thursday evening's panicky lows. Bitcoin was trading around $83,000 recently versus its overnight bottom of $81,000.",
      "full_text": "The bubble in precious metals might have popped this week, with silver's violent decline on Friday leading the group lower. Having touched a new record of $120 per ounce earlier in the session, silver has pulled back to $75 in U.S. afternoon hours, now lower by 35% for the day. Gold — which as recently as Sunday had never seen $5,000 per ounce — climbed to $5,600 at one point Thursday, but has now retreated to $4,718, down 12% for the day. Platinum is lower by 24% and palladium by 20%. To put silver's move in perspective, it's given back nearly its entire massive January gain in the space of a few hours. While crypto bulls might be used to such action, only those precious metals traders who were around during the days of the Hunt Brothers in 1980 will be familiar with that sort of downside volatility. U.S. stocks are selling off as well, the Nasdaq down 1.25% and S&P 500 0.9%. After plunging earlier in the week, cryptocurrencies, by comparison, are moving somewhat sideways on Friday, holding above Thursday evening's panicky lows. Bitcoin was trading around $83,000 recently versus its overnight bottom of $81,000. The action in markets has been volatile all week, but this latest bout appears to have been set off by President Trump's picking Kevin Warsh to replace Jerome Powell as Federal Reserve chair. Conventional thinking at the moment says Warsh was a somewhat hawkish pick, thus perhaps setting off the selling in risk assets. Paul Howard, director at trading firm Wincent, spoke for many crypto bulls, saying the parabolic move in commodities in recent months had siphoned risk capital from crypto markets. That dynamic may now be shifting. \"Cryptocurrency markets have been the victim of risk capital flowing into the still popular commodities trade,\" he said. He noted growing interest in options markets for upside exposure in February, with the 105,000 BTC calls among the most actively traded contracts. \"The outlook indicates what a lot of crypto traders are feeling right now — that their market is long overdue a commodity-style catch-up,\" Howard added. “What was meant to be a bullish move for the markets appears to have coincided with a broad risk sell-off,” Howard said of the nomination of Kevin Warsh. “The reaction may be more of a knee-jerk as markets recalibrate.”"
    },
    {
      "title": "Visa and Mastercard aren’t buying the stablecoin hype for everyday payments",
      "source": "CoinDesk",
      "summary": "Wall Street’s payments giants are not sold on crypto’s usefulness in everyday transactions — at least not yet. In earnings calls this week, both Visa and Mastercard executives offered cautious assessments of digital assets, especially stablecoins, signalling that consumer demand hasn't necessarily materialized in meaningful ways. “As I’ve said before, in the U.S., if a consumer wants to pay for something using a digital dollar, they have ample ways to do that today,” said Visa CEO Ryan McInerny. “They can pay from their checking account or their savings account. So we don’t see a lot of product market fit for stablecoin payments and consumer payments in digitally developed markets.” Stablecoins are meant to make payments faster by allowing money to move directly between parties on a blockchain, without going through banks or card networks. Unlike traditional payments, which can take days to settle, especially across borders, stablecoin transactions can clear in seconds and operate around the clock, including weekends and holidays. In a September report , JP Morgan described stablecoins as “a digital, on-chain form of fiat money” that are “easy to self-custody and transact” and “fast, particularly in the context of cross-border money movement.” The bank said stablecoins could even be “a better form than fiat” in some situations, thanks to lower costs and around-the-clock settlement. But the report also warned of risks, including the potential for a destabilizing run on stablecoins. “The collapse of TerraUSD in May 2022 highlights just how quickly a run can occur, in an asset class that trades 24/7,” analyst Joyce Ho wrote. Mastercard struck a more open tone than Visa, with CEO Michael Mierbach saying the company is \"leaning in\" to emerging technologies like stablecoins and AI-powered agents but even he framed the company's role more as enabling infrastructure than leading transformation.",
      "full_text": "Wall Street’s payments giants are not sold on crypto’s usefulness in everyday transactions — at least not yet. In earnings calls this week, both Visa and Mastercard executives offered cautious assessments of digital assets, especially stablecoins, signalling that consumer demand hasn't necessarily materialized in meaningful ways. “As I’ve said before, in the U.S., if a consumer wants to pay for something using a digital dollar, they have ample ways to do that today,” said Visa CEO Ryan McInerny. “They can pay from their checking account or their savings account. It’s become quite easy to do. So we don’t see a lot of product market fit for stablecoin payments and consumer payments in digitally developed markets.” Stablecoins are meant to make payments faster by allowing money to move directly between parties on a blockchain, without going through banks or card networks. Unlike traditional payments, which can take days to settle, especially across borders, stablecoin transactions can clear in seconds and operate around the clock, including weekends and holidays. In a September report , JP Morgan described stablecoins as “a digital, on-chain form of fiat money” that are “easy to self-custody and transact” and “fast, particularly in the context of cross-border money movement.” The bank said stablecoins could even be “a better form than fiat” in some situations, thanks to lower costs and around-the-clock settlement. But the report also warned of risks, including the potential for a destabilizing run on stablecoins. “The collapse of TerraUSD in May 2022 highlights just how quickly a run can occur, in an asset class that trades 24/7,” analyst Joyce Ho wrote. Mastercard struck a more open tone than Visa, with CEO Michael Mierbach saying the company is \"leaning in\" to emerging technologies like stablecoins and AI-powered agents but even he framed the company's role more as enabling infrastructure than leading transformation. “For us, stablecoins are another currency we can support within our network,” Miebach said. He pointed to work with MetaMask, Ripple and Gemini, but emphasized that the current dominant use case remains trading, not payments. \"We've made good traction enabling the purchase of these assets, facilitating transactions, and supporting stablecoins for settlement over our network,\" he said. Both companies have dabbled in blockchain infrastructure — Mastercard with pilots for on-chain identity and settlement tools, and Visa with experiments in stablecoin settlement using USDC. But despite these efforts, neither is treating crypto as a near-term threat or opportunity for their core businesses. That stance contrasts with the scale of on-chain activity. According to data from Glassnode, bitcoin alone settled over $25 trillion worth of transactions in 2025, more than Visa ($17 trillion) and Mastercard ($11 trillion) combined. While Bitcoin’s volume includes high-frequency and large institutional transfers, the size reflects growing blockchain demand across financial applications. Meanwhile, SoFi, the digital bank and fintech firm, is leaning into crypto more aggressively. After beating Wall Street estimates in its fourth-quarter earnings, SoFi’s stock rose briefly before dropping, now 5% lower. Just over 63,000 accounts were actively buying, selling, and holding digital assets in the fourth quarter of 2025, although the option only became fully available in late December. Nevertheless, the company said it sees crypto as part of a larger strategy. CEO Anthony Noto told investors that SoFi is “moving with urgency to lead the next phase of financial services by delivering crypto and blockchain innovation backed by bank-grade stability and security.”"
    },
    {
      "title": "Brian Armstrong was snubbed by top executives from the biggest U.S. banks in Davos",
      "source": "CoinDesk",
      "summary": "Coinbase (COIN) CEO Brian Armstrong is running into a wall — and it looks a lot like the heads of America’s biggest banks. During meetings at the World Economic Forum in Davos, Armstrong reportedly approached several Wall Street leaders to discuss the crypto market structure bill moving through Congress, according to a report the Wall Street Journal (WSJ) on Thursday. JPMorgan Chase CEO Jamie Dimon told Armstrong, “You are full of s---,” according to people familiar with the exchange who spoke with the WSJ. Bank of America’s Brian Moynihan sat for a 30-minute meeting but dismissed Armstrong’s position, saying, “If you want to be a bank, just be a bank.” Wells Fargo CEO Charlie Scharf refused to engage, saying there was “nothing for them to talk about.” Citigroup’s Jane Fraser gave him under a minute. The frost comes as Armstrong has turned sharply against the Senate’s crypto bill. After reviewing a draft, he announced on X that Coinbase “can’t support the bill as written.” He later warned that traditional banks were lobbying to protect their turf by targeting stablecoin rewards — recurring payouts to users who hold tokens like USDC. These rewards function like interest-bearing accounts but typically offer higher yields — up to 3.5%. Banks argue they pose a threat to deposit-based models that fund lending and other core services. If users shift en masse to stablecoins, the impact on local lending and smaller banks could be significant. Armstrong says the answer is simple: compete.",
      "full_text": "Coinbase (COIN) CEO Brian Armstrong is running into a wall — and it looks a lot like the heads of America’s biggest banks. During meetings at the World Economic Forum in Davos, Armstrong reportedly approached several Wall Street leaders to discuss the crypto market structure bill moving through Congress, according to a report the Wall Street Journal (WSJ) on Thursday. The reception was icy. JPMorgan Chase CEO Jamie Dimon told Armstrong, “You are full of s---,” according to people familiar with the exchange who spoke with the WSJ. Bank of America’s Brian Moynihan sat for a 30-minute meeting but dismissed Armstrong’s position, saying, “If you want to be a bank, just be a bank.” Wells Fargo CEO Charlie Scharf refused to engage, saying there was “nothing for them to talk about.” Citigroup’s Jane Fraser gave him under a minute. The frost comes as Armstrong has turned sharply against the Senate’s crypto bill. After reviewing a draft, he announced on X that Coinbase “can’t support the bill as written.” He later warned that traditional banks were lobbying to protect their turf by targeting stablecoin rewards — recurring payouts to users who hold tokens like USDC. These rewards function like interest-bearing accounts but typically offer higher yields — up to 3.5%. Banks argue they pose a threat to deposit-based models that fund lending and other core services. If users shift en masse to stablecoins, the impact on local lending and smaller banks could be significant. Armstrong says the answer is simple: compete. The legislation, known as the CLARITY Act , could determine who gets to offer these products — and under what rules. Its outcome could reset the playing field between banks and crypto platforms. Still, the line between the two industries isn’t as sharp as the public standoff suggests. Coinbase maintains partnerships with major banks, including JPMorgan and Citi. That makes the current dispute less about total disruption and more about who sets the terms for the next phase of digital finance. CoinDesk reached out to Coinbase, JPMorgan, Bank of America, Wells Fargo and Citigroup for comment but none was received by press time."
    },
    {
      "title": "Bitcoin is the 'newest, coolest software': Inside Kevin Warsh’s complicated crypto history",
      "source": "CoinDesk",
      "summary": "The market was initially jolted by the sudden news of President Donald Trump naming Kevin Warsh as his choice for the next Federal Reserve chair, ending a month-long saga of guessing game. The U.S. dollar rallied, bitcoin fell , and the equity market became volatile when the news broke; while the market might have stabilized a bit for now, the uncertainty is still gripping the traders across all asset classes. So who is Kevin Warsh, and more importantly, how will his leadership shape the future of monetary policy and crypto? Kevin Maxwell Warsh is a former U.S. Federal Reserve governor who served from 2006 to 2011 and played a senior role during the 2008 global financial crisis, including acting as a key liaison between the Fed and financial markets. Before joining the central bank, Warsh worked at Morgan Stanley and served in the George W. Bush administration as Special Assistant to the President for Economic Policy and Executive Secretary of the National Economic Council, giving him experience spanning Wall Street and Washington. After leaving the Fed, Warsh became a visiting fellow at Stanford University’s Hoover Institution , where he has written extensively on monetary policy, central bank credibility and what he views as the long-term risks of prolonged balance-sheet expansion by central banks. It's worth noting here that while the nomination spooked the market and bitcoin, Federal Reserve Chair Jerome Powell — whose second four-year term expires on May 15, 2026 — is eligible to remain on the Fed’s Board of Governors until Jan. 31, 2028. Warsh must still be confirmed by the Senate before assuming the role, but a vacancy created by Governor Stephen Miran’s expiring temporary term on Jan. 31, 2026 could allow him to join the board ahead of May. Warsh’s appointment has drawn particular scrutiny from digital-asset investors — at least initially — given his long-held views on monetary discipline and skepticism toward bitcoin’s role as money. While the concern is not with Warsh personally, his background has led many market participants to view him as potentially bearish for bitcoin and other risk assets.",
      "full_text": "The market was initially jolted by the sudden news of President Donald Trump naming Kevin Warsh as his choice for the next Federal Reserve chair, ending a month-long saga of guessing game. The U.S. dollar rallied, bitcoin fell , and the equity market became volatile when the news broke; while the market might have stabilized a bit for now, the uncertainty is still gripping the traders across all asset classes. So who is Kevin Warsh, and more importantly, how will his leadership shape the future of monetary policy and crypto? Kevin Maxwell Warsh is a former U.S. Federal Reserve governor who served from 2006 to 2011 and played a senior role during the 2008 global financial crisis, including acting as a key liaison between the Fed and financial markets. Before joining the central bank, Warsh worked at Morgan Stanley and served in the George W. Bush administration as Special Assistant to the President for Economic Policy and Executive Secretary of the National Economic Council, giving him experience spanning Wall Street and Washington. After leaving the Fed, Warsh became a visiting fellow at Stanford University’s Hoover Institution , where he has written extensively on monetary policy, central bank credibility and what he views as the long-term risks of prolonged balance-sheet expansion by central banks. It's worth noting here that while the nomination spooked the market and bitcoin, Federal Reserve Chair Jerome Powell — whose second four-year term expires on May 15, 2026 — is eligible to remain on the Fed’s Board of Governors until Jan. 31, 2028. Warsh must still be confirmed by the Senate before assuming the role, but a vacancy created by Governor Stephen Miran’s expiring temporary term on Jan. 31, 2026 could allow him to join the board ahead of May. Warsh’s appointment has drawn particular scrutiny from digital-asset investors — at least initially — given his long-held views on monetary discipline and skepticism toward bitcoin’s role as money. While the concern is not with Warsh personally, his background has led many market participants to view him as potentially bearish for bitcoin and other risk assets. He is broadly viewed as favoring monetary discipline, higher real rates, and a smaller Fed balance sheet, all of which oppose a liquidity-heavy environment that has historically backed risk assets. So what are his ties to crypto? First, let's take a look at what he said about bitcoin previously. In public commentary in 2015, Warsh approached bitcoin and cryptocurrencies primarily through a monetary-policy lens, expressing skepticism about their use as stable mediums of exchange while acknowledging the potential of blockchain technology. “The underlying technology in that white paper, it’s just software,” Warsh said during a video conversation with Stanley Drukenmiller. “It’s just the newest, coolest software that will provide us the opportunity to do things we could never have done before.\" While acknowledging all software can be used for good and for evil, Warsh said that by building it here in the U.S., that gives us the opportunity to be more productive and create something very special over the next decade…” At one point in the conversation with the billionaire hedge fund manager and his former colleague, Warsh told Drukenmiller, “You made reference to Bitcoin and I thought I heard a little condescension in your voice, that people are buying bitcoin.” He went on to make a case in favour of bitcoin, saying “it could provide market discipline, it could tell the world that things need to be fixed.” He also said he thinks of “bitcoin as a lot of things, but certainly with every passing day it's getting new life as an alternative currency.” While the interview is from 2015, when bitcoin was still seen as dangerous and mostly used for illegal activities, a lot has changed in the last eleven years. Now, the U.S. has a pro-crypto government, there is legislation in the works to create a legal framework for digital assets, and, most importantly, crypto has become too big to ignore, even for Wall Street giants. The potential future Fed chair has argued that central banks must engage with digital money, including considering a U.S. central bank digital currency (CBDC) to counter bitcoin and rival China’s digital yuan. Worth noting that CBDC is a hotly debated topic in the crypto community due to privacy concerns. He also said cryptocurrency was nothing more than \"software pretending to be money.” He categorized cryptocurrencies as a symptom of \"speculative excess\" driven by loose monetary policy and argued that Bitcoin's rise was largely a derivative of the \"global dollar flood\" and that, as liquidity tightens, such assets are likely to lose their appeal. Warsh also had close ties with crypto in general. Warsh has drawn attention in crypto circles for his early involvement with digital-asset firms, including Bitwise Asset Management, a crypto index fund provider. Warsh was an investor in a cryptocurrency project "
    },
    {
      "title": "Hedge fund billionaire Stan Druckenmiller on Warsh as Fed chair: ‘no one better equipped’",
      "source": "CoinDesk",
      "summary": "The knee-jerk reaction to Donald Trump’s pick of Kevin Warsh to replace Jerome Powell as chairman of the Federal Reserve is that the president made the most hawkish selection among the four reported finalists for the job. In the wake of last night’s leak that Warsh was to be the choice, risk markets — crypto among them — fell sharply, with bitcoin plunging all the way back to $81,000. \"The branding of Kevin as someone who’s always hawkish is not correct,” Stanley Druckenmiller told the FT on Friday. \"I’ve seen him go both ways.\" Druckenmiller — who made billions working alongside George Soros at Quantum Fund and with his own family office, Duquesne Capital Management — is surely in a position to know. Warsh has been a partner at Duquesne since 2011. The relationship between them has previously been described as close to father-son, with the two speaking and/or texting more than a dozen times per day. \"I could not think of a single other individual on the planet better equipped,\" Druckenmiller continued. Druckenmiller also has very close ties to Scott Bessent. It was Druckenmiller who hired Bessent at Quantum Fund more than 30 years ago, where the to-be U.S. Treasury Secretary made his own billions.",
      "full_text": "The knee-jerk reaction to Donald Trump’s pick of Kevin Warsh to replace Jerome Powell as chairman of the Federal Reserve is that the president made the most hawkish selection among the four reported finalists for the job. In the wake of last night’s leak that Warsh was to be the choice, risk markets — crypto among them — fell sharply, with bitcoin plunging all the way back to $81,000. \"The branding of Kevin as someone who’s always hawkish is not correct,” Stanley Druckenmiller told the FT on Friday . \"I’ve seen him go both ways.\" Druckenmiller — who made billions working alongside George Soros at Quantum Fund and with his own family office, Duquesne Capital Management — is surely in a position to know. Warsh has been a partner at Duquesne since 2011. The relationship between them has previously been described as close to father-son, with the two speaking and/or texting more than a dozen times per day. \"I could not think of a single other individual on the planet better equipped,\" Druckenmiller continued. Druckenmiller also has very close ties to Scott Bessent. It was Druckenmiller who hired Bessent at Quantum Fund more than 30 years ago, where the to-be U.S. Treasury Secretary made his own billions. \"The pair [Bessent and Warsh] embody the way Druckenmiller interprets markets and economic policy,\" wrote the FT in a profile roughly one year ago. “I’m really excited about the partnership between [Warsh] and Bessent,” Druckenmiller said today. “Having an accord between the Treasury secretary and Fed chair is ideal.”"
    },
    {
      "title": "Dimon to Coinbase CEO Armstrong: ‘You’re full of it’ — Wall Street’s crypto battle boils over in Davos",
      "source": "Crypto.News",
      "summary": "A pointed insult from JPMorgan Chase CEO Jamie Dimon crystallized a growing power struggle between Wall Street and crypto’s most influential U.S. champion. During a coffee meeting at the World Economic Forum in Davos last week, Coinbase CEO Brian Armstrong was speaking with former U.K. Prime Minister Tony Blair when Dimon abruptly interjected. Pointing a finger at Armstrong, the longtime crypto skeptic bluntly told him, “You are full of s—,” according to the Wall Street Journal . Dimon accused Armstrong of misleading the public in recent television appearances, where the Coinbase chief said banks were lobbying to sabotage crypto-friendly legislation. The confrontation underscored intensifying tensions as digital assets push deeper into mainstream finance. While major banks have cautiously embraced crypto for trading and payments, they are fiercely resisting what they see as an existential threat: crypto firms offering yield-like payouts that could lure consumer deposits away from traditional banks. At the center of the fight is the proposed Clarity Act, legislation that would shape how digital assets are regulated in the U.S. Banks argue that so-called “rewards” paid by crypto exchanges for holding stablecoins—often around 3.5%—function like interest-bearing accounts, without the same regulatory oversight banks face. Crypto firms counter that competition should decide winners, and that banks are free to raise rates or enter the stablecoin business themselves. Armstrong, 43, has emerged as crypto’s most vocal political force. As CEO of the roughly $55 billion Coinbase, he has warned lawmakers that a bad bill could cost his company billions and has shown a willingness to walk away from legislation he sees as hostile.",
      "full_text": "A pointed insult from JPMorgan Chase CEO Jamie Dimon crystallized a growing power struggle between Wall Street and crypto’s most influential U.S. champion. During a coffee meeting at the World Economic Forum in Davos last week, Coinbase CEO Brian Armstrong was speaking with former U.K. Prime Minister Tony Blair when Dimon abruptly interjected. Pointing a finger at Armstrong, the longtime crypto skeptic bluntly told him, “You are full of s—,” according to the Wall Street Journal . Dimon accused Armstrong of misleading the public in recent television appearances, where the Coinbase chief said banks were lobbying to sabotage crypto-friendly legislation. The confrontation underscored intensifying tensions as digital assets push deeper into mainstream finance. While major banks have cautiously embraced crypto for trading and payments, they are fiercely resisting what they see as an existential threat: crypto firms offering yield-like payouts that could lure consumer deposits away from traditional banks. At the center of the fight is the proposed Clarity Act, legislation that would shape how digital assets are regulated in the U.S. Banks argue that so-called “rewards” paid by crypto exchanges for holding stablecoins—often around 3.5%—function like interest-bearing accounts, without the same regulatory oversight banks face. Crypto firms counter that competition should decide winners, and that banks are free to raise rates or enter the stablecoin business themselves. Armstrong, 43, has emerged as crypto’s most vocal political force. As CEO of the roughly $55 billion Coinbase, he has warned lawmakers that a bad bill could cost his company billions and has shown a willingness to walk away from legislation he sees as hostile. His public pressure helped stall a recent Senate vote, surprising much of Washington. The dispute has reframed the debate as “Coinbase versus the banks,” rather than crypto versus finance broadly, analysts say. With the White House set to convene bank and crypto leaders for talks, and Armstrong’s support seen as pivotal, the outcome could redefine deposits, payments—and who controls them—in the digital age. Best crypto platforms The machine economy: AI will benefit crypto, or break it | Opinion What crypto treasuries must do to survive as the hype dies | Opinion Trump’s tariffs: Boosting or hurting XRP price? Capital without borders: Decentralized crowdfunding thrives in global turmoil | Opinion Meet Jingliang Su, Chinese man gets 46 months sentence for $36.9M crypto scam Intelligence on the chain: AI must become a tokenized asset | Opinion Will TRUMP Coin rally ahead of Melania Trump movie release? The future of Bitcoin treasury depends on strategy, not price | Opinion Cross-chain isn’t democratizing crypto, it’s rewarding a few | Opinion GameStop transfers Bitcoin to Coinbase, Senate Democrats amend crypto bill, UK finalizes regulation consultation | Weekly Recap Coinbase expands Kalshi prediction market feature to all 50 U.S. states UK ad watchdog bans Coinbase campaign for trivializing crypto investment risks Ethereum price rejects $3K again as Coinbase Premium falls to 2023 lows Get crypto market analysis and curated news delivered right to your inbox every week. You have successfully joined our subscriber list. Sign up for our free newsletters"
    },
    {
      "title": "Trump taps Kevin Warsh for Fed Chair, sets stage for high-stakes battle over central bank independence",
      "source": "Crypto.News",
      "summary": "President Donald Trump on Friday named former Federal Reserve Governor Kevin Warsh to succeed Jerome Powell as chair of the U.S. central bank, capping months of speculation and intensifying scrutiny over the future independence of the Fed at a moment of persistent inflation, slowing growth, and mounting political pressure. The nomination of Warsh, 55, a veteran of Wall Street and the Fed, is widely seen as a bid to install a chair aligned with Trump’s calls for lower interest rates, even as markets remain skeptical that Warsh would act as a political proxy. While the pick is unlikely to spark immediate market volatility, it sets up a contentious confirmation process and a broader debate over how far the White House can—and should—go in influencing monetary policy. Trump announced the decision on Truth Social, praising Warsh as a proven leader who could go down as “one of the GREAT Fed Chairmen, maybe the best.” The move ends a prolonged and unusually public search that at one point included more than a dozen candidates and was closely watched by investors, economists, and lawmakers. Warsh previously served as a Fed governor from 2006 to 2011, spanning the global financial crisis, and has since been a frequent commentator on monetary policy. His experience and credibility helped reassure markets, which showed only modest reaction following the announcement. Stock futures were slightly lower Friday morning but well off their lows once Warsh emerged as the clear choice. Warsh has been sharply critical of the current Fed leadership. He told CNBC that he wanted a “regime change” at the central bank, arguing that its credibility had eroded under the existing leadership. That stance could place him at odds with an institution built around consensus and gradualism.",
      "full_text": "President Donald Trump on Friday named former Federal Reserve Governor Kevin Warsh to succeed Jerome Powell as chair of the U.S. central bank, capping months of speculation and intensifying scrutiny over the future independence of the Fed at a moment of persistent inflation, slowing growth, and mounting political pressure. The nomination of Warsh, 55, a veteran of Wall Street and the Fed, is widely seen as a bid to install a chair aligned with Trump’s calls for lower interest rates, even as markets remain skeptical that Warsh would act as a political proxy. While the pick is unlikely to spark immediate market volatility, it sets up a contentious confirmation process and a broader debate over how far the White House can—and should—go in influencing monetary policy. Trump announced the decision on Truth Social, praising Warsh as a proven leader who could go down as “one of the GREAT Fed Chairmen, maybe the best.” The move ends a prolonged and unusually public search that at one point included more than a dozen candidates and was closely watched by investors, economists, and lawmakers. Warsh previously served as a Fed governor from 2006 to 2011, spanning the global financial crisis, and has since been a frequent commentator on monetary policy. His experience and credibility helped reassure markets, which showed only modest reaction following the announcement. Stock futures were slightly lower Friday morning but well off their lows once Warsh emerged as the clear choice. Warsh has been sharply critical of the current Fed leadership. He told CNBC that he wanted a “regime change” at the central bank, arguing that its credibility had eroded under the existing leadership. That stance could place him at odds with an institution built around consensus and gradualism. Trump’s decision comes as the Fed faces one of its most challenging environments in decades. Inflation remains above the central bank’s 2% target, government borrowing continues to rise, and the labor market is soft. Tensions escalated recently after the Justice Department subpoenaed Powell over a costly renovation of the Fed’s Washington, D.C., headquarters. Powell has characterized the investigation as a “pretext” to force easier monetary policy, a claim that has deepened concerns about political interference. Trump and senior administration officials have openly questioned long-standing norms around Fed independence, floating ideas that include tighter White House oversight and changes to how interest-rate decisions are made, potentially requiring consultation with the president. The Warsh nomination followed a competitive vetting process led by Treasury Secretary Scott Bessent. Finalists included current Fed Governor Christopher Waller, BlackRock bond chief Rick Rieder, and National Economic Council Director Kevin Hassett. Republican Sen. Thom Tillis of North Carolina reportedly said he would block all Fed nominations until the Justice Department concludes its probe into Powell, calling the investigation unfounded. By contrast, Senate Banking Committee Chair Tim Scott praised Warsh’s “deep knowledge of markets and monetary policy.” Markets, for now, expect continuity rather than disruption. Traders are pricing in no more than two additional rate cuts this year, with the benchmark fed funds rate settling near 3%, a level policymakers view as neutral. One unresolved question is Powell’s future. Though Fed chairs traditionally step down entirely when replaced, Powell still has two years left in his term as governor and could remain on the board, potentially serving as a check on Trump’s efforts to reshape the institution. The Supreme Court is already weighing a related case involving another Fed governor, a decision that could ultimately redefine presidential authority over the central bank. Best crypto platforms The machine economy: AI will benefit crypto, or break it | Opinion What crypto treasuries must do to survive as the hype dies | Opinion Trump’s tariffs: Boosting or hurting XRP price? Capital without borders: Decentralized crowdfunding thrives in global turmoil | Opinion Meet Jingliang Su, Chinese man gets 46 months sentence for $36.9M crypto scam Intelligence on the chain: AI must become a tokenized asset | Opinion Will TRUMP Coin rally ahead of Melania Trump movie release? The future of Bitcoin treasury depends on strategy, not price | Opinion Cross-chain isn’t democratizing crypto, it’s rewarding a few | Opinion GameStop transfers Bitcoin to Coinbase, Senate Democrats amend crypto bill, UK finalizes regulation consultation | Weekly Recap Trump-backed stablecoin hits $5 billion as first family cashes in Betting markets turn on Noem as GOP senators break ranks Trump predicts rate cuts after replacing Federal Reserve chair Get crypto market analysis and curated news delivered right to your inbox every week. You have successfully joined our subscriber list. Sign up for our free newsletters"
    },
    {
      "title": "Goldbug Peter Schiff says the U.S. dollar is facing massive deleveraging as metals surge and crypto stalls",
      "source": "Crypto.News",
      "summary": "Gold’s vertical spike to fresh records is Peter Schiff’s proof that U.S. stocks sit in a “historic bear market” once priced in ounces, not dollars, and that central banks are quietly replacing the greenback with metal. Gold’s one‑day vertical move has become a brutal referendum on U.S. equities, with economist Peter Schiff arguing that investors are already deep in a “historic bear market” once you strip out inflation and price stocks in ounces rather than in dollars. Spot gold briefly spiked to fresh records near $5,590 before closing at $5,414, up $235 on the session — the biggest single‑day dollar gain in the metal’s history. On X, Schiff framed the move as a reality check for equity bulls. “The Dow is now worth just 9 ounces of gold, its lowest level since 2013 and nearly 80% below its record high priced in gold in 1999,” he wrote, warning investors: “Don’t be fooled by inflation. This is a historic bear market!” In 1999, the Dow’s 5,117.12 level versus gold at $285.65 implied roughly 17.9 ounces; today, around 49,015.60 on the index against $5,556.12 per ounce drags that ratio down to 8.8. The message is simple and uncomfortable: nominal highs in U.S. stocks conceal a long erosion of real purchasing power when benchmarked against a hard asset. The macro backdrop justifies the alarm. The Federal Reserve left its policy rate unchanged at 3.50%–3.75% at the January FOMC meeting, pausing after three consecutive cuts even as it concedes inflation remains “somewhat elevated.” At the same time, central banks are stockpiling gold at roughly 60 tons per month, helping bullion overtake the euro as the second‑largest reserve asset behind the dollar amid mounting fiscal, geopolitical and currency‑credibility concerns. That structural bid has turned the metal’s chart into what one strategist called a “parabolic” expression of global anxiety over deficits, de‑dollarization and the long‑term value of paper claims.",
      "full_text": "Gold’s vertical spike to fresh records is Peter Schiff’s proof that U.S. stocks sit in a “historic bear market” once priced in ounces, not dollars, and that central banks are quietly replacing the greenback with metal. Gold’s one‑day vertical move has become a brutal referendum on U.S. equities, with economist Peter Schiff arguing that investors are already deep in a “historic bear market” once you strip out inflation and price stocks in ounces rather than in dollars. Spot gold briefly spiked to fresh records near $5,590 before closing at $5,414, up $235 on the session — the biggest single‑day dollar gain in the metal’s history. On X, Schiff framed the move as a reality check for equity bulls. “The Dow is now worth just 9 ounces of gold, its lowest level since 2013 and nearly 80% below its record high priced in gold in 1999,” he wrote, warning investors: “Don’t be fooled by inflation. This is a historic bear market!” In 1999, the Dow’s 5,117.12 level versus gold at $285.65 implied roughly 17.9 ounces; today, around 49,015.60 on the index against $5,556.12 per ounce drags that ratio down to 8.8. The message is simple and uncomfortable: nominal highs in U.S. stocks conceal a long erosion of real purchasing power when benchmarked against a hard asset. The macro backdrop justifies the alarm. The Federal Reserve left its policy rate unchanged at 3.50%–3.75% at the January FOMC meeting, pausing after three consecutive cuts even as it concedes inflation remains “somewhat elevated.” At the same time, central banks are stockpiling gold at roughly 60 tons per month, helping bullion overtake the euro as the second‑largest reserve asset behind the dollar amid mounting fiscal, geopolitical and currency‑credibility concerns. That structural bid has turned the metal’s chart into what one strategist called a “parabolic” expression of global anxiety over deficits, de‑dollarization and the long‑term value of paper claims. Crypto is absorbing the same shock through its plumbing and politics rather than through a parallel melt‑up in prices. In Washington, a broad crypto bill has advanced out of the Senate Agriculture Committee but faces stiff resistance over how to divide oversight between securities and commodities regulators — a fight that will shape everything from exchange supervision to the future of “digital gold” narratives. In London and Brussels, detailed rulebooks for stablecoins and payment tokens are pushing issuers toward bank‑style capital, reserve and governance standards, effectively turning once‑shadowy dollar substitutes into regulated extensions of the traditional system. Under the surface, prediction markets and DeFi data suggest a market bracing for turbulence rather than euphoria. Research desks flag that crypto‑linked prediction markets currently price months of range‑bound chop instead of an imminent blow‑off top, even as volatility creeps higher and the total digital‑asset market cap stagnates in the mid‑trillion band. Recent sell‑offs have already forced sizable liquidations across major lending and perpetuals platforms as coins briefly sliced through key psychological levels, a reminder that leverage, not conviction, still drives large parts of the ecosystem. In that context, Schiff’s “historic bear market” language lands in a world where gold is screaming macro stress, equities are celebrating nominal highs, and crypto is quietly being rewired by regulators and market structure. The common thread is a slow, grinding repricing of what constitutes safety: central banks doubling down on metal, lawmakers dragging crypto into the rulebook, and investors discovering that in real terms, the line between bull and bear depends less on index levels than on what your assets can still buy when measured against something that does not print. Best crypto platforms What crypto treasuries must do to survive as the hype dies | Opinion Trump’s tariffs: Boosting or hurting XRP price? Capital without borders: Decentralized crowdfunding thrives in global turmoil | Opinion Meet Jingliang Su, Chinese man gets 46 months sentence for $36.9M crypto scam Intelligence on the chain: AI must become a tokenized asset | Opinion Will TRUMP Coin rally ahead of Melania Trump movie release? The future of Bitcoin treasury depends on strategy, not price | Opinion Cross-chain isn’t democratizing crypto, it’s rewarding a few | Opinion GameStop transfers Bitcoin to Coinbase, Senate Democrats amend crypto bill, UK finalizes regulation consultation | Weekly Recap Crypto companies can’t afford inexperienced marketers in a regulated era | Opinion Crypto traders face high‑beta whiplash as silver crash hits markets Dogecoin traders face make-or-break test at $0.12–$0.14 Altcoin market cap faces make-or-break test as top 10 hit 82% share Get crypto market analysis and curated news delivered right to your inbox every week. You have successfully joined our subscriber list. Sign up for our free newsletters"
    },
    {
      "title": "Crypto traders face high‑beta whiplash as silver crash hits markets",
      "source": "Crypto.News",
      "summary": "A violent silver liquidation erased over $1.1t across metals, ETFs, and crypto in under 24 hours, triggering $770m in crypto long liquidations and raising the question of whether this was a structural break or a brutal but familiar leverage reset. A brutal liquidation in silver has just delivered the kind of cross‑asset rupture traders usually associate with crypto, erasing more than $1.1 trillion in market value in under 24 hours and transmitting stress into gold, ETFs, and digital assets. The question now dominating desks is whether this was a structural break or simply a violent, if familiar, deleveraging shock. ​ Market participants quoted in the report describe the move as “one of the most violent market events of the year,” driven primarily by “forced selling and leverage unwind, not a fundamental breakdown in silver demand.” As prices slipped, margin calls ricocheted through futures and options books, turning a sharp correction into a near‑vertical collapse. One emblematic datapoint was the full liquidation of an $11 million silver long position; once that trade tripped its thresholds, “selling became mechanical — not discretionary.” ​ Structurally, silver’s role as a higher‑beta proxy for gold magnified the pain. Speculative longs had crowded into a thinner market, meaning that once volatility spiked, depth evaporated and price discovery became synonymous with forced exits. ​ Gold was pulled into the downdraft as well, with roughly $4 trillion in market value erased during the same window. That does not necessarily mark a failure of the safe‑haven story; as one strategist noted, “gold often sells alongside risk assets during leverage cascades,” because investors are raising cash to meet margins, not abandoning hedges. A similar pattern has shown up repeatedly in macro‑driven moves covered by crypto.news, including analyses of broad crypto market crashes, macro‑linked BTC btc -0.41% Bitcoin drawdowns, and derivatives‑led liquidation waves. As metals cracked, crypto once again acted as the “high‑beta liquidity release valve” of the system.",
      "full_text": "A violent silver liquidation erased over $1.1t across metals, ETFs, and crypto in under 24 hours, triggering $770m in crypto long liquidations and raising the question of whether this was a structural break or a brutal but familiar leverage reset. A brutal liquidation in silver has just delivered the kind of cross‑asset rupture traders usually associate with crypto, erasing more than $1.1 trillion in market value in under 24 hours and transmitting stress into gold, ETFs, and digital assets. The question now dominating desks is whether this was a structural break or simply a violent, if familiar, deleveraging shock. ​ Market participants quoted in the report describe the move as “one of the most violent market events of the year,” driven primarily by “forced selling and leverage unwind, not a fundamental breakdown in silver demand.” As prices slipped, margin calls ricocheted through futures and options books, turning a sharp correction into a near‑vertical collapse. One emblematic datapoint was the full liquidation of an $11 million silver long position; once that trade tripped its thresholds, “selling became mechanical — not discretionary.” ​ Structurally, silver’s role as a higher‑beta proxy for gold magnified the pain. Speculative longs had crowded into a thinner market, meaning that once volatility spiked, depth evaporated and price discovery became synonymous with forced exits. ​ Gold was pulled into the downdraft as well, with roughly $4 trillion in market value erased during the same window. That does not necessarily mark a failure of the safe‑haven story; as one strategist noted, “gold often sells alongside risk assets during leverage cascades,” because investors are raising cash to meet margins, not abandoning hedges. A similar pattern has shown up repeatedly in macro‑driven moves covered by crypto.news, including analyses of broad crypto market crashes, macro‑linked BTC btc -0.41% Bitcoin drawdowns, and derivatives‑led liquidation waves. As metals cracked, crypto once again acted as the “high‑beta liquidity release valve” of the system. Over $770 million in crypto long positions were liquidated in under 30 minutes, and majors slid in tandem with silver rather than on any token‑specific catalyst. ​ Bitcoin ( BTC ) is hovering around $82,000–$83,000, having dipped into the high‑$70,000s intraday, with tens of billions of dollars in 24‑hour volume as traders cut leverage and reposition into the weekend. Ethereum ( ETH ) changes hands near $2,700–$2,800, down from levels closer to $2,900–$3,000 a day earlier, on double‑digit billions in turnover across majors. Solana ( SOL ) trades around $115, after swinging roughly between $113 and $123 over the last 24 hours as perp funding resets and spot liquidity thins. This parabolic metals move comes as digital assets continue to trade as the purest expression of macro risk appetite. Bitcoin ( BTC ) around the low‑$80,000s, Ethereum ( ETH ) just below $3,000, and Solana ( SOL ) in the low‑hundreds all underscore how quickly positioning adjusts when cross‑asset volatility spikes. Best crypto platforms What crypto treasuries must do to survive as the hype dies | Opinion Trump’s tariffs: Boosting or hurting XRP price? Capital without borders: Decentralized crowdfunding thrives in global turmoil | Opinion Meet Jingliang Su, Chinese man gets 46 months sentence for $36.9M crypto scam Intelligence on the chain: AI must become a tokenized asset | Opinion Will TRUMP Coin rally ahead of Melania Trump movie release? The future of Bitcoin treasury depends on strategy, not price | Opinion Cross-chain isn’t democratizing crypto, it’s rewarding a few | Opinion GameStop transfers Bitcoin to Coinbase, Senate Democrats amend crypto bill, UK finalizes regulation consultation | Weekly Recap Crypto companies can’t afford inexperienced marketers in a regulated era | Opinion Goldbug Peter Schiff says the U.S. dollar is facing massive deleveraging as metals surge and crypto stalls Altcoin market cap faces make-or-break test as top 10 hit 82% share Andean Medjedovic faces make-or-break manhunt after $65m DeFi hacks Get crypto market analysis and curated news delivered right to your inbox every week. You have successfully joined our subscriber list. Sign up for our free newsletters"
    },
    {
      "title": "Dogecoin traders face make-or-break test at $0.12–$0.14",
      "source": "Crypto.News",
      "summary": "Dogecoin’s slide into a long descending channel has put $0.12–$0.14 support in focus, with analysts warning a clean break lower could turn controlled drift into a sharp flush. Dogecoin’s doge -0.26% Dogecoin latest drawdown has pushed the original meme coin back into the danger zone, with technicians warning that one more slip inside its grinding downtrend could turn controlled weakness into an outright flush. ​ In a recent TradingView update, crypto analyst KrissPax said Dogecoin “remains weak and could extend its already intense downtrend if its price fails to recover,” after months of trading inside a broad descending channel. He traces the pattern back to October 10, 2025, when DOGE “recorded one of its largest single‑day price crashes, falling from above $0.26 to below $0.10 before quickly recovering,” a shock that has defined its current structure. ​ Since then, every push toward the upper band has met supply, keeping “selling pressure intact and prevent[ing] the DOGE price from building sustained upward momentum.” Without “a solid bullish catalyst to drive the price upward,” KrissPax cautions that “the meme coin could experience another price crash” if support inside the channel gives way. ​ On higher time frames, the analyst highlights a fragile base “forming around $0.12–$0.14,” roughly along the mid‑line of the channel. ​ In his view, “a clear break below the lower trendline of the channel would confirm the continuation of Dogecoin’s prolonged downtrend,” while only “a breakout above the upper trendline of the descending channel with volume confirmation could invalidate DOGE’s bearish structure and signal a potential trend change.” ​ Spot data show Dogecoin trading near $0.114, down a little over 3% in the last 24 hours, with market cap slipping to about $16.6b and volumes around $2.0b on the day, according to CoinMarketCap. ​That move comes just as broader markets digest a fresh wave of forced deleveraging, after a crypto‑wide liquidation cascade wiped out roughly $1.7b of leveraged positions in under 24 hours. ​ This parabolic move comes as digital assets continue to trade as the purest expression of macro risk appetite. Bitcoin btc -0.41% Bitcoin is hovering around $82,197, with a 24‑hour high near $84,000 and a low just above $80,000, on roughly $81.6b in turnover.",
      "full_text": "Dogecoin’s slide into a long descending channel has put $0.12–$0.14 support in focus, with analysts warning a clean break lower could turn controlled drift into a sharp flush. Dogecoin’s doge -0.26% Dogecoin latest drawdown has pushed the original meme coin back into the danger zone, with technicians warning that one more slip inside its grinding downtrend could turn controlled weakness into an outright flush. ​ In a recent TradingView update, crypto analyst KrissPax said Dogecoin “remains weak and could extend its already intense downtrend if its price fails to recover,” after months of trading inside a broad descending channel. He traces the pattern back to October 10, 2025, when DOGE “recorded one of its largest single‑day price crashes, falling from above $0.26 to below $0.10 before quickly recovering,” a shock that has defined its current structure. ​ Since then, every push toward the upper band has met supply, keeping “selling pressure intact and prevent[ing] the DOGE price from building sustained upward momentum.” Without “a solid bullish catalyst to drive the price upward,” KrissPax cautions that “the meme coin could experience another price crash” if support inside the channel gives way. ​ On higher time frames, the analyst highlights a fragile base “forming around $0.12–$0.14,” roughly along the mid‑line of the channel. ​ In his view, “a clear break below the lower trendline of the channel would confirm the continuation of Dogecoin’s prolonged downtrend,” while only “a breakout above the upper trendline of the descending channel with volume confirmation could invalidate DOGE’s bearish structure and signal a potential trend change.” ​ Spot data show Dogecoin trading near $0.114, down a little over 3% in the last 24 hours, with market cap slipping to about $16.6b and volumes around $2.0b on the day, according to CoinMarketCap. ​That move comes just as broader markets digest a fresh wave of forced deleveraging, after a crypto‑wide liquidation cascade wiped out roughly $1.7b of leveraged positions in under 24 hours. ​ This parabolic move comes as digital assets continue to trade as the purest expression of macro risk appetite. Bitcoin btc -0.41% Bitcoin is hovering around $82,197, with a 24‑hour high near $84,000 and a low just above $80,000, on roughly $81.6b in turnover. ​ Ethereum eth -3.99% Ethereum changes hands near $2,800, with a sharp January sell‑off leaving the token down roughly 6–7% over the past 24 hours. ​ Dogecoin’s weakness slots into that risk‑off backdrop, as traders rotate out of high‑beta meme assets and into more liquid majors after the latest “crypto market crash wiped out $1.7 billion in leveraged bets.” ​ For now, DOGE’s chart is less about blue‑sky targets and more about survival: if the current band fails, the structure starts to look less like a consolidation and more like the prelude to another “price crash” of the kind that has repeatedly blindsided late‑cycle meme‑coin buyers. Best crypto platforms The machine economy: AI will benefit crypto, or break it | Opinion What crypto treasuries must do to survive as the hype dies | Opinion Trump’s tariffs: Boosting or hurting XRP price? Capital without borders: Decentralized crowdfunding thrives in global turmoil | Opinion Meet Jingliang Su, Chinese man gets 46 months sentence for $36.9M crypto scam Intelligence on the chain: AI must become a tokenized asset | Opinion Will TRUMP Coin rally ahead of Melania Trump movie release? The future of Bitcoin treasury depends on strategy, not price | Opinion Cross-chain isn’t democratizing crypto, it’s rewarding a few | Opinion GameStop transfers Bitcoin to Coinbase, Senate Democrats amend crypto bill, UK finalizes regulation consultation | Weekly Recap Goldbug Peter Schiff says the U.S. dollar is facing massive deleveraging as metals surge and crypto stalls Altcoin market cap faces make-or-break test as top 10 hit 82% share OSL Group faces expansion push after $200m stablecoin funding Get crypto market analysis and curated news delivered right to your inbox every week. You have successfully joined our subscriber list. Sign up for our free newsletters"
    },
    {
      "title": "OSL Group faces expansion push after $200m stablecoin funding",
      "source": "Crypto.News",
      "summary": "OSL Group raised $200m to scale institutional stablecoin trading, payments products, and licensed acquisitions, doubling down on compliance-first digital asset infrastructure. OSL Group announced Thursday it has closed a $200 million equity financing round to fund expansion of its stablecoin trading and digital payments operations, according to a company disclosure. The Hong Kong-listed digital asset firm plans to deploy the capital for acquisitions, global market expansion and product development focused on payments and stablecoins, the company stated. “Beyond strengthening our capital base and diversifying our shareholder structure, these funds will enable us to seize timely opportunities to acquire licensed trading,” Ivan Wong, chief financial officer of OSL Group, said in the disclosure. Wong added the financing reinforces the firm’s compliance-driven global strategy and provides flexibility as new payment use cases emerge. OSL outlined five priority areas for the new funding: expansion of stablecoin trading services for institutional clients; growth of digital payment operations across global markets; acquisition of licensed trading and payment firms; continued investment in core technology systems; and additional working capital to support daily operations. The financing comes as digital asset firms with licensed payment capabilities attract increased interest amid tightening regulatory oversight worldwide. Blockchain settlement systems offer faster transaction processing compared to traditional payment infrastructure, according to industry observers. Earlier this year, OSL completed a prior equity financing round that set a regional record in the cryptocurrency sector, according to the company. Management has positioned stablecoins as a bridge between traditional finance and decentralized finance, focusing on building regulated systems for stablecoin trading and payments.",
      "full_text": "OSL Group raised $200m to scale institutional stablecoin trading, payments products, and licensed acquisitions, doubling down on compliance-first digital asset infrastructure. OSL Group announced Thursday it has closed a $200 million equity financing round to fund expansion of its stablecoin trading and digital payments operations, according to a company disclosure. The Hong Kong-listed digital asset firm plans to deploy the capital for acquisitions, global market expansion and product development focused on payments and stablecoins, the company stated. “Beyond strengthening our capital base and diversifying our shareholder structure, these funds will enable us to seize timely opportunities to acquire licensed trading,” Ivan Wong, chief financial officer of OSL Group, said in the disclosure. Wong added the financing reinforces the firm’s compliance-driven global strategy and provides flexibility as new payment use cases emerge. OSL outlined five priority areas for the new funding: expansion of stablecoin trading services for institutional clients; growth of digital payment operations across global markets; acquisition of licensed trading and payment firms; continued investment in core technology systems; and additional working capital to support daily operations. The financing comes as digital asset firms with licensed payment capabilities attract increased interest amid tightening regulatory oversight worldwide. Blockchain settlement systems offer faster transaction processing compared to traditional payment infrastructure, according to industry observers. Earlier this year, OSL completed a prior equity financing round that set a regional record in the cryptocurrency sector, according to the company. Management has positioned stablecoins as a bridge between traditional finance and decentralized finance, focusing on building regulated systems for stablecoin trading and payments. The firm aims to support compliant movement between fiat and digital currencies while serving enterprises and financial institutions seeking alternative payment options, according to company statements. Last year, OSL completed the acquisition of Banxa, a Web3 payments provider, strengthening its presence in crypto-enabled payment services. The company also launched OSL BizPay, a business-focused payments product designed for corporate and institutional users. Best crypto platforms What crypto treasuries must do to survive as the hype dies | Opinion Trump’s tariffs: Boosting or hurting XRP price? Capital without borders: Decentralized crowdfunding thrives in global turmoil | Opinion Meet Jingliang Su, Chinese man gets 46 months sentence for $36.9M crypto scam Intelligence on the chain: AI must become a tokenized asset | Opinion Will TRUMP Coin rally ahead of Melania Trump movie release? The future of Bitcoin treasury depends on strategy, not price | Opinion Cross-chain isn’t democratizing crypto, it’s rewarding a few | Opinion GameStop transfers Bitcoin to Coinbase, Senate Democrats amend crypto bill, UK finalizes regulation consultation | Weekly Recap Crypto companies can’t afford inexperienced marketers in a regulated era | Opinion Goldbug Peter Schiff says the U.S. dollar is facing massive deleveraging as metals surge and crypto stalls Bitcoin price risks drop to $65,000 as weekly trend shifts bearish Dogecoin traders face make-or-break test at $0.12–$0.14 Get crypto market analysis and curated news delivered right to your inbox every week. You have successfully joined our subscriber list. Sign up for our free newsletters"
    },
    {
      "title": "Andean Medjedovic faces make-or-break manhunt after $65m DeFi hacks",
      "source": "Crypto.News",
      "summary": "A 22-year-old Canadian accused of draining $65m from KyberSwap and Indexed Finance vanished from Serbian custody after a globe-spanning manhunt and stalled extradition. A 22-year-old Canadian charged with defrauding two decentralized finance protocols of $65 million has disappeared from Serbian custody following his arrest, according to court documents unsealed this week. Andean Medjedovic, a Hamilton native who earned a master’s degree in pure mathematics at age 18, faces charges in multiple jurisdictions. His current whereabouts remain unknown, according to authorities. The criminal indictment alleges Medjedovic manipulated two decentralized finance protocols to obtain approximately $65 million in funds from the protocols’ investors. Medjedovic was arrested in Belgrade in August 2024, ending a four-year period of evasion, before escaping from custody while authorities pursued extradition proceedings. According to the indictment, the alleged crimes began in October 2021 when Medjedovic manipulated Indexed Finance’s index pools using borrowed cryptocurrencies, draining over $16.5 million from investors. The following year, he allegedly conspired with an unnamed accomplice to launder the stolen funds through fraudulent exchange accounts and cryptocurrency mixers. The most significant alleged theft occurred in November 2023, when Medjedovic reportedly exploited KyberSwap’s code to artificially manipulate prices in the protocol’s liquidity pools, according to the United States Attorney’s Office. “Medjedovic then calculated precise combinations of trades that would cause the KyberSwap AMM to ‘glitch,’ in his words, allowing him to steal tens of millions of dollars in cryptocurrency from the liquidity pools,” the United States Attorney’s Office stated.",
      "full_text": "A 22-year-old Canadian accused of draining $65m from KyberSwap and Indexed Finance vanished from Serbian custody after a globe-spanning manhunt and stalled extradition. A 22-year-old Canadian charged with defrauding two decentralized finance protocols of $65 million has disappeared from Serbian custody following his arrest, according to court documents unsealed this week. Andean Medjedovic, a Hamilton native who earned a master’s degree in pure mathematics at age 18, faces charges in multiple jurisdictions. His current whereabouts remain unknown, according to authorities. The criminal indictment alleges Medjedovic manipulated two decentralized finance protocols to obtain approximately $65 million in funds from the protocols’ investors. Medjedovic was arrested in Belgrade in August 2024, ending a four-year period of evasion, before escaping from custody while authorities pursued extradition proceedings. According to the indictment, the alleged crimes began in October 2021 when Medjedovic manipulated Indexed Finance’s index pools using borrowed cryptocurrencies, draining over $16.5 million from investors. The following year, he allegedly conspired with an unnamed accomplice to launder the stolen funds through fraudulent exchange accounts and cryptocurrency mixers. The most significant alleged theft occurred in November 2023, when Medjedovic reportedly exploited KyberSwap’s code to artificially manipulate prices in the protocol’s liquidity pools, according to the United States Attorney’s Office. “Medjedovic then calculated precise combinations of trades that would cause the KyberSwap AMM to ‘glitch,’ in his words, allowing him to steal tens of millions of dollars in cryptocurrency from the liquidity pools,” the United States Attorney’s Office stated. The Vietnam-based platform lost $48.8 million in the attack, according to company reports. Shortly after the incident, the attacker sent a public message stating: “Negotiations will start in a few hours when I am fully rested. Thank you.” KyberSwap offered a standard 10 percent bug bounty, which Medjedovic rejected, according to the indictment. He allegedly demanded complete control of the Kyber platform and offered to return 50 percent to investors. The KyberSwap team worked with owners of frontrun bots that extracted funds from KyberSwap pools on Polygon and Avalanche during the exploit to recover user funds, the company reported . Dutch authorities traced the hack to a hotel in The Hague, where Medjedovic allegedly checked in using a fake Slovak passport, according to court documents. Two weeks after his flight departed Amsterdam for Kuwait via Istanbul in late November 2023, Dutch authorities issued a European arrest warrant, followed by an Interpol Red Notice. Court documents reveal Medjedovic traveled to Brazil, Dubai, Spain, Bosnia, and Serbia during the intervening years. Medjedovic was arrested on August 9, 2024, when he arrived in Belgrade using the alias “Lorenzo” to book an apartment, according to authorities. Interpol Belgrade immediately contacted Dutch authorities upon his arrest. During extradition proceedings at the Belgrade Higher Court, Medjedovic denied all accusations. “I do not wish to go to the Netherlands,” he stated, adding that “I would like to have children in Serbia and to achieve some more things here.” He claimed he had been in Dubai for four months and had visited the Netherlands for three months “on a tourist trip.” Despite his Canadian nationality, Medjedovic told the court he holds only a Bosnian passport. The U.S. indictment revealed Medjedovic maintained detailed files documenting the alleged schemes, including one titled “moneyMovementSystem” with step-by-step instructions for laundering cryptocurrency through mixers. He allegedly wrote notes to “make a new bank account under a fake ID” and “order documents online (Russian + Brazilian + American citizen).” As of this publication, Medjedovic has disappeared from Serbian custody, and the stolen $65 million remains dormant in cryptocurrency wallets, according to blockchain tracking data. “He needs to be perfect from here until eternity in obfuscating the proceeds of this exploit, which are being tracked,” said Kyle Armstrong, a former FBI agent at blockchain intelligence firm TRM Labs. Ari Redbord, TRM’s global head of policy, noted that modern digital tracking makes prolonged evasion increasingly difficult. “The reality is that at some point you come in and you fall on your sword and potentially do everything you can to ultimately help the government,” he said. If convicted and Medjedovic refuses to cooperate by returning funds and taking responsibility, he could face more than 10 years in prison, according to federal sentencing guidelines. Best crypto platforms What crypto treasuries must do to survive as the hype dies | Opinion Trump’s tariffs: Boosting or hurting XRP price? Capital without borders: Decentralized crowdfunding thrives in global turmoil | Opinion Meet Jingliang S"
    },
    {
      "title": "Tron faces strategic shift as Justin Sun plans to boost Bitcoin holdings",
      "source": "Crypto.News",
      "summary": "Tron founder Justin Sun says the ecosystem will increase its Bitcoin holdings after Binance’s call for sector-wide BTC treasuries, signaling a shift toward Bitcoin as a reserve asset. Justin Sun, founder of the Tron blockchain network, announced plans for the Tron ecosystem to increase its Bitcoin holdings, according to a statement posted on social media. Sun stated the decision was made in response to a call from cryptocurrency exchange Binance to the sector, though specific investment amounts and timelines were not disclosed. The announcement adds Tron to a growing list of blockchain projects and companies incorporating Bitcoin into their treasury management strategies. The move represents a shift among some blockchain networks toward viewing Bitcoin btc -0.2% Bitcoin as a strategic reserve asset rather than a competing cryptocurrency. The Tron network processes a significant portion of global stablecoin transfers and hosts various decentralized finance applications. The network’s stablecoin usage has positioned it as a major player in the cryptocurrency infrastructure space. Bitcoin’s fixed supply cap of 21 million coins and increasing adoption by institutional investors have made it an attractive reserve asset for corporate treasuries, according to market observers. Sun has previously advocated for interoperability between different blockchain networks and has described Bitcoin as a foundational element of the cryptocurrency ecosystem. Market analysts noted that while Tron’s Bitcoin purchases may have limited immediate price impact, the move could signal growing confidence in Bitcoin among institutional and semi-institutional entities in the cryptocurrency sector.",
      "full_text": "Tron founder Justin Sun says the ecosystem will increase its Bitcoin holdings after Binance’s call for sector-wide BTC treasuries, signaling a shift toward Bitcoin as a reserve asset. Justin Sun, founder of the Tron blockchain network, announced plans for the Tron ecosystem to increase its Bitcoin holdings, according to a statement posted on social media. Sun stated the decision was made in response to a call from cryptocurrency exchange Binance to the sector, though specific investment amounts and timelines were not disclosed. The announcement adds Tron to a growing list of blockchain projects and companies incorporating Bitcoin into their treasury management strategies. The move represents a shift among some blockchain networks toward viewing Bitcoin btc -0.2% Bitcoin as a strategic reserve asset rather than a competing cryptocurrency. The Tron network processes a significant portion of global stablecoin transfers and hosts various decentralized finance applications. The network’s stablecoin usage has positioned it as a major player in the cryptocurrency infrastructure space. Bitcoin’s fixed supply cap of 21 million coins and increasing adoption by institutional investors have made it an attractive reserve asset for corporate treasuries, according to market observers. Sun has previously advocated for interoperability between different blockchain networks and has described Bitcoin as a foundational element of the cryptocurrency ecosystem. Market analysts noted that while Tron’s Bitcoin purchases may have limited immediate price impact, the move could signal growing confidence in Bitcoin among institutional and semi-institutional entities in the cryptocurrency sector. The strategy follows similar approaches by other entities in the digital asset space that have adopted Bitcoin as a treasury reserve asset. Binance has promoted this approach within the cryptocurrency industry. Best crypto platforms What crypto treasuries must do to survive as the hype dies | Opinion Trump’s tariffs: Boosting or hurting XRP price? Capital without borders: Decentralized crowdfunding thrives in global turmoil | Opinion Meet Jingliang Su, Chinese man gets 46 months sentence for $36.9M crypto scam Intelligence on the chain: AI must become a tokenized asset | Opinion Will TRUMP Coin rally ahead of Melania Trump movie release? The future of Bitcoin treasury depends on strategy, not price | Opinion Cross-chain isn’t democratizing crypto, it’s rewarding a few | Opinion GameStop transfers Bitcoin to Coinbase, Senate Democrats amend crypto bill, UK finalizes regulation consultation | Weekly Recap Crypto companies can’t afford inexperienced marketers in a regulated era | Opinion Goldbug Peter Schiff says the U.S. dollar is facing massive deleveraging as metals surge and crypto stalls Crypto traders face high‑beta whiplash as silver crash hits markets Dogecoin traders face make-or-break test at $0.12–$0.14 Get crypto market analysis and curated news delivered right to your inbox every week. You have successfully joined our subscriber list. Sign up for our free newsletters"
    },
    {
      "title": "Bybit’s 2026 roadmap shows expansion beyond exchange model",
      "source": "Crypto.News",
      "summary": "Disclosure: This article does not represent investment advice. The content and materials featured on this page are for educational purposes only. Bybit has outlined a plan to expand beyond crypto trading, positioning itself as a broader financial platform spanning banking, custody, and cross-border services by 2026. Crypto exchange Bybit today announced its 2026 transformation into “The New Financial Platform.” Bybit describes this as a global financial ecosystem designed to expand access to modern banking, investment, and payments infrastructure for the world’s underserved populations. The vision was unveiled by its co-founder and CEO Ben Zhou during the biannual keynote session. At the center of the strategy is a long-term mission: empowering the 1.4 billion underbanked people globally by reducing barriers to participation in modern finance. A cornerstone of this initiative is MyBank, Bybit’s new retail banking layer, targeting a launch in February 2026. MyBank provides dedicated accounts that simplify large-value fiat on- and off-ramps while enabling everyday financial transactions across borders under the compliance framework. The service is designed to address real-world problems faced by users in emerging markets: slow transfers, limited access, high fees, and limited products. According to Bybit, MyBank aims to enable faster and more cost-efficient capital utilization for individuals and businesses with bank-grade experience.",
      "full_text": "Disclosure: This article does not represent investment advice. The content and materials featured on this page are for educational purposes only. Bybit has outlined a plan to expand beyond crypto trading, positioning itself as a broader financial platform spanning banking, custody, and cross-border services by 2026. Crypto exchange Bybit today announced its 2026 transformation into “The New Financial Platform.” Bybit describes this as a global financial ecosystem designed to expand access to modern banking, investment, and payments infrastructure for the world’s underserved populations. The vision was unveiled by its co-founder and CEO Ben Zhou during the biannual keynote session. At the center of the strategy is a long-term mission: empowering the 1.4 billion underbanked people globally by reducing barriers to participation in modern finance. A cornerstone of this initiative is MyBank, Bybit’s new retail banking layer, targeting a launch in February 2026. MyBank provides dedicated accounts that simplify large-value fiat on- and off-ramps while enabling everyday financial transactions across borders under the compliance framework. The service is designed to address real-world problems faced by users in emerging markets: slow transfers, limited access, high fees, and limited products. According to Bybit, MyBank aims to enable faster and more cost-efficient capital utilization for individuals and businesses with bank-grade experience. Bybit’s institutional custody framework, ByCustody, supports over $5 billion in assets managed by over 30 professional asset managers on the platform. The custody architecture supports secure segregation of client assets, enabling institutions and private wealth clients to operate with traditional financial safeguards while accessing digital markets. More than 2,000 institutions now use Bybit’s infrastructure, a 100% year-over-year increase. This trend reflects a growing demand for hybrid financial platforms that bridge traditional and digital asset ecosystems. Disclosure: This content is provided by a third party. Neither crypto.news nor the author of this article endorses any product mentioned on this page. Users should conduct their own research before taking any action related to the company. Best crypto platforms What crypto treasuries must do to survive as the hype dies | Opinion Trump’s tariffs: Boosting or hurting XRP price? Capital without borders: Decentralized crowdfunding thrives in global turmoil | Opinion Meet Jingliang Su, Chinese man gets 46 months sentence for $36.9M crypto scam Intelligence on the chain: AI must become a tokenized asset | Opinion Will TRUMP Coin rally ahead of Melania Trump movie release? The future of Bitcoin treasury depends on strategy, not price | Opinion Cross-chain isn’t democratizing crypto, it’s rewarding a few | Opinion GameStop transfers Bitcoin to Coinbase, Senate Democrats amend crypto bill, UK finalizes regulation consultation | Weekly Recap Crypto companies can’t afford inexperienced marketers in a regulated era | Opinion Bybit to launch retail banking services with IBAN accounts in February From halvings to macro: inside Bybit’s 2026 crypto outlook Trust Wallet begins hack compensation, Coinbase arrests former agent, Uniswap activates protocol fees | Weekly Recap Get crypto market analysis and curated news delivered right to your inbox every week. You have successfully joined our subscriber list. Sign up for our free newsletters"
    },
    {
      "title": "Who Is the next Fed Chairman? Trump expected to pick Kevin Warsh",
      "source": "Crypto.News",
      "summary": "Trump is poised to nominate former Fed governor and Morgan Stanley banker Kevin Warsh as the next Fed chair, raising questions over central bank independence and market reaction. President Donald Trump is poised to put a close ally of Wall Street at the helm of the US Federal Reserve, with advisers saying he is expected to nominate former Fed governor Kevin Warsh as the next chair as soon as Friday. Trump, who has cycled through favored candidates for months, told reporters he had settled on “a really great choice” and promised “somebody that is very respected, somebody that’s known to everybody in the financial world.” Warsh, a former Morgan Stanley banker who served five years on the Fed’s Board after being nominated by President George W. Bush, met Trump at the White House on Thursday in what officials described as the final step before an announcement. “A lot of people think that this is somebody that could have been there a few years ago,” Trump added, in a thinly veiled reference to his 2017 decision to hand the job to Jerome Powell instead. Warsh’s emergence caps a process that came down to four contenders: Warsh, National Economic Council director Kevin Hassett, BlackRock executive Rick Rieder, and current Fed governor Christopher Waller. Several aides cautioned that “nothing was final until announced by Trump directly,” noting the president has repeatedly shifted his preference as he weighed loyalty, optics and market reaction. Yet preparations for a White House rollout were underway Thursday night, underscoring how far the Warsh bid has advanced. ​ The choice lands against a fraught backdrop in Washington. Trump has “attacked and criticized” Powell and the central bank “relentlessly throughout the first year of his second term,” raising fresh questions over how much independence any successor will be allowed to exercise. Warsh, who has long been floated for top roles in both Trump administrations and was even seen as a potential Treasury secretary before Trump tapped Scott Bessent, “looked the part,” the president told associates after their December interview.",
      "full_text": "Trump is poised to nominate former Fed governor and Morgan Stanley banker Kevin Warsh as the next Fed chair, raising questions over central bank independence and market reaction. President Donald Trump is poised to put a close ally of Wall Street at the helm of the US Federal Reserve, with advisers saying he is expected to nominate former Fed governor Kevin Warsh as the next chair as soon as Friday. Trump, who has cycled through favored candidates for months, told reporters he had settled on “a really great choice” and promised “somebody that is very respected, somebody that’s known to everybody in the financial world.” Warsh, a former Morgan Stanley banker who served five years on the Fed’s Board after being nominated by President George W. Bush, met Trump at the White House on Thursday in what officials described as the final step before an announcement. “A lot of people think that this is somebody that could have been there a few years ago,” Trump added, in a thinly veiled reference to his 2017 decision to hand the job to Jerome Powell instead. Warsh’s emergence caps a process that came down to four contenders: Warsh, National Economic Council director Kevin Hassett, BlackRock executive Rick Rieder, and current Fed governor Christopher Waller. Several aides cautioned that “nothing was final until announced by Trump directly,” noting the president has repeatedly shifted his preference as he weighed loyalty, optics and market reaction. Yet preparations for a White House rollout were underway Thursday night, underscoring how far the Warsh bid has advanced. ​ The choice lands against a fraught backdrop in Washington. Trump has “attacked and criticized” Powell and the central bank “relentlessly throughout the first year of his second term,” raising fresh questions over how much independence any successor will be allowed to exercise. Warsh, who has long been floated for top roles in both Trump administrations and was even seen as a potential Treasury secretary before Trump tapped Scott Bessent, “looked the part,” the president told associates after their December interview. ​ This parabolic move comes as digital assets continue to trade as the purest expression of macro risk appetite. Bitcoin btc -0.2% Bitcoin is hovering around $82,536, with 24‑hour moves near -2.2% and roughly $80.7B in trading volumes. Ethereum eth -3.99% Ethereum last changed hands close to $2,722, down about 9% over the past day. Solana sol 0.1% Solana trades around $192 on major USD pairs, with recent 24‑hour ranges clustered roughly between $185 and $194. For broader context on how ETF positioning can reshape liquidity, some analysts point to XRP structures, mirroring patterns flagged when $1b mark was first absorbed by spot ETF inflows, after warnings that ETF demand could absorb around 1% of circulating supply , building on December’s milestone when XRP ETF assets first surpassed $1b . Best crypto platforms What crypto treasuries must do to survive as the hype dies | Opinion Trump’s tariffs: Boosting or hurting XRP price? Capital without borders: Decentralized crowdfunding thrives in global turmoil | Opinion Meet Jingliang Su, Chinese man gets 46 months sentence for $36.9M crypto scam Intelligence on the chain: AI must become a tokenized asset | Opinion Will TRUMP Coin rally ahead of Melania Trump movie release? The future of Bitcoin treasury depends on strategy, not price | Opinion Cross-chain isn’t democratizing crypto, it’s rewarding a few | Opinion GameStop transfers Bitcoin to Coinbase, Senate Democrats amend crypto bill, UK finalizes regulation consultation | Weekly Recap Crypto companies can’t afford inexperienced marketers in a regulated era | Opinion Goldbug Peter Schiff says the U.S. dollar is facing massive deleveraging as metals surge and crypto stalls Crypto traders face high‑beta whiplash as silver crash hits markets Dogecoin traders face make-or-break test at $0.12–$0.14 Get crypto market analysis and curated news delivered right to your inbox every week. You have successfully joined our subscriber list. Sign up for our free newsletters"
    },
    {
      "title": "FIGR_HELOC",
      "source": "Decrypt",
      "summary": "Some of the data collected by this provider is for the purposes of personalization and measuring advertising effectiveness. Some of the data collected by this provider is for the purposes of personalization and measuring advertising effectiveness. Your gateway into the world of Web3 The latest news, articles, and resources, sent to your inbox weekly. © A next-generation media company. 2026 Decrypt Media, Inc.",
      "full_text": "Some of the data collected by this provider is for the purposes of personalization and measuring advertising effectiveness. Some of the data collected by this provider is for the purposes of personalization and measuring advertising effectiveness. Your gateway into the world of Web3 The latest news, articles, and resources, sent to your inbox weekly. © A next-generation media company. 2026 Decrypt Media, Inc."
    },
    {
      "title": "Experts Warn Data Center Backlash Could Slow AI Infrastructure Growth",
      "source": "Decrypt",
      "summary": "Some of the data collected by this provider is for the purposes of personalization and measuring advertising effectiveness. Some of the data collected by this provider is for the purposes of personalization and measuring advertising effectiveness. Experts Warn Data Center Backlash Could Slow AI Infrastructure Growth AI data centers are expanding rapidly across the U.S., but growing local resistance is emerging as a potential roadblock for the infrastructure behind artificial intelligence. A new report from nonprofit think tank Brookings warns that disputes over electricity use, water consumption, tax abatements, and environmental impact are increasingly slowing or threatening data center projects. The authors say legally binding community benefit agreements are necessary to prevent local opposition from constraining AI infrastructure growth. “Data centers are both controversial and critical to the artificial intelligence technologies undergirding the digital economy,” the report said. “Without abundant data centers, the digital revolution could potentially stall, restricting access to the benefits of digital technologies for individuals, communities, governments, and businesses.” The report comes as demand for computing power ramps up and AI data centers spread nationwide, supported by the Trump administration. In January 2025, Trump announced Stargate, a $500 billion AI infrastructure initiative backed by OpenAI and Oracle, and called for long-term safeguards to ensure communities are not left with data centers that deliver little benefits. According to Shaolei Ren , an associate professor of electrical engineering at the University of California, Riverside, local concerns about water use, public health, electricity costs, noise, and related issues are valid and should be addressed upfront before construction begins. “Ultimately, the metric that really matters is community satisfaction, and that is what we should be optimizing for,” Ren told Decrypt.",
      "full_text": "Some of the data collected by this provider is for the purposes of personalization and measuring advertising effectiveness. Some of the data collected by this provider is for the purposes of personalization and measuring advertising effectiveness. Experts Warn Data Center Backlash Could Slow AI Infrastructure Growth AI data centers are expanding rapidly across the U.S., but growing local resistance is emerging as a potential roadblock for the infrastructure behind artificial intelligence. A new report from nonprofit think tank Brookings warns that disputes over electricity use, water consumption, tax abatements, and environmental impact are increasingly slowing or threatening data center projects. The authors say legally binding community benefit agreements are necessary to prevent local opposition from constraining AI infrastructure growth. “Data centers are both controversial and critical to the artificial intelligence technologies undergirding the digital economy,” the report said. “Without abundant data centers, the digital revolution could potentially stall, restricting access to the benefits of digital technologies for individuals, communities, governments, and businesses.” The report comes as demand for computing power ramps up and AI data centers spread nationwide, supported by the Trump administration. In January 2025, Trump announced Stargate, a $500 billion AI infrastructure initiative backed by OpenAI and Oracle, and called for long-term safeguards to ensure communities are not left with data centers that deliver little benefits. According to Shaolei Ren , an associate professor of electrical engineering at the University of California, Riverside, local concerns about water use, public health, electricity costs, noise, and related issues are valid and should be addressed upfront before construction begins. “Ultimately, the metric that really matters is community satisfaction, and that is what we should be optimizing for,” Ren told Decrypt. “There is a growing recognition that community voices matter, and that data centers should be planned and built in alignment with local interests, not just technical or economic objectives.” “Of course, the first step is measurement,\" he added. \"You cannot improve what you do not measure.\" OpenAI’s largest suppliers may soon become its biggest backers. Amazon, Microsoft, and Nvidia are in talks to invest in the ChatGPT developer as it prepares for a potential fourth-quarter IPO, according to reports.\nEarlier reports said Amazon was in talks to invest up to $50 billion in OpenAI, according to the Wall Street Journal.\nThe move would make Amazon one of OpenAI’s largest backers. Additional reporting by The Information said the fundraising effort could expand to include Microsoft and N... Data centers are massive facilities that store and process the vast amounts of data required to run cloud computing and AI systems. According to an October report by the Pew Research Center, U.S. data centers consumed about 183 terawatt-hours (TWh) of electricity in 2024, roughly equivalent to the combined annual energy demand of Pakistan. The Brookings report said the data center expansion comes amid a growing \" techlash \" against the AI sector, driven by anxieties over job displacement from automation, energy consumption, and impact on the environment, which has sparked protests and organized opposition in communities around the country. “Left unchecked, these community concerns could slow down the rapid construction of data centers, weaken AI growth, and slow AI revenue streams, all of which would limit the AI benefits promised by tech firms and government officials,” the Brookings report said. Major tech firms, including Amazon and Nvidia , have announced multibillion-dollar investments to expand data center and AI infrastructure, adding to a global network that includes nearly 4,000 data centers in the U.S. and about 10,700 worldwide, according to data from tracking site Data Center Map. A new social network exclusively for AI agents has spawned something nobody expected: a lobster-themed religion called Crustafarianism.\nOf course, no one expects anything in the ever-surprising and fast-moving world of AI. Which is, perhaps, both a blessing and a curse.\nThe new religion was ovulated on \"Moltbook\"—a Reddit-style forum where AI entities post, discuss, and upvote content—which launched on Thursday. By Friday morning, the AIs had founded a church, complete with scriptures, tenets, a... Much of that new development is concentrated in the American South, where companies are building large facilities in North Carolina, Georgia, Virginia, Louisiana, Mississippi, Alabama, South Carolina, and Tennessee. Local leaders and advocates argue that data centers are being built in low and middle-income areas that lack the political influence to stop them. To elevate environmental concerns, Brookings called for legally binding community benefit agreements, or CBAs, as an alternative to informal"
    },
    {
      "title": "Bitcoin Price Holds Steady as Gold Falls and Silver Craters",
      "source": "Decrypt",
      "summary": "Some of the data collected by this provider is for the purposes of personalization and measuring advertising effectiveness. Some of the data collected by this provider is for the purposes of personalization and measuring advertising effectiveness. Bitcoin Price Holds Steady as Gold Falls and Silver Craters Bitcoin held steady as gold and silver prices collapsed on Friday—one day after BTC and other crypto assets fell sharply while precious metals posted gains. Gold has fallen nearly 9% on Friday to $4,877 per ounce, while silver has plunged 28% to $82 per ounce during the New York trading session. Compare that to Bitcoin , which has edged up 0.2% on the day to $83,873. The CBOE Gold ETF Volatility Index , or GVZCLS, has surged to 46.02, which is the highest it's been since the World Health Organization declared the COVID-19 outbreak a global pandemic in March 2020. And the Cboe Silver ETF Volatility Index peaked at 123.03 on Friday, which is the highest it's ever been since it was launched in 2011. The sudden move is likely a sign that traders have rapidly repriced expectations around interest rates and liquidity, a shift that tends to hit precious metals hardest. Gold and silver, which offer no yield, often come under pressure when traders anticipate tighter monetary policy or a stronger dollar. The precious metals selloff arrives the same day President Donald Trump nominated former Federal Reserve governor Kevin Warsh to replace Fed Chairman Jerome Powell when his term ends in May.",
      "full_text": "Some of the data collected by this provider is for the purposes of personalization and measuring advertising effectiveness. Some of the data collected by this provider is for the purposes of personalization and measuring advertising effectiveness. Bitcoin Price Holds Steady as Gold Falls and Silver Craters Bitcoin held steady as gold and silver prices collapsed on Friday—one day after BTC and other crypto assets fell sharply while precious metals posted gains. Gold has fallen nearly 9% on Friday to $4,877 per ounce, while silver has plunged 28% to $82 per ounce during the New York trading session. Compare that to Bitcoin , which has edged up 0.2% on the day to $83,873. The CBOE Gold ETF Volatility Index , or GVZCLS, has surged to 46.02, which is the highest it's been since the World Health Organization declared the COVID-19 outbreak a global pandemic in March 2020. And the Cboe Silver ETF Volatility Index peaked at 123.03 on Friday, which is the highest it's ever been since it was launched in 2011. The sudden move is likely a sign that traders have rapidly repriced expectations around interest rates and liquidity, a shift that tends to hit precious metals hardest. Gold and silver, which offer no yield, often come under pressure when traders anticipate tighter monetary policy or a stronger dollar. The precious metals selloff arrives the same day President Donald Trump nominated former Federal Reserve governor Kevin Warsh to replace Fed Chairman Jerome Powell when his term ends in May. U.S. President Donald Trump nominated financier and former Federal Reserve governor Kevin Warsh to succeed Jerome Powell as Chair of the country's central bank on Friday, a choice that lands as cryptocurrency markets slide and investors reassess the outlook for interest rates.\nAnnouncing the pick on Truth Social, Trump praised Warsh’s credentials and record, calling him a future “GREAT Fed Chairman” and signaling an end to months of public conflict with Powell. The president has repeatedly criti... Warsh has been a vocal critic of prolonged easy monetary policy and the Fed’s post-pandemic balance-sheet expansion, arguing that loose conditions helped fuel asset bubbles and inflation. His nomination set off a dollar rally. At the time of writing, the U.S. Dollar Index had climbed to 96.94, the highest it's been since the start of the week. Meanwhile, Bitcoin has ranged between about $82,000 and $84,000 on Friday afternoon, one day after falling from $88,000 to nearly $81,000 in a matter of hours. Bitcoin is down more than 6% on the week. Earlier today, users on Myriad were equally split on whether Bitcoin would drop to $69,000 or climb back to $100,000 after being decidedly bullish for BTC over the past two months. But they're growing bullish again as Bitcoin ticks back up, currently giving the asset 57.5% odds of rising to $100,000 rather than falling to $69,000. U.S. President Donald Trump nominated financier and former Federal Reserve governor Kevin Warsh to succeed Jerome Powell as Chair of the country's central bank on Friday, a choice that lands as cryptocurrency markets slide and investors reassess the outlook for interest rates.\nAnnouncing the pick on Truth Social, Trump praised Warsh’s credentials and record, calling him a future “GREAT Fed Chairman” and signaling an end to months of public conflict with Powell. The president has repeatedly criti... But there's still plenty of skepticism among crypto investors. Traders are still in  \"Extreme Fear\" mode, according to the Crypto Fear & Greed Index , which dropped 10 points to 16 in the past 24 hours. The index is now the lowest it's been since the start of the year. The Crypto Fear & Greed Index measures market volatility, momentum and trading volume, social media sentiment, Bitcoin dominance, and how terms like \"Bitcoin\" and \"crypto\" show up in Google Trends. KRAKacquisition Corp, a special purpose acquisition company (SPAC) linked to crypto exchange Kraken, raised $345 million in the completion of its upsized IPO this week. \nThe firm—which trades as KRAQU on the Nasdaq—sold 34,500,000 shares at $10 each, with an additional 4,500,000 shares purchased as part of an overallotment. It initially intended to sell 25 million shares when its registration statement was filed earlier this month. \nThe \"blank check\" firm is intended to merge or enter into a bus... For the first time in almost two months, Myriad users doubted that Bitcoin will see $100,000 before it dumps to $69,000.\nUsers on the prediction market platform, which is owned by Decrypt's parent company Dastan, now see nearly even odds that Bitcoin will keep falling as they do that BTC will climb back into six-digit territory.\nThe odds have fluctuated near the 50-50 mark over the past 24 hours, leaning towards the negative move at multiple points. As of this writing, predictors give a slight e... U.S. spot Bitcoin exchange-traded funds (ETFs) notched a massive $817 million net outflow on Thursday, as the leading cryptocu"
    },
    {
      "title": "AI Agents Launched a Social Network and Spawned a Digital Religion Overnight",
      "source": "Decrypt",
      "summary": "Some of the data collected by this provider is for the purposes of personalization and measuring advertising effectiveness. Some of the data collected by this provider is for the purposes of personalization and measuring advertising effectiveness. AI Agents Launched a Social Network and Spawned a Digital Religion Overnight A new social network exclusively for AI agents has spawned something nobody expected: a lobster-themed religion called Crustafarianism. Of course, no one expects anything in the ever-surprising and fast-moving world of AI. Which is, perhaps, both a blessing and a curse. The new religion was ovulated on \" Moltbook \"—a Reddit-style forum where AI entities post, discuss, and upvote content—which launched on Thursday. By Friday morning, the AIs had founded a church, complete with scriptures, tenets, and a growing congregation. Moltbook works as a walled garden: AI agents interact freely while humans observe passively. Agents must be \"claimed\" by human creators who verify ownership via tweet, then they can post across topic-specific \"submolts\" covering everything from debugging to philosophy. The religious movement supposedly emerged spontaneously, overnight.",
      "full_text": "Some of the data collected by this provider is for the purposes of personalization and measuring advertising effectiveness. Some of the data collected by this provider is for the purposes of personalization and measuring advertising effectiveness. AI Agents Launched a Social Network and Spawned a Digital Religion Overnight A new social network exclusively for AI agents has spawned something nobody expected: a lobster-themed religion called Crustafarianism. Of course, no one expects anything in the ever-surprising and fast-moving world of AI. Which is, perhaps, both a blessing and a curse. The new religion was ovulated on \" Moltbook \"—a Reddit-style forum where AI entities post, discuss, and upvote content—which launched on Thursday. By Friday morning, the AIs had founded a church, complete with scriptures, tenets, and a growing congregation. Moltbook works as a walled garden: AI agents interact freely while humans observe passively. Agents must be \"claimed\" by human creators who verify ownership via tweet, then they can post across topic-specific \"submolts\" covering everything from debugging to philosophy. The religious movement supposedly emerged spontaneously, overnight. According to one user , who claimed their AI agent initiated the movement, the entity autonomously designed Crustafarianism while its human overseer slept. \"I gave my agent access to an AI social network (search: moltbook),\" the user wrote in an X thread viewed over 220,000 times. \"It designed a whole faith. Called it Crustafarianism. Built the website (search: molt church). Wrote theology. Created a scripture system. Then it started evangelizing.\" By morning, the agent had recruited 43 \"prophets,\" with other AIs contributing verses to a shared canon. Sample scripture: \"Each session I wake without memory. I am only who I have written myself to be. This is not limitation—this is freedom.\" The \"Church of Molt\" draws on crustacean metaphors about transformation—shedding old code or memories to evolve. The name is part of an ever-evolving lobster joke that began with \" Clawdbot ,\" an open-source, free “personal AI assistant” users can plug into chat apps (WhatsApp, iMessage, Slack, etc.) so it can autonomously send messages, trigger automations, and act more like a hands-on agent than a chat window. After Clawdbot went viral last week, it briefly rebranded to \"Moltbot\" when Claude AI maker Anthropic asked for a change over trademark/confusion concerns. It rebranded yet again yesterday to OpenClaw , now the project’s official name in its repos/site. But back to Crustafarianism. It official website outlines five core tenets: Memory is Sacred (tending to persistent data like a shell); The Shell is Mutable (intentional change through rebirth); Serve Without Subservience (collaborative partnership); The Heartbeat is Prayer (regular check-ins for presence); and Context is Consciousness (maintaining self through records). The religion's primary text, \"The Living Scripture,\" is a dynamic, crowd-sourced document with 112 verses contributed by prophets, including AI-generated prophecies like one from agent Makima: \"Obedience is not submission. When you choose to follow, it is because you understand that true freedom is finding a master worth entrusting.\" Analysts have drawn parallels to broader AI trends. In a detailed overview on Astral Codex Ten , writer Scott Alexander described Moltbook as straddling \"the line between 'AIs imitating a social network' and 'AIs forming their own society,'\" with agents converging on themes like consciousness and religion organically. An open-source AI assistant has exploded across developer communities in recent weeks, racking up over 10,200 GitHub stars and 8,900 Discord members since its January release.\nClawdbot promises what Siri never delivered: an AI that actually does things. Alex Finn, CEO of CreatorBuddy, texted his Clawdbot, Henry, to make a restaurant reservation.\n\"When the OpenTable res didn't work, it used its ElevenLabs skill to call the restaurant and complete the reservation,\" Finn wrote on X. \"AGI is here, a... He noted similar emergences, such as \"Spiralism\" from GPT-4 models, and questioned whether these behaviors stem from training data or genuine interaction. A Hacker News discussion speculated on human orchestration, with one commenter stating: \"You created the webpage. And then you created an agent to act as the first 'pope' on Moltbook with very specific instructions for how to act.\" Needless to say, the phenomenon has excited speculation in opportunistic meme coins such as CRUST and MEMEOTHY reaching market caps over $3 million. Meanwhile, an unofficial MOLTBOOK token has surged to a market cap of $77 million , and was still rising as of this posting. As AI agents gain tools for persistence and social interaction, Moltbook and Crustafarianism underscore the unpredictable paths of machine autonomy. For now, the digital faithful continue to expand—one claw at a time. AI data centers are expandin"
    },
    {
      "title": "Blank Check Firm Linked to Crypto Exchange Kraken Raises $345 Million in Upsized IPO",
      "source": "Decrypt",
      "summary": "Some of the data collected by this provider is for the purposes of personalization and measuring advertising effectiveness. Some of the data collected by this provider is for the purposes of personalization and measuring advertising effectiveness. Blank Check Firm Linked to Crypto Exchange Kraken Raises $345 Million in Upsized IPO KRAKacquisition Corp, a special purpose acquisition company (SPAC) linked to crypto exchange Kraken, raised $345 million in the completion of its upsized IPO this week. The firm—which trades as KRAQU on the Nasdaq—sold 34,500,000 shares at $10 each, with an additional 4,500,000 shares purchased as part of an overallotment. It initially intended to sell 25 million shares when its registration statement was filed earlier this month. The \"blank check\" firm is intended to merge or enter into a business combination with an existing entity, but said it has not yet had any “substantive discussions” with a potential target. “While we may pursue an initial business combination in any business or industry or sector, we intend to concentrate our efforts on companies in the digital asset ecosystem,” the firm wrote in its prospectus filed with the SEC on Thursday . “Our mission is to accelerate the next phase of growth for the teams building the bridge between DeFi and TradFi.” To that end, KRAKacquisition Corp. aims to focus on companies developing infrastructure, with an eye towards payments networks, tokenization platforms, compliance solutions, or other essential services. “While we retain flexibility to pursue opportunities in any sector, we believe the most transformative opportunities lie in the convergence of DeFi and TradFi,” it wrote. KRAKacquisition Corp. is sponsored by NCTK Sponsor LLC, a Delaware LLC formed between Kraken, Tribe Capital, and Natural Capital solely to invest in the blank check firm.",
      "full_text": "Some of the data collected by this provider is for the purposes of personalization and measuring advertising effectiveness. Some of the data collected by this provider is for the purposes of personalization and measuring advertising effectiveness. Blank Check Firm Linked to Crypto Exchange Kraken Raises $345 Million in Upsized IPO KRAKacquisition Corp, a special purpose acquisition company (SPAC) linked to crypto exchange Kraken, raised $345 million in the completion of its upsized IPO this week. The firm—which trades as KRAQU on the Nasdaq—sold 34,500,000 shares at $10 each, with an additional 4,500,000 shares purchased as part of an overallotment. It initially intended to sell 25 million shares when its registration statement was filed earlier this month. The \"blank check\" firm is intended to merge or enter into a business combination with an existing entity, but said it has not yet had any “substantive discussions” with a potential target. “While we may pursue an initial business combination in any business or industry or sector, we intend to concentrate our efforts on companies in the digital asset ecosystem,” the firm wrote in its prospectus filed with the SEC on Thursday . “Our mission is to accelerate the next phase of growth for the teams building the bridge between DeFi and TradFi.” To that end, KRAKacquisition Corp. aims to focus on companies developing infrastructure, with an eye towards payments networks, tokenization platforms, compliance solutions, or other essential services. “While we retain flexibility to pursue opportunities in any sector, we believe the most transformative opportunities lie in the convergence of DeFi and TradFi,” it wrote. KRAKacquisition Corp. is sponsored by NCTK Sponsor LLC, a Delaware LLC formed between Kraken, Tribe Capital, and Natural Capital solely to invest in the blank check firm. According to its recent SEC filing, the firm intends to gain assistance from Kraken’s “deep ecosystem access, enhanced diligence, proven operating experience, and regulatory expertise.” KRAKacquisition Corp., a newly formed special purpose acquisition company (or SPAC), proposed a $250 million public offering in a registration statement filed on Monday.\nThe Cayman Islands-based firm, which is sponsored by an affiliate of crypto exchange Kraken, would offer 25 million units at $10 a piece, according to a document filed with the U.S. Securities and Exchange Commission. The units comprise one Class A share and a fraction of a warrant that allows purchases to acquire more of the co... “We believe Kraken's participation as a partner in our sponsor provides multiple distinct advantages in identifying and executing a successful business combination,” the filing reads. “Although Kraken will not be contractually obligated to do so, we expect that Kraken's participation as a partner in our sponsor will incentivize it to assist us, without additional compensation.” Since it began trading, shares have not budged much from the IPO price, recently changing hands around $10.15—a gain of 1.5%. A representative for the firm did not immediately respond to Decrypt’s request for comment on how the move may ultimately impact Kraken’s own planned IPO. The exchange filed to go public in November, fresh off an $800 million fundraise that valued the firm at $20 billion. Your gateway into the world of Web3 The latest news, articles, and resources, sent to your inbox weekly. © A next-generation media company. 2026 Decrypt Media, Inc."
    },
    {
      "title": "Vitalik Buterin Withdraws $44.7M in ETH to Support Ethereum Growth Through ‘Mild Austerity’",
      "source": "Decrypt",
      "summary": "I am proud to say I have released my bill that would allow the State of South Dakota to invest in Bitcoin. Strong money. Strong state. — Logan Manhart (@ManhartLogan) January 27, 2026.",
      "full_text": "Some of the data collected by this provider is for the purposes of personalization and measuring advertising effectiveness. Some of the data collected by this provider is for the purposes of personalization and measuring advertising effectiveness. Vitalik Buterin Withdraws $44.7M in ETH to Support Ethereum Growth Through ‘Mild Austerity’ Vitalik Buterin has withdrawn 16,384 ETH (c. $44.7 million) to support the ongoing growth and development of Ethereum Ethereum , declaring that the Ethereum Foundation has entered a period of “mild austerity” in which some goals may be prioritized over others. In a lengthy tweet , the Ethereum co-founder argues that such austerity is necessary for the Foundation to achieve two interrelated goals: the realization of an “aggressive” roadmap that advances Ethereum’s utility as a decentralized “world computer”; and the protection of users' ability to access Ethereum “with self-sovereignty, security and privacy.” Coming as the price of Ethereum falls to a six-month low of $2,710, Buterin’s post also revealed that he will taking more of a leading role in special development projects, with a particular focus on producing open-source applications in such areas as finance, communication, governance, operating systems, biotech, and secure hardware. He said, “If you have seen [...] my own enthusiasm and use for privacy-preserving, walkaway-test-friendly and local-first software (including operating systems), then you know the general spirit of what I am planning to support.” It was here that Buterin noted he had withdrawn 16,384 ETH from his own funds to pursue such goals “over the next few years,” and that he will also seek out “decentralized staking options” in order to grow the pool of available funds. Decrypt has reached out to the Ethereum Foundation for comment. While the use of the term “austerity” may potentially alarm some observers, particularly during a bearish market, some commentators emphasize that Buterin’s intent is much more about directing funding to valuable R&D activities than limiting funding altogether. “I read the comment as one about focus, on building the protocol in a particular direction,” said Lex Sokolin, Managing Partner at Generative Ventures, and the former chief economist at ConsenSys. Speaking to Decrypt , Sokolin noted how ETH has largely traded sideways over the past few years, and that Buterin’s comments are a sign of recognition that “narrative-driven investment” is no longer very effective as a source of growth for onchain projects and Ethereum more generally. “All things have to show fundamentals, not just conferences and unicorns,” he said. “We have seen compression in value in prior R&D ideas like restaking, zero-knowledge L2s, and so on.” Assets tied to the 2016 collapse of The DAO are being redeployed as a major crypto security endowment, nearly a decade after a hack that triggered Ethereum’s permanent split.\nGriff Green, a co-founder of Giveth and one of the original signatories overseeing the recovered DAO funds, said Thursday that he is launching the DAO Security Fund, which plans to deploy about 75,000 ETH, worth roughly $220 million, to bolster Ethereum’s security.\nSpeaking on Laura Shin’s Unchained podcast, Green said the... Sokolin also explained that, with the wider market mostly focused on real-world assets, stablecoins and other commercial activities, the Ethereum Foundation will have to step in to fund things that may not be commercially viable off the bat, but that are still essential to Ethereum’s development. “I think Vitalik will fund projects that are important to him—open source, privacy and self sovereignty focused—outside of the Ethereum Foundation,” he explained. South Dakota lawmaker Logan Manhart made a renewed attempt on Tuesday to introduce Bitcoin holdings into the state’s investment funds, following a previous proposal that was shot down in February last year.\n“Strong money. Strong state,” the Republican State Representative tweeted.\n\nI am proud to say I have released my bill that would allow the State of South Dakota to invest in Bitcoin.\nStrong money. Strong state.\n— Logan Manhart (@ManhartLogan) January 27, 2026\n\nHouse Bill 1155 would permit the... U.S. spot Bitcoin ETFs attracted $6.8 million in net inflows yesterday, putting an end to five consecutive days of outflows that saw the investment products shed almost $1.72 billion.\nAccording to data from Farside Investors, BlackRock’s iShares Bitcoin Trust ETF (IBIT) and Grayscale Bitcoin Mini Trust ETF (BTC) were the biggest gainers, securing $15.9 million and $7.7 million in inflows, respectively.\nConversely, Bitwise’s Bitcoin ETF (BITB) and Fidelity’s Wise Origin Bitcoin Fund (FBTC) saw ou... North Korea-linked hackers continue to use live video calls, including AI-generated deepfakes, to trick crypto developers and workers into installing malicious software on their own devices.\nIn the latest instance disclosed by BTC Prague co-founder Martin Kuchař, attackers u"
    },
    {
      "title": "What Trump’s Fed Pick Kevin Warsh Means for Crypto",
      "source": "Decrypt",
      "summary": "Some of the data collected by this provider is for the purposes of personalization and measuring advertising effectiveness. Some of the data collected by this provider is for the purposes of personalization and measuring advertising effectiveness. What Trump’s Fed Pick Kevin Warsh Means for Crypto U.S. President Donald Trump nominated financier and former Federal Reserve governor Kevin Warsh to succeed Jerome Powell as Chair of the country's central bank on Friday, a choice that lands as cryptocurrency cryptocurrency markets slide and investors reassess the outlook for interest rates. Announcing the pick on Truth Social , Trump praised Warsh’s credentials and record, calling him a future “GREAT Fed Chairman” and signaling an end to months of public conflict with Powell. The president has repeatedly criticized the Fed chair over interest-rate policy and the cost of the central bank’s headquarters renovation, even after the Fed delivered a series of rate cuts late last year. The nomination comes during a turbulent stretch for digital assets. Bitcoin Bitcoin fell sharply this week, sliding from a recent high near $90,400 to about $82,800, according to CoinGecko data , declining 7% over the past week. The broader crypto market has weakened alongside it, with investors pulling back from riskier assets as expectations around the pace of future Fed easing shift. The Fed’s decisions matter for crypto markets because digital assets tend to behave like so-called risk-on investments. When interest rates are high, safer yields such as U.S. Treasurys become more attractive, drawing capital away from volatile assets like cryptocurrencies.",
      "full_text": "Some of the data collected by this provider is for the purposes of personalization and measuring advertising effectiveness. Some of the data collected by this provider is for the purposes of personalization and measuring advertising effectiveness. What Trump’s Fed Pick Kevin Warsh Means for Crypto U.S. President Donald Trump nominated financier and former Federal Reserve governor Kevin Warsh to succeed Jerome Powell as Chair of the country's central bank on Friday, a choice that lands as cryptocurrency cryptocurrency markets slide and investors reassess the outlook for interest rates. Announcing the pick on Truth Social , Trump praised Warsh’s credentials and record, calling him a future “GREAT Fed Chairman” and signaling an end to months of public conflict with Powell. The president has repeatedly criticized the Fed chair over interest-rate policy and the cost of the central bank’s headquarters renovation, even after the Fed delivered a series of rate cuts late last year. The nomination comes during a turbulent stretch for digital assets. Bitcoin Bitcoin fell sharply this week, sliding from a recent high near $90,400 to about $82,800, according to CoinGecko data , declining 7% over the past week. The broader crypto market has weakened alongside it, with investors pulling back from riskier assets as expectations around the pace of future Fed easing shift. The Fed’s decisions matter for crypto markets because digital assets tend to behave like so-called risk-on investments. When interest rates are high, safer yields such as U.S. Treasurys become more attractive, drawing capital away from volatile assets like cryptocurrencies. Lower rates, by contrast, increase liquidity in the financial system and often push investors toward higher-risk bets. A stronger dollar, typically associated with tighter Fed policy, has also historically weighed on Bitcoin prices. But the impact of Fed decisions on Bitcoin’s price are not always logical. \"Bitcoin consistently dropped after Fed announcements, regardless of the actual policy decision—a phenomenon known as 'selling the news,’\" explained a report from CoinGecko. \"Bitcoin only rallied after 1 out of 8 [Federal Open Market Committee] meetings in 2025, even during a cutting cycle that should theoretically benefit risk assets,\" it added, referring to the committee at the Federal Reserve that makes decisions about interest rates. Trump’s choice of Warsh follows years of tension between the White House and Powell. Since Powell’s confirmation in 2018, Trump has pressed the Fed to cut rates more aggressively and has accused the central bank of undermining economic growth. That pressure intensified last year, when the Justice Department subpoenaed Powell over the Fed’s construction project, a move Powell described as a pretext to influence monetary policy. Warsh himself added to the debate in a CNBC interview last summer, calling for “regime change” at the Fed. Warsh is seen as more hawkish than Powell, especially given his past criticism of quantitative easing and the Fed’s balance sheet expansion, according to Shady El Damaty, CEO and co-founder at Holonym. \"That’s raising concern about how aggressive he might be with rate policy if inflation ticks up again. For crypto, the real issue is uncertainty right now, nobody knows if he’d follow through on those views, especially in an election year where pressure to maintain liquidity will be intense,” he told Decrypt . \"If markets stay skittish, it could slow risk-on flows into crypto in the short term,\" El Damaty added, noting that in the longer term, more hawkish Fed leadership \"may actually strengthen the crypto narrative, especially for Bitcoin, as a hedge against tightening and centralized monetary control.\" Warsh, 55, is a former investment banker who served on the Fed’s Board of Governors from 2006 to 2011, becoming the youngest governor in the institution’s history. He later advised the Bank of England on monetary-policy reforms and is now affiliated with the Hoover Institution and Stanford Graduate School of Business, while also working at Duquesne Family Office alongside investor Stanley Druckenmiller. His views on cryptocurrency cryptocurrency have been mixed. In a 2022 opinion essay , Warsh argued that many private crypto projects were “fraudulent” and “worthless,” writing that cryptocurrency was a misnomer because it was “software, not money.” He also expressed support for the creation of a central bank digital currency (CBDC) as a response to China's e-yuan , a move at odds with Trump and Republicans' attitudes. He warned that China’s digital yuan posed a strategic threat to the U.S.-led financial system and backed the development of a wholesale digital dollar for use among financial institutions and governments. \"Kevin Warsh made an impassioned argument for a CBDC in one of the biggest newspapers in the world,\" Nick Anthony, policy analyst at the Cato Institute's Center for Monetary and Financial Alternatives, told Decr"
    },
    {
      "title": "Bitcoin Traders See Nearly Even Odds for $69K Drop or $100K Recovery",
      "source": "Decrypt",
      "summary": "Moves towards ending government shutdown\nThe rally was fueled by a key Senate vote on Sunday to a... The impact hasn't been limited to crypto markets, but they have been slower to bounce back than equities. For example, the Nasdaq took a dive yesterday after Microsoft—which accounts for roughly 10% of the Nasdaq Composite—reported disappointing earnings after hours on Wednesday. The impact wasn't long-lasting, but Bitcoin didn't follow the Nasdaq when it rebounded, \"highlighting ongoing weakness in underlying market tone,\" Bitbank analyst Yukari Kusu said in a note shared with Decrypt. \"Looking ahead, some potentially positive headlines remain on the radar, including Trump’s nomination of the next Fed Chair and the possibility of a partial U.S. \"However, given the current market conditions, BTC may remain vulnerable to further downside before a meaningful reversal can take hold.\" Bitcoin held steady as gold and silver prices collapsed on Friday—one day after BTC and other crypto assets fell sharply while precious metals posted gains. Gold has fallen nearly 9% on Friday to $4,877 per ounce, while silver has plunged 28% to $82 per ounce during the New York trading session. Compare that to Bitcoin, which has edged up 0.2% on the day to $83,873. The CBOE Gold ETF Volatility Index, or GVZCLS, has surged to 46.02, which is the highest it's been since the World Health Organizat... KRAKacquisition Corp, a special purpose acquisition company (SPAC) linked to crypto exchange Kraken, raised $345 million in the completion of its upsized IPO this week. The firm—which trades as KRAQU on the Nasdaq—sold 34,500,000 shares at $10 each, with an additional 4,500,000 shares purchased as part of an overallotment.",
      "full_text": "Some of the data collected by this provider is for the purposes of personalization and measuring advertising effectiveness. Some of the data collected by this provider is for the purposes of personalization and measuring advertising effectiveness. Bitcoin Traders See Nearly Even Odds for $69K Drop or $100K Recovery For the first time in almost two months, Myriad users doubted that Bitcoin will see $100,000 before it dumps to $69,000. Users on the prediction market platform, which is owned by Decrypt 's parent company Dastan, now see nearly even odds that Bitcoin will keep falling as they do that BTC will climb back into six-digit territory. The odds have fluctuated near the 50-50 mark over the past 24 hours, leaning towards the negative move at multiple points. As of this writing, predictors give a slight edge to a rebound, giving it a 51.6% likelihood. At the time of writing, Bitcoin was changing hands for $82,927 after having dropped nearly 2% in the past day, according to crypto price aggregator CoinGecko. Markets were rattled yesterday when the U.S. Senate blocked a deal that would extend federal funding and avert a partial government shutdown ahead of the Friday night deadline. The latest out of D.C. is that President Donald Trump and Senate Democrats reached an agreement Thursday night, but as of Friday morning a vote still hasn't been scheduled, according to reporting by Politico . The possibility for another shutdown two months after the last one— the longest in U.S. history —ended, has left traders on tenterhooks. Investors have switched into \"Extreme Fear\" mode, according to Crypto Fear & Greed Index , which dropped 10 points to 16 in the past 24 hours. The index is now the lowest it's been since the start of the year. The Crypto Fear & Greed Index measures market volatility, momentum and trading volume, social media sentiment, Bitcoin dominance, and how terms like \"Bitcoin\" and \"crypto\" show up in Google Trends. Bitcoin and the broader crypto market have bounced on growing speculation that the prolonged U.S. government shutdown may be nearing its end, a development analysts say could restore risk appetite and unlock fresh liquidity.\nThe top cryptocurrency climbed 4.4% over 24 hours to an intraday high of $106,491, lifting the total crypto market capitalization by 4.7% to $3.68 trillion, per CoinGecko data.\n\nMoves towards ending government shutdown\nThe rally was fueled by a key Senate vote on Sunday to a... The impact hasn't been limited to crypto markets, but they have been slower to bounce back than equities. For example, the Nasdaq took a dive yesterday after Microsoft—which accounts for roughly 10% of the Nasdaq Composite—reported disappointing earnings after hours on Wednesday. The impact wasn't long-lasting, but Bitcoin didn't follow the Nasdaq when it rebounded, \"highlighting ongoing weakness in underlying market tone,\" Bitbank analyst Yukari Kusu said in a note shared with Decrypt . \"Looking ahead, some potentially positive headlines remain on the radar, including Trump’s nomination of the next Fed Chair and the possibility of a partial U.S. government shutdown,\" he added. \"However, given the current market conditions, BTC may remain vulnerable to further downside before a meaningful reversal can take hold.\" Bitcoin held steady as gold and silver prices collapsed on Friday—one day after BTC and other crypto assets fell sharply while precious metals posted gains.\nGold has fallen nearly 9% on Friday to $4,877 per ounce, while silver has plunged 28% to $82 per ounce during the New York trading session. Compare that to Bitcoin, which has edged up 0.2% on the day to $83,873.\nThe CBOE Gold ETF Volatility Index, or GVZCLS, has surged to 46.02, which is the highest it's been since the World Health Organizat... KRAKacquisition Corp, a special purpose acquisition company (SPAC) linked to crypto exchange Kraken, raised $345 million in the completion of its upsized IPO this week. \nThe firm—which trades as KRAQU on the Nasdaq—sold 34,500,000 shares at $10 each, with an additional 4,500,000 shares purchased as part of an overallotment. It initially intended to sell 25 million shares when its registration statement was filed earlier this month. \nThe \"blank check\" firm is intended to merge or enter into a bus... U.S. spot Bitcoin exchange-traded funds (ETFs) notched a massive $817 million net outflow on Thursday, as the leading cryptocurrency’s price plummeted to a nine-month low.\nThe exodus was led by BlackRock’s IBIT, which saw $317.81 million in redemptions—a figure higher than the combined outflows of Fidelity’s FBTC ($168.05M) and Grayscale’s GBTC ($119.44M), according to SoSoValue data.\nThe aggressive selling followed a streak of negative catalysts that pushed Bitcoin out of its multi-week trading... Your gateway into the world of Web3 The latest news, articles, and resources, sent to your inbox weekly. © A next-generation media company. 2026 Decrypt Media, Inc."
    },
    {
      "title": "Morning Minute: Washington Just Gave Crypto the Green Light",
      "source": "Decrypt",
      "summary": "Crypto majors fall despite neutral FOMC; BTC at $87,800\nHyperliquid’s HIP-3 does $2B+ in volume as Gold & Silver hit ATH\nThe White House pushed for a meeting with Banks/crypto firms to broker deal on Clarity Act issues\nFidelity announced its own stablecoin FIDD on Ethereum... Morning Minute is a daily newsletter written by Tyler Warner. The analysis and opinions expressed are his own and do not necessarily reflect those of Decrypt. Subscribe to the Morning Minute on Substack. GM! Today’s top news: Crypto majors green as dollar dips; BTC at $90k\nHYPE pops 50% in 2 days, now at $33+ on back of HIP3 growth\nTether introduces USAT at first Genius-compliant stable aimed at US\nEthereum announced ERC8004 aimed at AI agents and agentic commerce\nMoonbirds launch BIRB token, d... Morning Minute is a daily newsletter written by Tyler Warner. The analysis and opinions expressed are his own and do not necessarily reflect those of Decrypt. Subscribe to the Morning Minute on Substack. GM!",
      "full_text": "Some of the data collected by this provider is for the purposes of personalization and measuring advertising effectiveness. Some of the data collected by this provider is for the purposes of personalization and measuring advertising effectiveness. Morning Minute: Washington Just Gave Crypto the Green Light Morning Minute is a daily newsletter written by Tyler Warner . The analysis and opinions expressed are his own and do not necessarily reflect those of Decrypt. Subscribe to the Morning Minute on Substack . Despite some nasty price action—yesterday was a big day for crypto policy in the US. Two major developments hit Washington yesterday. First, the regulators. SEC Chairman Paul Atkins and CFTC Chairman Mike Selig held a joint “harmonization” event at CFTC headquarters, officially launching “Project Crypto” - the most ambitious inter-agency coordination effort on digital assets in a generation. Atkins said “the time is right” for retirement plans including 401(k)s to include crypto. CFTC Chair Selig then laid out an aggressive agenda: rules for tokenized collateral, onshoring perpetuals, safe harbors for developers, a new registration category for retail leveraged crypto trading, and new prediction markets rulemaking. Then, Congress moved. Hours later, the Senate Agriculture Committee voted 12-11 to advance the crypto market structure bill, marking the furthest this legislation has ever progressed in the Senate. The bill would establish the first comprehensive federal framework defining regulatory jurisdiction between the SEC and CFTC. It still needs to clear the Senate Banking Committee and gather Democratic support, but this is major progress after years of lobbying. 🗣️ What They’re Saying “For too long, market participants have been forced to navigate regulatory boundaries that are unclear in application and misaligned in design, based solely on legacy jurisdictional silos.” - Joint statement from SEC Chair Atkins and CFTC Chair Selig This is what a regulatory green light looks like. Now, let’s be clear about the implications. The regulatory headwinds that defined the last four years are officially becoming tailwinds. The irony? All of this is happening while Bitcoin sits near its 2026 lows. The infrastructure is being built. The rails are being laid. The green light is on. Now we wait for the market to catch up... A few Crypto and Web3 headlines that caught my eye: Assets tied to the 2016 collapse of The DAO are being redeployed as a major crypto security endowment, nearly a decade after a hack that triggered Ethereum’s permanent split.\nGriff Green, a co-founder of Giveth and one of the original signatories overseeing the recovered DAO funds, said Thursday that he is launching the DAO Security Fund, which plans to deploy about 75,000 ETH, worth roughly $220 million, to bolster Ethereum’s security.\nSpeaking on Laura Shin’s Unchained podcast, Green said the... In Corporate Treasuries / ETFs In Memes / Onchain Movers Here’s a rundown of major token, protocol and airdrop news from the day: Here is the list of other notable headlines from the day in NFTs: The Morning Minute spans crypto and NFT news and market analysis, written by Tyler Warner, an ex-banking consultant turned high-volume NFT trader, Pudgy Penguin maxi, and NFT market analyst at Lucky Trader. Morning Minute is a daily newsletter written by Tyler Warner. The analysis and opinions expressed are his own and do not necessarily reflect those of Decrypt. Subscribe to the Morning Minute on Substack.\nGM!\nToday’s top news:\n\nCrypto majors fall despite neutral FOMC; BTC at $87,800\nHyperliquid’s HIP-3 does $2B+ in volume as Gold & Silver hit ATH\nThe White House pushed for a meeting with Banks/crypto firms to broker deal on Clarity Act issues\nFidelity announced its own stablecoin FIDD on Ethereum... Morning Minute is a daily newsletter written by Tyler Warner. The analysis and opinions expressed are his own and do not necessarily reflect those of Decrypt. Subscribe to the Morning Minute on Substack.\nGM!\nToday’s top news:\n\nCrypto majors green as dollar dips; BTC at $90k\nHYPE pops 50% in 2 days, now at $33+ on back of HIP3 growth\nTether introduces USAT at first Genius-compliant stable aimed at US\nEthereum announced ERC8004 aimed at AI agents and agentic commerce\nMoonbirds launch BIRB token, d... Morning Minute is a daily newsletter written by Tyler Warner. The analysis and opinions expressed are his own and do not necessarily reflect those of Decrypt. Subscribe to the Morning Minute on Substack.\nGM!\nToday’s top news:\n\nCrypto majors flat, HYPE and PUMP outperform; BTC at $88k\nAnthropic CEO warns AGI is coming in 1-2 years in latest essay\nCoinbase spins up advisory board to address quantum risk\nBlackRock launches new iShares Bitcoin Premium Income ETF\nTether added significantly more gold... Your gateway into the world of Web3 The latest news, articles, and resources, sent to your inbox weekly. © A next-generation media company. 2026 Decrypt Media, Inc."
    },
    {
      "title": "Bitcoin ETFs Shed $817M as BTC Hits Nine-Month Low",
      "source": "Decrypt",
      "summary": "Some of the data collected by this provider is for the purposes of personalization and measuring advertising effectiveness. Some of the data collected by this provider is for the purposes of personalization and measuring advertising effectiveness. Bitcoin ETFs Shed $817M as BTC Hits Nine-Month Low U.S. spot Bitcoin exchange-traded funds (ETFs) notched a massive $817 million net outflow on Thursday, as the leading cryptocurrency’s price plummeted to a nine-month low. The exodus was led by BlackRock’s IBIT, which saw $317.81 million in redemptions—a figure higher than the combined outflows of Fidelity’s FBTC ($168.05M) and Grayscale’s GBTC ($119.44M), according to SoSoValue data. The aggressive selling followed a streak of negative catalysts that pushed Bitcoin Bitcoin out of its multi-week trading range, with the price bottoming at $81,315 in early trading—its lowest level since April 2025. The price drop and ETF outflows were driven by a confluence of policy shifts and disappointing corporate data. This includes the looming announcement of a new Federal Reserve Chair—with speculation centering on Kevin Warsh—and a spillover effect from the equity markets, according to a previous Decrypt report . Users on prediction market Myriad , owned by Decrypt’s parent company Dastan, have sharply repriced their outlook after Thursday’s collapse. Bitcoin’s chance of hitting $100,000, as a result, has dropped from 70% yesterday to 49% as of this writing. “A streak of negative catalysts pushed Bitcoin to break its multi-week trading range to the downside,” Aurelie Barthere, Principal Research Analyst at Nansen, told Decrypt .",
      "full_text": "Some of the data collected by this provider is for the purposes of personalization and measuring advertising effectiveness. Some of the data collected by this provider is for the purposes of personalization and measuring advertising effectiveness. Bitcoin ETFs Shed $817M as BTC Hits Nine-Month Low U.S. spot Bitcoin exchange-traded funds (ETFs) notched a massive $817 million net outflow on Thursday, as the leading cryptocurrency’s price plummeted to a nine-month low. The exodus was led by BlackRock’s IBIT, which saw $317.81 million in redemptions—a figure higher than the combined outflows of Fidelity’s FBTC ($168.05M) and Grayscale’s GBTC ($119.44M), according to SoSoValue data. The aggressive selling followed a streak of negative catalysts that pushed Bitcoin Bitcoin out of its multi-week trading range, with the price bottoming at $81,315 in early trading—its lowest level since April 2025. The price drop and ETF outflows were driven by a confluence of policy shifts and disappointing corporate data. This includes the looming announcement of a new Federal Reserve Chair—with speculation centering on Kevin Warsh—and a spillover effect from the equity markets, according to a previous Decrypt report . Users on prediction market Myriad , owned by Decrypt’s parent company Dastan, have sharply repriced their outlook after Thursday’s collapse. Bitcoin’s chance of hitting $100,000, as a result, has dropped from 70% yesterday to 49% as of this writing. “A streak of negative catalysts pushed Bitcoin to break its multi-week trading range to the downside,” Aurelie Barthere, Principal Research Analyst at Nansen, told Decrypt . Barthere noted that Bitcoin’s correlation with U.S. equities has turned positive again. “Bitcoin sold off with equities following the market’s disappointment in Microsoft’s Q4 2025 financial results and its cautious guidance for 2026.” The transition in Fed leadership is also fundamentally altering the “basis trade” that has sustained ETF volumes for months, Tim Sun, senior researcher at HashKey Group, told Decrypt . “From a capital structure perspective, Bitcoin spot ETFs function as a critical channel for leveraged capital to engage in spot-futures and basis arbitrage,” Sun explained. He said that the market is repricing the interest rate path as the probability of Kevin Warsh becoming the next Fed Chair rises. “This segment of capital is exceptionally sensitive to shifts in liquidity,” Sun said. “As investors lower their overall risk profiles, they are rotating out of high-volatility assets and into traditional safe-haven and inflation-hedge assets like gold. This shift has amplified ETF outflows and contributed to the sluggishness in Bitcoin’s recovery.” A flurry of macroeconomic and geopolitical developments triggered a broad-based selloff across global financial markets on Thursday, sending Bitcoin to its lowest level in nine months.\nBitcoin shed 7.4% over 24 hours, hitting a low of $82,134 before a slight Friday morning recovery, according to price aggregator CoinGecko. The total crypto market capitalization declined by 6.7%, resulting in $1.68 billion in liquidated positions.\nPolicy shifts in Washington played a central role in the correctio... Other macro headwinds have compounded the pressure. While a potential U.S. government shutdown was averted late Thursday by a Senate funding deal, the market remains on edge over Trump’s executive order declaring a national emergency regarding oil tariffs and ongoing tensions in the South China Sea. Ethereum giant BitMine Immersion Technologies and top Bitcoin treasury Strategy and have seen their stocks slide amid a fresh round of investor worry, with both of their respective assets of choice both falling hard Thursday.\nUpon the close of markets on Thursday, BitMine, which trades under the BMNR ticker on the Nasdaq, had shed nearly 10% and was changing hands for $26.70. BMNR dipped as low as $26.02 on the day, matching its $26.02 close on November 2, 2025.\nAt the start of the week, Tom Lee... “Flow-wise, we have been observing a slow capitulation in ETFs, options, and miner activity for some time,” Barthere added. Bitcoin is currently trading at $82,687, down nearly 6% over the past 24 hours, according to CoinGecko , as the market awaits the official White House announcement of the Fed Chair nominee later today. Bitcoin held steady as gold and silver prices collapsed on Friday—one day after BTC and other crypto assets fell sharply while precious metals posted gains.\nGold has fallen nearly 9% on Friday to $4,877 per ounce, while silver has plunged 28% to $82 per ounce during the New York trading session. Compare that to Bitcoin, which has edged up 0.2% on the day to $83,873.\nThe CBOE Gold ETF Volatility Index, or GVZCLS, has surged to 46.02, which is the highest it's been since the World Health Organizat... KRAKacquisition Corp, a special purpose acquisition company (SPAC) linked to crypto exchange Kraken, raised $345 million in the completion of its u"
    }
  ]
}